[
  {
    "id": 1,
    "name": "Mountain Pose",
    "cues": [
      "Stand tall with your feet together and arms at your sides. Ground down through your feet, feeling the connection to the earth.",
      "On an inhale, lift your chest and lengthen your spine, reaching through the crown of your head.",
      "Exhale and relax your shoulders away from your ears, keeping your arms relaxed but engaged.",
      "Inhale and firm your thighs, lifting your kneecaps without locking your knees.",
      "Exhale and engage your core, pulling your belly button toward your spine.",
      "Breathe deeply in and out through your nose, grounding yourself and cultivating focus and stability for 5 to 10 breaths."
    ]
  },
  {
    "id": 2,
    "name": "Downward-Facing Dog",
    "cues": [
      "Start in a tabletop position with your hands directly under your shoulders and knees under your hips.",
      "Tuck your toes and lift your hips up and back, aiming to form an inverted V shape with your body.",
      "Press firmly into your hands, spreading your fingers wide to distribute the weight evenly across the palms.",
      "Engage your core to protect your lower back, keeping a slight bend in your knees if needed to maintain a neutral spine.",
      "Lengthen your spine by drawing your tailbone up toward the ceiling and pushing your chest towards your thighs.",
      "Relax your head and neck, keeping a neutral gaze between your legs or toward your feet, and avoid collapsing the neck.",
      "Ground your heels towards the floor, but do not force them down; allow your hamstrings to stretch gradually.",
      "Maintain even weight distribution between your hands and feet, ensuring the arms are straight and the legs are active.",
      "Hold the position for 5 to 10 deep breaths, maintaining steady breathing and a calm, focused mind."
    ]
  },
  {
    "id": 3,
    "name": "Plank Pose",
    "cues": [
      "Begin in a tabletop position on your hands and knees, ensuring your wrists are directly under your shoulders and your knees are under your hips.",
      "Step your feet back one at a time, straightening your legs and coming into a high push-up position. Align your wrists directly beneath your shoulders and spread your fingers wide for stability.",
      "Engage your core by drawing your navel toward your spine, and activate your glutes to prevent your hips from sagging or lifting too high.",
      "Press firmly into the floor through your palms, distributing weight evenly across your hands, and activate your arm muscles to stabilize your shoulders.",
      "Keep your neck in a neutral position by gazing down slightly ahead of your hands. Avoid craning your neck upward or letting your head drop toward the mat.",
      "Hold the pose for 5 to 10 deep breaths, maintaining steady engagement in your core, arms, legs, and glutes."
    ]
  },
  {
    "id": 4,
    "name": "",
    "cues": [
      
    ]
  },
  {
    "id": 5,
    "name": "Upward-Facing Dog",
    "cues": [
      "Start in a high plank position with your wrists directly under your shoulders, legs extended, and your body forming a straight line from head to heels.",
      "Inhale and, as you press your palms firmly into the floor, lower your hips slightly while straightening your arms, lifting your chest off the ground. Engage your core to support your spine.",
      "Roll your shoulders back and down, opening your chest. Keep your shoulder blades pulling down your back, avoiding any tension in the neck or shoulders.",
      "Press the tops of your feet into the floor while keeping your thighs lifted off the ground and your legs actively engaged. Ensure your hips don't sag toward the floor.",
      "Look slightly upward, keeping your neck long and in alignment with your spine. Your gaze should be relaxed and focused forward or slightly upward without straining your neck.",
      "Hold the pose for 5 to 10 breaths, focus on lifting through your chest and lengthening through your spine while keeping the body active and stable."
    ]
  },
  {
    "id": 6,
    "name": "Child's Pose",
    "cues": [
      "Start by kneeling on the mat with your big toes touching and knees spread wide apart, allowing room for your torso to fold.",
      "Sit back onto your heels, ensuring your hips are comfortably aligned with your knees. Reach your arms forward on the mat, lengthening your spine and feeling a gentle stretch through your back.",
      "Slowly lower your forehead toward the floor, keeping your neck relaxed and aligned with your spine. If necessary, place a cushion or block under your forehead for support.",
      "Breathe deeply through your nose, allowing your body to soften with each exhale, releasing any tension in your back, shoulders, and hips. Let the weight of your body gently sink into the floor as you relax further into the pose.",
      "Stay here for several breaths, allowing your body to rest and rejuvenate. If desired, gently rock your body side to side to deepen the stretch and release any remaining tension."
    ]
  },
  {
    "id": 7,
    "name": "Warrior I",
    "cues": [
      "Begin in Mountain Pose (Tadasana), with your feet hip-width apart.",
      "Step one foot to the back of the mat, ensuring the back foot is angled slightly outwards, about 45 degrees.",
      "Bend your front knee, keeping the knee aligned directly above the ankle, and avoid letting it extend beyond your toes.",
      "Keep your back leg straight and strong, pressing down through the back heel to maintain balance and stability.",
      "Square your hips and shoulders to the front of the mat, making sure your torso is facing forward while keeping a slight lift in the chest.",
      "Extend your arms overhead, keeping them parallel to each other with palms facing inward, and reach through the fingertips while avoiding tension in the shoulders.",
      "Press firmly into your front foot and root down through the back heel to maintain balance and groundedness.",
      "Breathe deeply, maintaining steady inhales and exhales, and hold the position for 5 to 10 breaths before switching sides."
    ]
  },
  {
    "id": 8,
    "name": "Warrior II",
    "cues": [
      "Start in Warrior I (Virabhadrasana I) with your front knee bent and your back leg straight.",
      "Open your hips and shoulders to face the side, aligning your body with the long edge of the mat.",
      "Extend both arms out to shoulder height, parallel to the floor, with your palms facing down.",
      "Bend your front knee deeply to a 90-degree angle, ensuring that your knee is directly over your ankle, not extending beyond it.",
      "Firmly press the outer edge of your back foot into the mat, keeping your back leg straight and strong. Activate the muscles in your back leg to support the alignment of your hips.",
      "Engage your core by gently pulling your navel toward your spine, lifting through your chest, and avoid arching your lower back.",
      "Breathe deeply, maintaining steady inhales and exhales, and hold the position for 5 to 10 breaths before switching sides."
    ]
  },
  {
    "id": 9,
    "name": "Warrior III",
    "cues": [
      "Start from Warrior I and shift your weight onto your front foot.",
      "Begin to lift your back leg off the floor, keeping it straight and strong, while bringing your torso forward.",
      "Reach your arms forward, creating a straight line from your fingertips to your lifted heel.",
      "Engage your core to keep your hips square and your torso aligned with your lifted leg.",
      "Focus on balance, breathing deeply, and holding the pose with control for several breaths."
    ]
  },
  {
    "id": 10,
    "name": "Extended Side Angle",
    "cues": [
      "From Warrior II, reach your front arm forward, then lower it to the floor or a block beside your front foot.",
      "Extend your top arm overhead, creating a straight line from your back heel to your fingertips.",
      "Ensure that your front knee is bent at 90 degrees and your back leg is straight and strong.",
      "Open your chest toward the ceiling, keeping your torso long and your gaze upward or forward.",
      "Breathe deeply, maintaining length in the spine and opening through the side body."
    ]
  },
  {
    "id": 11,
    "name": "Reverse Warrior",
    "cues": [
      "From Warrior II, flip your front palm to face up and reach your arm overhead.",
      "Lean back, bringing your front arm along your ear, and keeping your back leg strong and straight.",
      "Maintain a deep bend in your front knee, but avoid overextending your lower back.",
      "Reach through the fingers and create a stretch along the entire side body.",
      "Keep your chest open and breathe deeply as you feel the stretch in the hips, legs, and arms."
    ]
  },
  {
    "id": 12,
    "name": "Triangle Pose",
    "cues": [
      "Start with your feet wide apart, and angle your feet so that your front foot faces forward and your back foot is at a 45-degree angle.",
      "Reach your arms wide, then tilt your torso over your front leg, keeping your spine long.",
      "Place your hand on your shin, ankle, or a block, and extend your top arm toward the ceiling, creating a straight line with your arms.",
      "Engage your legs and core, ensuring that both legs are straight and strong.",
      "Look up toward your top hand, or gaze forward if that feels more comfortable, and breathe deeply."
    ]
  },
  {
    "id": 13,
    "name": "Half Moon Pose",
    "cues": [
      "From Warrior II, shift your weight onto your front leg, then lift your back leg parallel to the floor.",
      "Place your hand on the floor or a block beneath your shoulder, and extend your top arm toward the ceiling.",
      "Engage your core to keep your torso open and your body in a straight line.",
      "Keep your back leg straight and active, reaching your foot towards the ceiling.",
      "Focus on balance and lengthening your spine, holding the pose with control and steady breath."
    ]
  },
  {
    "id": 14,
    "name": "Chair Pose",
    "cues": [
      "Stand with your feet together or hip-width apart and bend your knees deeply as if sitting into a chair.",
      "Keep your weight in your heels, and ensure that your knees are behind your toes.",
      "Reach your arms straight up overhead, keeping them engaged and shoulders relaxed.",
      "Tuck your tailbone slightly and engage your core to support your lower back.",
      "Hold the pose, keeping your chest lifted and breathing deeply, sinking deeper into the chair with each exhale."
    ]
  },
  {
    "id": 15,
    "name": "Goddess Pose",
    "cues": [
      "Start by stepping your feet wide apart, with your toes turned out at a 45-degree angle.",
      "Bend your knees deeply, keeping them aligned over your toes, and lower your hips down towards the floor.",
      "Reach your arms out to the sides at shoulder height, palms facing down, and bend your elbows to 90 degrees.",
      "Engage your core and maintain a strong, steady breath as you hold the pose.",
      "Press into your feet and focus on the strength and energy flowing through your legs and arms."
    ]
  },
  {
    "id": 16,
    "name": "High Lunge",
    "cues": [
      "Start in a standing position and step one foot back, bending your front knee to 90 degrees while keeping your back leg straight.",
      "Lift your arms overhead, keeping your shoulders relaxed and chest open.",
      "Press into your front foot and lift your back leg, ensuring your hips stay square to the front.",
      "Engage your core and lengthen your spine as you settle deeper into the lunge.",
      "Breathe deeply, maintaining balance and stability through the hips and legs."
    ]
  },
  {
    "id": 17,
    "name": "Low Lunge",
    "cues": [
      "Start in a standing position, step one foot back, and bend your front knee to 90 degrees.",
      "Lower your back knee to the floor, keeping your hips square and shoulders relaxed.",
      "Reach your arms overhead, palms facing each other, and engage your core for stability.",
      "Press into your front foot and gently press your hips forward to deepen the stretch in the hip flexors.",
      "Breathe deeply, and hold the pose, keeping your chest lifted and your gaze forward."
    ]
  },
  {
    "id": 18,
    "name": "Pyramid Pose",
    "cues": [
      "Start by standing with your feet wide apart, turning one foot out and keeping the other foot slightly turned in.",
      "Square your hips towards your front foot and begin to hinge from your hips, reaching your torso forward.",
      "Place your hands on your front shin, ankle, or a block, and extend your spine long.",
      "Keep your back leg straight and strong, with your hips grounded and shoulders relaxed.",
      "Hold the pose and focus on lengthening the spine and stretching the hamstrings while breathing deeply."
    ]
  },
  {
    "id": 19,
    "name": "Wide-Legged Forward Fold",
    "cues": [
      "Start with your feet wide apart, with your toes turned in slightly and your heels facing out.",
      "Hinge from your hips, keeping your spine long, and fold forward towards the floor.",
      "Place your hands on the floor or grab your ankles, and relax your neck, letting your head hang heavy.",
      "Press your feet into the floor, keeping your legs straight but not locked, and engage your thighs.",
      "Breathe deeply and hold the pose, allowing your upper body to release tension with each exhale."
    ]
  },
  {
    "id": 20,
    "name": "Standing Split",
    "cues": [
      "Start from a standing position, then shift your weight onto one foot.",
      "Lift your other leg straight up behind you, keeping your hips square and your spine long.",
      "Place your hands on the floor or on a block for support, and focus on engaging your standing leg.",
      "Lengthen your spine and keep your gaze down or forward, balancing on your standing leg.",
      "Hold the pose, breathing deeply, and keep your lifted leg as straight as possible."
    ]
  },
  {
    "id": 21,
    "name": "Tree Pose",
    "cues": [
      "Start by standing tall with your feet together, grounding down through your standing leg.",
      "Shift your weight onto one leg, and bring the sole of your opposite foot to the inner thigh or calf (avoiding the knee).",
      "Press your foot into your leg, and engage your standing leg to create stability.",
      "Bring your hands together in front of your heart, or extend your arms overhead, palms facing each other.",
      "Focus on a point in front of you to maintain balance, and breathe deeply to steady yourself."
    ]
  },
  {
    "id": 22,
    "name": "Dancer's Pose",
    "cues": [
      "Start by standing tall with your feet together, and shift your weight onto one leg.",
      "Reach back with one hand to grab the inside of your opposite foot or ankle.",
      "Lift your back leg behind you while extending your opposite arm forward, keeping your chest lifted.",
      "Engage your core to keep your torso upright and avoid arching your lower back.",
      "Focus on finding balance and holding the pose while keeping a deep, steady breath."
    ]
  },
  {
    "id": 23,
    "name": "Eagle Pose",
    "cues": [
      "Start by standing tall with your feet together.",
      "Cross your right leg over your left leg and bend both knees slightly, as if sitting into a chair.",
      "Wrap your left arm under your right arm, bringing your palms to touch, or holding opposite shoulders.",
      "Engage your core to keep your torso upright and focus on balance.",
      "Hold the pose, breathing deeply, and maintain focus on lengthening your spine and deepening your twist."
    ]
  },
  {
    "id": 24,
    "name": "Crow Pose",
    "cues": [
      "Start in a squatting position with your feet hip-width apart and your hands placed firmly on the floor.",
      "Bend your elbows slightly and bring your knees to the backs of your upper arms.",
      "Shift your weight forward, lifting your feet off the ground and balancing on your hands.",
      "Engage your core to maintain control and keep your gaze forward or slightly down.",
      "Focus on keeping your arms strong and your body aligned as you breathe deeply in the pose."
    ]
  },
  {
    "id": 25,
    "name": "Side Crow",
    "cues": [
      "Start in a squatting position, with your feet hip-width apart and your knees bent.",
      "Place one hand on the floor and bring the other hand under your knee or thigh.",
      "Engage your core and slowly lift your legs off the floor, rotating your body to the side.",
      "Balance on your hands, keeping your gaze focused and body engaged.",
      "Hold the pose, breathing deeply, and maintain a strong and steady core throughout."
    ]
  },
  { 
    "id": 26,
    "name": "Garland Pose",
    "cues": [
      "Start in a standing position with your feet hip-width apart, then squat down, bringing your hips low while keeping your feet flat on the ground.",
      "Spread your knees wide, keeping them aligned with your toes, and bring your palms together in front of your chest in a prayer position.",
      "Use your elbows to gently press against the inside of your knees, opening the hips further.",
      "Engage your core and lengthen your spine, keeping your chest lifted and your back straight.",
      "Breathe deeply, maintaining balance and focusing on grounding through your feet and legs."
    ]
  },
  {
    "id": 27,
    "name": "Forearm Stand",
    "cues": [
      "Start on your forearms, with your elbows directly under your shoulders and your hands clasped together.",
      "Tuck your toes and lift your hips, keeping your legs straight and your core engaged.",
      "Slowly begin to walk your feet closer to your elbows, then lift your legs overhead one at a time.",
      "Press into your forearms and maintain a straight body line, engaging your core for balance.",
      "Hold the pose, breathing deeply, and focus on keeping your body aligned and steady."
    ]
  },
  {
    "id": 28,
    "name": "Handstand",
    "cues": [
      "Start in a standing position, then place your hands on the floor about shoulder-width apart.",
      "Kick up with one leg, using momentum to lift both legs toward the ceiling.",
      "Engage your core and legs to keep your body straight and aligned.",
      "Press actively into your hands, keeping your arms strong and your gaze focused slightly between your hands.",
      "Hold the pose, breathing deeply, and focus on maintaining balance and stability."
    ]
  },
  {
    "id": 29,
    "name": "Shoulder Stand",
    "cues": [
      "Begin by lying on your back with your legs extended and arms by your sides.",
      "Press your arms into the floor and lift your legs and hips toward the ceiling.",
      "Support your lower back with your hands, keeping your elbows shoulder-width apart.",
      "Keep your neck relaxed, but avoid any pressure on the neck by engaging your core and legs.",
      "Hold the pose, breathing deeply, and maintain a straight body line from your shoulders to your feet."
    ]
  },
  {
    "id": 30,
    "name": "Fish Pose",
    "cues": [
      "Begin seated on the floor with your legs extended in front of you.",
      "Lift your chest and gently arch your back, placing your forearms on the floor and leaning back.",
      "Press your elbows into the ground, lifting your chest higher, and slowly drop the crown of your head to the floor.",
      "Keep your legs active and your feet flexed, with your arms relaxed by your sides or extended overhead.",
      "Hold the pose, breathing deeply, and feel the stretch across your chest and throat."
    ]
  },
  {
    "id": 31,
    "name": "Camel Pose",
    "cues": [
      "Begin by kneeling on the floor with your knees hip-width apart.",
      "Place your hands on your lower back for support, and gently arch your spine as you lean back.",
      "Reach for your heels with your hands, if possible, while lifting your chest toward the ceiling.",
      "Press your hips forward and engage your core to protect your lower back.",
      "Hold the pose, breathing deeply, and focus on the expansion of your chest and the stretch along the front of your body."
    ]
  },
  {
    "id": 32,
    "name": "Bridge Pose",
    "cues": [
      "Lie on your back with your knees bent and feet flat on the floor, hip-width apart.",
      "Press into your feet and lift your hips towards the ceiling, keeping your shoulders and head on the ground.",
      "Interlace your hands under your back and press your arms into the floor for additional lift.",
      "Engage your core, squeeze your glutes, and press your feet down to help elevate your hips.",
      "Hold the pose, breathing deeply, and maintain the lift while keeping your neck relaxed."
    ]
  },
  {
    "id": 33,
    "name": "Wheel Pose",
    "cues": [
      "Lie on your back with your knees bent and feet flat on the floor, hip-width apart.",
      "Place your hands behind your head, fingers pointing toward your shoulders, and press into your hands and feet.",
      "Lift your hips, then press your hands into the floor to push your chest upward into the backbend.",
      "Keep your legs and arms engaged, with your gaze either forward or slightly up.",
      "Hold the pose, breathing deeply, and focus on expanding your chest and maintaining an open heart."
    ]
  },
  {
    "id": 34,
    "name": "Reclining Bound Angle",
    "cues": [
      "Lie on your back and bring the soles of your feet together, letting your knees fall open to the sides.",
      "Place your arms by your sides or on your belly, keeping your chest open and shoulders relaxed.",
      "Focus on relaxing your hips, breathing deeply, and allowing your body to sink into the ground.",
      "Feel the stretch in your inner thighs and groin, while keeping your spine neutral and supported.",
      "Hold the pose, breathing deeply, and focus on releasing tension in your lower body."
    ]
  },
  {
    "id": 35,
    "name": "Legs Up the Wall",
    "cues": [
      "Sit with one hip next to a wall, then gently lie down on your back and swing your legs up the wall.",
      "Keep your hips close to the wall and your legs extended straight up.",
      "Place your arms at your sides or rest them on your belly, and focus on relaxing your body and mind.",
      "Breathe deeply, allowing your legs to feel supported by the wall, and let any tension release from your lower back.",
      "Hold the pose for several minutes, allowing the restorative effects to calm your nervous system."
    ]
  },
  {
    "id": 36,
    "name": "Boat Pose",
    "cues": [
      "Start seated with your knees bent and feet flat on the floor.",
      "Lean back slightly, then lift your legs into a V-shape, keeping your knees bent or straight.",
      "Extend your arms forward parallel to the floor, keeping your back straight and core engaged.",
      "Hold the pose, focusing on engaging your abdominal muscles and maintaining balance.",
      "Breathe deeply and try to lift your chest higher, deepening the stretch in your core."
    ]
  },
  {
    "id": 37,
    "name": "Seated Forward Fold",
    "cues": [
      "Sit with your legs extended straight in front of you and your feet flexed.",
      "Inhale and lengthen your spine, and as you exhale, hinge from your hips to fold forward.",
      "Keep your back straight, reaching for your feet, ankles, or shins, and relax your neck.",
      "Engage your thighs to protect your knees and focus on lengthening your spine rather than forcing the fold.",
      "Breathe deeply and hold the pose, allowing the stretch to deepen as you relax into the pose."
    ]
  },
  {
    "id": 38,
    "name": "Bound Angle",
    "cues": [
      "Sit with your feet together and your knees bent, bringing your heels toward your pelvis.",
      "Hold onto your feet with your hands, and gently press your knees toward the floor.",
      "Lengthen your spine and sit tall, keeping your chest open and your shoulders relaxed.",
      "Focus on the stretch in your inner thighs and hips, breathing deeply and maintaining a comfortable position.",
      "Hold the pose, letting your knees relax toward the floor with each exhale."
    ]
  },
  {
    "id": 39,
    "name": "Happy Baby Pose",
    "cues": [
      "Lie on your back and bring your knees toward your chest.",
      "Grab the outsides of your feet with your hands and gently open your knees wider than your torso.",
      "Press your feet into your hands while pulling your hands into your feet, creating a gentle resistance.",
      "Relax your shoulders and neck, and focus on breathing deeply, allowing the stretch to deepen in your hips.",
      "Hold the pose, relaxing into the stretch with each exhale."
    ]
  },
  {
    "id": 40,
    "name": "Corpse Pose",
    "cues": [
      "Lie flat on your back with your legs extended and arms by your sides, palms facing up.",
      "Close your eyes and focus on relaxing each part of your body from your feet up to your head.",
      "Let your breathing become slow and deep, and allow your body to surrender completely to the floor.",
      "Release any tension in your body and let go of all thoughts, focusing purely on your breath.",
      "Hold the pose for several minutes, allowing your body to fully relax and integrate your practice."
    ]
  },
  {
    "id": 41,
    "name": "Cobra Pose",
    "cues": [
      "Lie on your stomach with your hands under your shoulders and elbows close to your body.",
      "Press your pubic bone into the floor and engage your legs, lifting your chest off the ground.",
      "Inhale as you lift your upper body, extending your arms, but keep your elbows slightly bent.",
      "Open your chest and broaden your collarbones, and avoid over-arching your back by engaging your lower body.",
      "Hold the pose, breathing deeply, and lengthen your spine with each inhale."
    ]
  },
  {
    "id": 42,
    "name": "Locust Pose",
    "cues": [
      "Lie on your stomach with your arms extended alongside your body, palms facing down.",
      "On an inhale, lift your chest, legs, and arms off the floor, engaging your back muscles.",
      "Keep your legs straight and together, and avoid clenching your glutes while maintaining length in your spine.",
      "Focus on lifting from the chest and legs, opening the heart while keeping the neck long.",
      "Hold the pose, breathing deeply, and engage the back of the body to maintain stability."
    ]
  },
  {
    "id": 43,
    "name": "Bow Pose",
    "cues": [
      "Lie on your stomach with your arms extended by your sides and bend your knees to bring your heels toward your hips.",
      "Reach your hands back to grasp your ankles, and on an inhale, lift your chest and legs off the floor.",
      "Press your feet into your hands and continue to lift your chest, deepening the backbend while keeping your hips grounded.",
      "Maintain an active core to support your lower back, and keep your neck neutral by looking forward or slightly up.",
      "Hold the pose, breathing deeply, and focus on lifting and expanding your heart."
    ]
  },
  {
    "id": 44,
    "name": "Puppy Pose",
    "cues": [
      "Start on your hands and knees, with your hips above your knees and your hands slightly forward.",
      "On an inhale, slowly lower your chest and chin toward the floor while keeping your hips lifted.",
      "Keep your arms extended forward, with your palms pressing down into the floor and fingers spread wide.",
      "Focus on elongating your spine, lengthening your chest, and relaxing your neck.",
      "Hold the pose, breathing deeply, and focus on the gentle stretch in your shoulders and upper back."
    ]
  },
  {
    "id": 45,
    "name": "Cat-Cow Pose",
    "cues": [
      "Begin in a tabletop position with your wrists directly under your shoulders and knees under your hips.",
      "On an inhale, drop your belly toward the floor and lift your head and tailbone toward the ceiling (Cow Pose).",
      "On an exhale, round your back, tucking your chin to your chest, and draw your belly button toward your spine (Cat Pose).",
      "Move smoothly between the two poses with your breath, maintaining a fluid motion of your spine.",
      "Focus on the connection between breath and movement, feeling each vertebrae articulate."
    ]
  },
  {
    "id": 46,
    "name": "Thread the Needle",
    "cues": [
      "Start in a tabletop position with your wrists directly under your shoulders and knees under your hips.",
      "On an inhale, lift your right arm toward the ceiling, opening your chest.",
      "On an exhale, thread your right arm underneath your left arm, bringing your right shoulder and ear to the floor.",
      "Keep your left hand pressing into the floor for support, or extend your left arm overhead for a deeper stretch.",
      "Hold the pose, breathing deeply, and allow your right shoulder and upper back to release into the stretch."
    ]
  },
  {
    "id": 47,
    "name": "Reverse Plank Pose",
    "cues": [
      "Begin seated with your legs extended straight in front of you and your hands placed behind your hips, fingers pointing toward your feet.",
      "Press firmly into your palms and lift your hips toward the ceiling, creating a straight line from your head to your heels.",
      "Engage your core to prevent your hips from sagging and keep your body aligned.",
      "Roll your shoulders back and open your chest, drawing your shoulder blades together.",
      "Press through your heels and activate your legs, keeping them straight and strong.",
      "Relax your neck and allow your head to drop back gently, or keep it in a neutral position if that feels more comfortable.",
      "Hold the pose for 3 to 5 breaths, then slowly lower your hips back to the mat with control."
    ]
  },
  {
    "id": 48,
    "name": "Pigeon Pose",
    "cues": [
      "Begin in a tabletop position, bringing your right knee forward and placing it behind your right wrist.",
      "Extend your left leg straight behind you, lowering your hips toward the floor.",
      "Ensure your back leg is extended straight and the top of your foot is facing down.",
      "Fold forward over your bent leg, keeping your spine long and chest open.",
      "Hold the pose, breathing deeply, and focus on releasing tension in your hips."
    ]
  },
  {
    "id": 49,
    "name": "Plow Pose",
    "cues": [
      "Begin lying on your back with your arms at your sides, palms facing down.",
      "On an inhale, lift your legs up toward the ceiling, keeping them straight, and engage your core.",
      "Exhale and slowly lower your legs over your head, bringing your toes toward the floor behind you.",
      "Support your lower back with your hands if needed, or keep your arms flat on the ground for additional stability.",
      "Relax your neck and shoulders, ensuring there’s no strain or discomfort in the cervical spine.",
      "Keep your legs active and straight, and your hips aligned over your shoulders.",
      "Breathe deeply and hold the pose for 5 to 10 breaths, then gently roll down vertebra by vertebra to return to the starting position."
    ]
  },
  {
    "id": 50,
    "name": "Supine Twist",
    "cues": [
      "Lie on your back and draw your knees toward your chest.",
      "Extend your arms out to the sides, and on an exhale, drop your knees to one side, keeping your shoulders grounded.",
      "Turn your head in the opposite direction to deepen the twist and stretch your spine.",
      "Keep your legs stacked and your knees bent, allowing your spine to gently twist.",
      "Hold the pose, breathing deeply, and feel the release in your back and shoulders."
    ]
  },
  {
    "id": 51,
    "name": "Half Lord of the Fishes",
    "cues": [
      "Sit with your legs extended in front of you, then bend your right knee and cross it over your left leg.",
      "Place your right foot flat on the floor next to your left knee, and inhale to lengthen your spine.",
      "On an exhale, twist your torso to the right, using your left elbow to press against your right knee.",
      "Keep your hips grounded and shoulders relaxed, deepening the twist with each exhale.",
      "Hold the pose, breathing deeply, and focus on the stretch through your spine and chest."
    ]
  },
  {
    "id": 52,
    "name": "Side Plank",
    "cues": [
      "Begin in a plank position, then shift your weight onto your left hand and the edge of your left foot.",
      "Stack your right foot on top of your left, or place it in front of your left foot for stability.",
      "Lift your right arm toward the ceiling and engage your core and legs to maintain balance.",
      "Keep your body in a straight line from head to heels, avoiding sagging in the hips.",
      "Hold the pose, breathing deeply, and feel the engagement in your core and shoulders."
    ]
  },
  {
    "id": 53,
    "name": "Wild Thing",
    "cues": [
      "Begin in Downward-Facing Dog, then shift your weight forward into a backbend position.",
      "Lift your right leg, bending your knee, and open your chest as you rotate your body to face the ceiling.",
      "Place your right foot on the floor behind you, and reach your left arm overhead, creating a heart-opening shape.",
      "Engage your core and glutes to maintain balance, and avoid over-arching your back.",
      "Hold the pose, breathing deeply, and feel the openness in your chest and shoulders."
    ]
  },
  {
    "id": 54,
    "name": "Tiger Pose",
    "cues": [
      "Start in a tabletop position, then extend your right arm forward and left leg back.",
      "On an inhale, bend your left knee and bring your heel toward your glutes while reaching for your foot with your left hand.",
      "Draw your knee and elbow toward each other, rounding your spine slightly.",
      "On an exhale, extend your arm and leg back out, keeping your spine long.",
      "Repeat the movement with breath, focusing on lengthening and contracting with each inhale and exhale."
    ]
  },
  {
    "id": 55,
    "name": "Gate Pose",
    "cues": [
      "Start seated with your legs extended wide apart.",
      "Turn your right foot to point toward the front of the mat and bend your right knee, keeping your left leg extended.",
      "Inhale and reach your left arm toward the left foot, and on an exhale, extend your torso over your left leg.",
      "Keep your chest open and your right leg active, avoiding any rounding in your back.",
      "Hold the pose, breathing deeply, and feel the stretch along the side of your body."
    ]
  },
  {
    "id": 56,
    "name": "Frog Pose",
    "cues": [
      "Start in a tabletop position and widen your knees as far as is comfortable, keeping your feet pointing outwards.",
      "Lower your hips toward the floor, keeping your shoulders stacked over your wrists.",
      "Engage your inner thighs and press your hips down, opening your hips and groin.",
      "Keep your spine neutral and avoid collapsing your chest.",
      "Hold the pose, breathing deeply, and focus on relaxing your hips and groin."
    ]
  },
  {
    "id": 57,
    "name": "Lizard Pose",
    "cues": [
      "Begin in a tabletop position, then step your right foot forward between your hands.",
      "Lower your hips toward the floor, and place your elbows on the floor for a deeper stretch in your hips.",
      "Keep your back leg extended and your back foot active, pressing the top of your foot into the floor.",
      "Hold the pose, breathing deeply, and focus on relaxing your hips while maintaining stability."
    ]
  },
  {
    "id": 58,
    "name": "Fallen Triangle",
    "cues": [
      "Start in a Downward-Facing Dog position.",
      "Lift your right leg and rotate your torso to face the floor, bringing your right foot towards the ground in a modified triangle shape.",
      "Extend your left arm toward the ceiling, opening your chest while keeping your body in a straight line.",
      "Hold the pose, breathing deeply, and maintain openness in your chest and shoulders."
    ]
  },
  {
    "id": 59,
    "name": "Bird of Paradise",
    "cues": [
      "Start in a standing position and bring your right knee toward your chest.",
      "Place your left hand on the floor or a block, and extend your right leg out to the side.",
      "On an inhale, begin to straighten your right leg while reaching your right arm forward and up, keeping your chest open.",
      "Balance in the pose, breathing deeply, and focus on engaging your core and leg muscles."
    ]
  },
  {
    "id": 60,
    "name": "Extended Hand-to-Big-Toe Pose",
    "cues": [
      "Start standing with your legs extended and feet hip-width apart.",
      "Shift your weight onto your left leg, and extend your right leg forward, holding your right big toe with your right hand.",
      "Lengthen your spine and keep your left knee straight, lifting your chest as you hinge forward from the hips.",
      "Focus on keeping your right leg straight and your body in alignment.",
      "Hold the pose, breathing deeply, and feel the stretch in your hamstring and calf."
    ]
  },
  {
    "id": 61,
    "name": "Standing Forward Fold",
    "cues": [
      "Stand with your feet hip-width apart and hinge at your hips to fold forward.",
      "Keep a slight bend in your knees to protect your lower back, and let your head hang heavy.",
      "You can hold onto opposite elbows or let your hands rest on the floor or blocks.",
      "Focus on lengthening your spine, reaching the crown of your head toward the floor.",
      "Breathe deeply, allowing your upper body to release toward your legs with each exhale."
    ]
  },
  {
    "id": 62,
    "name": "Halfway Lift",
    "cues": [
      "From a forward fold, inhale and lift your torso halfway up, keeping your spine long.",
      "Place your hands on your shins or thighs (avoiding the knees) and keep your back flat.",
      "Lengthen your neck and draw your shoulder blades down your back.",
      "Engage your core and legs to maintain balance, and keep your gaze forward.",
      "Hold the pose for a breath or two, then fold forward again."
    ]
  },
  {
    "id": 63,
    "name": "Ragdoll Pose",
    "cues": [
      "From a standing position, bend your knees and fold forward, letting your torso hang toward your thighs.",
      "Hold onto opposite elbows and allow your body to sway gently from side to side.",
      "Relax your neck, letting your head hang heavy, and soften your face.",
      "Breathe deeply and allow your spine to release, creating space in your back and neck."
    ]
  },
  {
    "id": 64,
    "name": "Eight-Angle Pose",
    "cues": [
      "Start seated with your legs extended and bend your knees, placing your feet flat on the floor.",
      "Place your hands on the floor behind you, fingers pointing back, and engage your core.",
      "Twist your torso to the right and place your left arm around your right shin.",
      "Lift your feet off the ground and extend your legs out to the side, balancing on your hands.",
      "Focus on engaging your core to maintain balance, and keep your spine long."
    ]
  },
  {
    "id": 65,
    "name": "Bound Side Angle",
    "cues": [
      "From Warrior II, bring your left hand behind your back and bind it around your right thigh or wrist.",
      "Bend your right knee and lower your body into the side angle, with your left leg straight and grounded.",
      "Open your chest, keeping your heart lifted, and gaze upward or forward.",
      "Use the bind to deepen the stretch in your chest and shoulders, and engage your core for stability.",
      "Hold the pose, breathing deeply, and maintain length in your spine."
    ]
  },
  {
    "id": 66,
    "name": "Bound Forward Fold",
    "cues": [
      "Start in a standing position with your feet hip-width apart.",
      "Bend your knees and fold forward, reaching your hands behind your back and clasping your hands together.",
      "If possible, press your palms together and let your arms extend overhead or toward the floor.",
      "Keep your legs engaged, and let your torso release toward your legs.",
      "Hold the pose, breathing deeply, and feel the stretch in your shoulders and hamstrings."
    ]
  },
  {
    "id": 67,
    "name": "Half Splits",
    "cues": [
      "Begin in a kneeling position and step your right foot forward, keeping your left knee on the ground.",
      "Extend your right leg straight, flexing your right foot and lengthening your spine.",
      "Fold forward over your right leg, keeping your back straight and your chest open.",
      "Engage your core and keep your hips squared as you deepen the stretch in your hamstrings.",
      "Hold the pose, breathing deeply, and focus on lengthening your spine."
    ]
  },
  {
    "id": 68,
    "name": "Full Splits",
    "cues": [
      "Start in a lunge position with your right leg forward and left leg extended behind you.",
      "Gradually slide your right foot forward and your left foot back, lowering your hips toward the floor.",
      "Keep your hips square and your torso lifted, maintaining a long spine.",
      "Engage your core to protect your lower back, and keep your back leg active.",
      "Hold the pose, breathing deeply, and focus on relaxing your hips and legs."
    ]
  },
  {
    "id": 69,
    "name": "King Pigeon Pose",
    "cues": [
      "Begin in Pigeon Pose, with your right leg bent in front of you and your left leg extended behind you.",
      "Bend your left knee and bring your left foot toward your glutes, holding your left ankle with your left hand.",
      "Open your chest and keep your spine long as you reach your right arm overhead.",
      "If comfortable, bring your right hand to your left foot and extend the stretch in your chest and shoulders.",
      "Hold the pose, breathing deeply, and focus on releasing tension in your hips and upper body."
    ]
  },
  {
    "id": 70,
    "name": "Lotus Pose",
    "cues": [
      "Sit on the floor with your legs extended in front of you.",
      "Bend your knees and place each foot on the opposite thigh, bringing your feet as close to your hips as possible.",
      "Sit tall, lengthening your spine and keeping your chest open.",
      "Relax your hands on your knees, palms facing up, and focus on steadying your breath.",
      "Hold the pose, breathing deeply, and focus on cultivating stillness and inner peace."
    ]
  },
  {
    "id": 71,
    "name": "Elevated Lotus Pose",
    "cues": [
      "Begin in Lotus Pose, with each foot placed on the opposite thigh.",
      "Place your hands firmly on the floor beside your hips, fingers pointing forward.",
      "Engage your core and press firmly into your palms as you lift your body off the ground.",
      "Keep your shoulders down and away from your ears while maintaining a steady breath.",
      "Hold the pose, focusing on balance and strength, and gently lower yourself back down when ready."
    ]
  },
  {
    "id": 72,
    "name": "Cow Face Pose",
    "cues": [
      "Sit with your legs extended in front of you, then bend your knees and stack your right knee on top of your left.",
      "Bring your feet as close to your hips as possible, keeping your knees stacked.",
      "Extend your right arm overhead and bend your elbow, reaching your right hand down your back.",
      "Bring your left arm behind you to clasp your right hand or use a strap between your hands.",
      "Hold the pose, breathing deeply, and feel the stretch in your shoulders, hips, and thighs."
    ]
  },
  {
    "id": 73,
    "name": "Seated Spinal Twist",
    "cues": [
      "Sit with your legs extended in front of you, then bend your right knee and place your right foot outside your left thigh.",
      "Place your left elbow outside your right knee and twist your torso to the right.",
      "Inhale to lengthen your spine, and exhale to deepen the twist.",
      "Keep your chest open and avoid collapsing your shoulders.",
      "Hold the pose, breathing deeply, and focus on releasing tension in your spine."
    ]
  },
  {
    "id": 74,
    "name": "Hero Pose",
    "cues": [
      "Sit with your knees bent and feet together, with your thighs parallel and your shins resting on the floor.",
      "If necessary, sit on a block or cushion to elevate your hips.",
      "Sit tall, lengthening your spine and relaxing your shoulders down your back.",
      "Focus on grounding your legs and maintaining a straight posture.",
      "Hold the pose, breathing deeply, and feel a stretch in your thighs and hips."
    ]
  },
  {
    "id": 75,
    "name": "Revolved Triangle",
    "cues": [
      "Start in a standing position, and step your feet wide apart.",
      "Turn your right foot forward and your left foot slightly in, keeping your legs straight.",
      "Reach your right hand to the floor or a block, and extend your left arm toward the ceiling.",
      "Twist your torso toward your right leg, keeping your hips square and your spine long.",
      "Hold the pose, breathing deeply, and focus on lengthening your spine with each inhale."
    ]
  },
  {
    "id": 76,
    "name": "Revolved Side Angle",
    "cues": [
      "From Warrior II, bring your left hand to your right thigh and place your right arm overhead.",
      "As you twist your torso to the right, keep your legs strong and your hips squared.",
      "Open your chest to face the ceiling and extend through the fingertips.",
      "Engage your core and maintain a steady, deep breath as you hold the twist.",
      "Focus on lengthening your spine and deepening the twist with each exhale."
    ]
  },
  {
    "id": 77,
    "name": "Shoulder Pressing Pose",
    "cues": [
      "Start in a seated position, with your legs extended in front of you.",
      "Bend your knees and place your feet flat on the floor.",
      "Place your palms on the floor behind you, with your fingers pointing forward.",
      "Press your hands into the floor and lift your hips toward the ceiling, engaging your core and legs.",
      "Hold the pose, breathing deeply, and focus on engaging your shoulder muscles."
    ]
  },
  {
    "id": 78,
    "name": "Flying Pigeon Pose",
    "cues": [
      "Start in a standing position and bring your right knee toward your chest.",
      "Place your right ankle on your left upper arm and extend your left leg behind you.",
      "Hinge at your hips to fold forward and extend your arms forward.",
      "Balance on your arms, keeping your core engaged and your gaze steady.",
      "Hold the pose, breathing deeply, and focus on maintaining stability and control."
    ]
  },
  {
    "id": 79,
    "name": "Firefly Pose",
    "cues": [
      "Start in a seated position with your legs extended in front of you.",
      "Bend your knees and bring your feet to the floor, keeping your feet wide apart.",
      "Place your hands behind your legs, gripping the backs of your thighs or calves.",
      "Straighten your legs and lift them off the floor, balancing on your hands.",
      "Hold the pose, breathing deeply, and engage your core to maintain balance."
    ]
  },
  {
    "id": 80,
    "name": "Monkey Pose",
    "cues": [
      "Begin in a seated position with one leg extended forward and the other leg bent with your foot near your hip.",
      "Straighten the extended leg and fold forward, reaching toward the toes.",
      "Engage your core to keep your spine long as you deepen the stretch in your hamstrings.",
      "Relax your neck and jaw, and breathe deeply as you hold the stretch."
    ]
  },
  {
    "id": 81,
    "name": "Ganda Bherundasana",
    "cues": [
      "Start in a kneeling position, then place your hands on the floor in front of you.",
      "Lift your hips and bring your feet over your head, coming into a chin stand.",
      "Press firmly through your forearms and chin to balance, keeping your legs straight and active.",
      "Engage your core to support your body, and keep your gaze steady.",
      "Breathe deeply, focusing on maintaining stability as you hold the pose."
    ]
  },
  {
    "id": 82,
    "name": "Scorpion Pose",
    "cues": [
      "Start in a forearm stand or a supported handstand position.",
      "Bend your knees and bring your feet toward your head, creating a scorpion shape with your body.",
      "Extend your legs as much as your flexibility allows, keeping your core engaged for stability.",
      "Press firmly into the forearms and maintain a long spine, focusing on balance.",
      "Hold the pose, breathing steadily and maintaining control."
    ]
  },
  {
    "id": 83,
    "name": "Half Moon Bound Pose",
    "cues": [
      "Start in a standing position with your feet hip-width apart.",
      "Bend forward into a half moon pose, reaching one arm toward the floor while the other arm binds behind your back.",
      "Twist your torso to open your chest, and engage your core to maintain balance.",
      "Keep your legs active and your spine long as you deepen the stretch.",
      "Hold the pose, breathing deeply, and focus on maintaining length through your torso."
    ]
  },
  {
    "id": 84,
    "name": "Hummingbird Pose",
    "cues": [
      "Start in a seated position with your legs extended in front of you.",
      "Bend your knees and place your feet on the floor.",
      "Place your hands behind your thighs and lean forward slightly.",
      "Lift your feet off the ground, balancing on your hands while keeping your core engaged.",
      "Focus on maintaining balance, and hold the pose with steady breaths."
    ]
  },
  {
    "id": 85,
    "name": "Peacock Pose",
    "cues": [
      "Begin by kneeling and placing your hands on the floor in front of you.",
      "Bend your elbows and bring your knees to your upper arms, creating a balance between your arms and legs.",
      "Press down through your hands and lift your feet off the floor, bringing your legs together.",
      "Engage your core and keep your spine long as you hold the pose.",
      "Focus on steadying your breath and maintaining balance."
    ]
  },
  {
    "id": 86,
    "name": "Compass Pose",
    "cues": [
      "Start seated with your legs extended in front of you.",
      "Bend your right knee and bring your right foot toward your chest.",
      "Hold your right foot with both hands, then extend your left leg straight.",
      "Slowly rotate your torso to the right, extending your right leg to the side while keeping your spine long.",
      "Keep your gaze focused forward, breathing deeply as you hold the pose."
    ]
  },
  {
    "id": 87,
    "name": "Sleeping Vishnu",
    "cues": [
      "Lie on your back with your arms by your sides and legs extended.",
      "Bend your right knee and place your right foot on the floor next to your hip.",
      "Cross your left leg over your right, with your left foot resting on the floor.",
      "Extend your arms overhead or in a comfortable position and relax into the stretch.",
      "Breathe deeply, allowing your body to release tension as you hold the pose."
    ]
  },
  {
    "id": 88,
    "name": "Dragonfly Pose",
    "cues": [
      "Start seated with your legs wide apart, feet flexed.",
      "Slowly fold forward, reaching your arms toward the floor or your feet.",
      "Engage your legs and keep your chest open as you lengthen your spine.",
      "If possible, bring your head to the floor while maintaining a long back.",
      "Breathe deeply, focusing on lengthening your spine and deepening the stretch."
    ]
  },
  {
    "id": 89,
    "name": "Grasshopper Pose",
    "cues": [
      "Begin in a seated position and bend your knees to bring your feet off the floor.",
      "Place your hands on the floor and engage your core to lift your body into the air.",
      "Extend your legs to the side, keeping them straight and active.",
      "Focus on balancing on your hands, maintaining a steady gaze.",
      "Hold the pose, breathing steadily and maintaining control."
    ]
  },
  {
    "id": 90,
    "name": "Baby Grasshopper",
    "cues": [
      "Start in a low squat, with your knees bent and feet flat on the floor.",
      "Place your hands on the floor and press down through your palms.",
      "Lift your hips and bring your knees toward your chest, balancing on your hands.",
      "Extend your legs to the side, keeping them straight and engaged.",
      "Focus on maintaining balance and breathing deeply."
    ]
  },
  {
    "id": 91,
    "name": "Caterpillar Pose",
    "cues": [
      "Sit with your legs extended in front of you, keeping your feet flexed.",
      "Inhale to lengthen your spine, and exhale to fold forward over your legs.",
      "Keep your arms extended toward your feet, and relax your neck and face.",
      "Allow your chest to soften toward your thighs as you deepen the stretch.",
      "Breathe deeply, allowing your body to release into the pose."
    ]
  },
  {
    "id": 92,
    "name": "Revolved Chair Pose",
    "cues": [
      "Begin in Chair Pose with your feet together and your knees bent.",
      "Bring your palms together in front of your chest and twist your torso to the right.",
      "Place your left elbow outside your right knee and engage your core.",
      "Keep your chest open and your gaze forward or upward.",
      "Hold the pose, breathing deeply, and focus on deepening the twist with each exhale."
    ]
  },
  {
    "id": 93,
    "name": "Side Stretch Pose",
    "cues": [
      "Start in a standing position with your feet hip-width apart.",
      "Lift your arms overhead and interlace your fingers.",
      "Lean to the right, stretching the left side of your body.",
      "Keep your feet grounded and engage your core for stability.",
      "Hold the stretch for a few breaths, then switch sides."
    ]
  },
  {
    "id": 94,
    "name": "Hero Pose with Recline",
    "cues": [
      "Begin in Hero Pose, sitting on your shins with your knees together.",
      "Slowly lower your torso back onto the floor, supporting yourself with your hands.",
      "Keep your thighs grounded and allow your body to rest as much as you can.",
      "Relax your arms by your sides and allow your chest to open.",
      "Breathe deeply, allowing your body to soften into the pose."
    ]
  },
  {
    "id": 95,
    "name": "Intense Side Stretch",
    "cues": [
      "Start in a standing position with your feet wide apart.",
      "Extend your arms overhead and then lean to one side, reaching for your foot with your hand.",
      "Keep your torso open and lengthen your spine as you stretch.",
      "Engage your core to maintain balance and stability.",
      "Breathe deeply, holding the stretch, then repeat on the other side."
    ]
  },
  {
    "id": 96,
    "name": "Revolved Crescent Lunge",
    "cues": [
      "Start in a low lunge with your right foot forward and your left knee on the floor.",
      "Place your left hand on the floor or a block and twist your torso to the right.",
      "Extend your right arm toward the ceiling, keeping your chest open.",
      "Engage your core to maintain stability and balance.",
      "Hold the pose, breathing deeply and focusing on deepening the twist."
    ]
  },
  {
    "id": 97,
    "name": "Tortoise Pose",
    "cues": [
      "Start seated with your legs extended in front of you.",
      "Bend your knees and bring your feet toward your hips.",
      "Fold forward, placing your hands under your feet and your forehead toward the floor.",
      "Relax your head and neck, and allow your body to soften into the stretch.",
      "Breathe deeply, focusing on releasing tension in your back and shoulders."
    ]
  },
  {
    "id": 98,
    "name": "One-Legged Bridge Pose",
    "cues": [
      "Begin on your back with your knees bent and feet flat on the floor.",
      "Lift your hips toward the ceiling, keeping your feet and shoulders grounded.",
      "For a variation, lift one leg while keeping the other leg grounded.",
      "Engage your core and squeeze your glutes as you hold the pose.",
      "Breathe deeply, focusing on maintaining stability and length in your spine."
    ]
  },
  {
    "id": 99,
    "name": "Wheel Pose Variation",
    "cues": [
      "Lie on your back with your knees bent and feet flat on the floor.",
      "Place your hands by your ears, with your fingers pointing toward your shoulders.",
      "Press into your hands and feet to lift your body into a backbend.",
      "For a variation, lift one leg off the floor while keeping your hips lifted.",
      "Hold the pose, breathing deeply, and focus on maintaining an open chest."
    ]
  },
  {
    "id": 100,
    "name": "Standing Bow Pose",
    "cues": [
      "Start in a standing position with your feet together and arms by your sides.",
      "Bend one knee and grab your ankle with the same-side hand.",
      "Extend the opposite arm forward as you lean forward, balancing on one leg.",
      "Engage your core and keep your chest open, focusing on balance.",
      "Hold the pose, breathing deeply, and slowly return to standing."
    ]
  }
]