[
  {
    "id": 1,
    "name": "Mountain Pose",
    "cues": [
      "Stand tall with your feet together and arms at your sides. Ground down through your feet, feeling the connection to the earth.",
      "On an inhale, lift your chest and lengthen your spine, reaching through the crown of your head.",
      "Exhale and relax your shoulders away from your ears, keeping your arms relaxed but engaged.",
      "Inhale and firm your thighs, lifting your kneecaps without locking your knees.",
      "Exhale and engage your core, pulling your belly button toward your spine.",
      "Breathe deeply in and out through your nose, grounding yourself and cultivating focus and stability for 5 to 10 breaths."
    ]
  },
  {
    "id": 2,
    "name": "Tree Pose",
    "cues": [
      "Begin in Mountain Pose, with your feet together and grounding down through all four corners of your standing foot.",
      "Shift your weight onto one leg, engaging the muscles of the standing leg to create stability.",
      "Slowly lift your opposite foot, placing the sole of your foot on the inner thigh, calf, or ankle of your standing leg (avoiding the knee). Ensure your foot is pressing gently into your leg for support.",
      "Press the sole of your foot into your leg while also pressing your leg into your foot, creating a dynamic balance between the two.",
      "Bring your hands together in front of your heart in a prayer position (Anjali Mudra), or extend your arms overhead with your palms facing each other. Keep your shoulders relaxed and arms active.",
      "Focus your gaze on a steady point in front of you at eye level to help with balance, and maintain a calm, even breath to help center your focus.",
      "Hold the pose for 5 to 10 breaths, and to come out of the pose, slowly lower your raised leg and return to Mountain Pose with control."
    ]
  },
  {
    "id": 3,
    "name": "Cat Pose",
    "cues": [
      "Start on all fours, with your wrists directly under your shoulders and knees under your hips.",
      "Inhale deeply as you lengthen your spine and lift your tailbone toward the ceiling, creating a gentle curve in the lower back (Cow Pose).",
      "On the exhale, round your spine upward, tucking your chin toward your chest and drawing your belly button toward your spine (Cat Pose).",
      "Engage your core to deepen the curve of your spine, while keeping your shoulders away from your ears and your hands pressing firmly into the mat.",
      "Keep your neck neutral by gazing at the floor or slightly forward, avoiding excessive strain in the neck.",
      "For extra stretch, try pressing your hands into the mat more firmly as you round your back, creating more space between your shoulder blades."
    ]
  },
  {
    "id": 4,
    "name": "Cow Pose",
    "cues": [
      "Start on all fours with your wrists directly under your shoulders and your knees under your hips.",
      "Inhale deeply as you lengthen your spine and lift your tailbone toward the ceiling, creating a gentle curve in the lower back (Cow Pose).",
      "On the exhale, round your spine upward, tucking your chin toward your chest and drawing your belly button toward your spine (Cat Pose).",
      "Engage your core and relax your shoulders, keeping them away from your ears while gently pressing into the mat with your hands.",
      "For a deeper stretch, press the tops of your feet into the mat and draw your tailbone higher."
    ]
  },
  {
    "id": 5,
    "name": "Child's Pose",
    "cues": [
      "Start in Hero Pose, then spread your knees wide apart allowing your toes to meet at the back of the mat.",
      "Sit back onto your heels, ensuring your hips are comfortably aligned with your knees. Reach your arms forward on the mat, lengthening your spine and feeling a gentle stretch through your back.",
      "Slowly lower your forehead toward the floor, keeping your neck relaxed and aligned with your spine. If necessary, place a cushion or block under your forehead for support.",
      "Breathe deeply through your nose, allowing your body to soften with each exhale, releasing any tension in your back, shoulders, and hips. Let the weight of your body gently sink into the floor as you relax further into the pose.",
      "Stay here for several breaths, allowing your body to rest and rejuvenate. If desired, gently rock your body side to side to deepen the stretch and release any remaining tension."
    ]
  }
]