[
  {
    "id": 1,
    "name": "Mountain Pose",
    "cues": [
      "Stand tall with your feet together and arms at your sides. Ground down through your feet, feeling the connection to the earth.",
      "On an inhale, lift your chest and lengthen your spine, reaching through the crown of your head.",
      "Exhale and relax your shoulders away from your ears, keeping your arms relaxed but engaged.",
      "Inhale and firm your thighs, lifting your kneecaps without locking your knees.",
      "Exhale and engage your core, pulling your belly button toward your spine.",
      "Breathe deeply in and out through your nose, grounding yourself and cultivating focus and stability for 5 to 10 breaths."
    ]
  },
  {
    "id": 2,
    "name": "Downward-Facing Dog",
    "cues": [
      "Start in a tabletop position with your hands directly under your shoulders and knees under your hips.",
      "Tuck your toes and lift your hips up and back, aiming to form an inverted V shape with your body.",
      "Press firmly into your hands, spreading your fingers wide to distribute the weight evenly across the palms.",
      "Engage your core to protect your lower back, keeping a slight bend in your knees if needed to maintain a neutral spine.",
      "Lengthen your spine by drawing your tailbone up toward the ceiling and pushing your chest towards your thighs.",
      "Relax your head and neck, keeping a neutral gaze between your legs or toward your feet, and avoid collapsing the neck.",
      "Ground your heels towards the floor, but do not force them down; allow your hamstrings to stretch gradually.",
      "Maintain even weight distribution between your hands and feet, ensuring the arms are straight and the legs are active.",
      "Hold the position for 5 to 10 deep breaths, maintaining steady breathing and a calm, focused mind."
    ]
  },
  {
    "id": 3,
    "name": "Plank Pose",
    "cues": [
      "Begin in a tabletop position on your hands and knees, ensuring your wrists are directly under your shoulders and your knees are under your hips.",
      "Step your feet back one at a time, straightening your legs and coming into a high push-up position. Align your wrists directly beneath your shoulders and spread your fingers wide for stability.",
      "Engage your core by drawing your navel toward your spine, and activate your glutes to prevent your hips from sagging or lifting too high.",
      "Press firmly into the floor through your palms, distributing weight evenly across your hands, and activate your arm muscles to stabilize your shoulders.",
      "Keep your neck in a neutral position by gazing down slightly ahead of your hands. Avoid craning your neck upward or letting your head drop toward the mat.",
      "Hold the pose for 5 to 10 deep breaths, maintaining steady engagement in your core, arms, legs, and glutes."
    ]
  },
  {
    "id": 4,
    "name": "Four-Limbed Staff Pose",
    "cues": [
      "Start in Plank Pose with your shoulders stacked directly over your wrists, and your body in a straight line from head to heels.",
      "Engage your core by drawing your navel towards your spine to prevent your hips from sagging.",
      "Firmly press the tops of your feet into the mat, and activate your quadriceps to support the legs.",
      "Hug your elbows in towards your ribs as you lower your body down, keeping the upper arms parallel to the floor.",
      "Lower your body slowly and with control, maintaining a straight line from your head to your heels, avoiding any collapse in the chest or sagging of the hips.",
      "As you approach the ground, stop when your upper arms are parallel to the floor, making sure the elbows are at a 90-degree angle.",
      "Keep the shoulders away from the ears, and maintain an active connection in the core and legs to prevent your body from drooping.",
      "Breathe steadily, keeping your body strong and engaged throughout the pose for 5 to 10 breaths."
    ]
  },
  {
    "id": 5,
    "name": "Upward-Facing Dog",
    "cues": [
      "Start in a high plank position with your wrists directly under your shoulders, legs extended, and your body forming a straight line from head to heels.",
      "Inhale and, as you press your palms firmly into the floor, lower your hips slightly while straightening your arms, lifting your chest off the ground. Engage your core to support your spine.",
      "Roll your shoulders back and down, opening your chest. Keep your shoulder blades pulling down your back, avoiding any tension in the neck or shoulders.",
      "Press the tops of your feet into the floor while keeping your thighs lifted off the ground and your legs actively engaged. Ensure your hips don't sag toward the floor.",
      "Look slightly upward, keeping your neck long and in alignment with your spine. Your gaze should be relaxed and focused forward or slightly upward without straining your neck.",
      "Hold the pose for 5 to 10 breaths, focus on lifting through your chest and lengthening through your spine while keeping the body active and stable."
    ]
  },
  {
    "id": 6,
    "name": "Child's Pose",
    "cues": [
      "Start by kneeling on the mat with your big toes touching and knees spread wide apart, allowing room for your torso to fold.",
      "Sit back onto your heels, ensuring your hips are comfortably aligned with your knees. Reach your arms forward on the mat, lengthening your spine and feeling a gentle stretch through your back.",
      "Slowly lower your forehead toward the floor, keeping your neck relaxed and aligned with your spine. If necessary, place a cushion or block under your forehead for support.",
      "Breathe deeply through your nose, allowing your body to soften with each exhale, releasing any tension in your back, shoulders, and hips. Let the weight of your body gently sink into the floor as you relax further into the pose.",
      "Stay here for several breaths, allowing your body to rest and rejuvenate. If desired, gently rock your body side to side to deepen the stretch and release any remaining tension."
    ]
  },
  {
    "id": 7,
    "name": "Warrior I",
    "cues": [
      "Begin in Mountain Pose (Tadasana), with your feet hip-width apart.",
      "Step one foot to the back of the mat, ensuring the back foot is angled slightly outwards, about 45 degrees.",
      "Bend your front knee, keeping the knee aligned directly above the ankle, and avoid letting it extend beyond your toes.",
      "Keep your back leg straight and strong, pressing down through the back heel to maintain balance and stability.",
      "Square your hips and shoulders to the front of the mat, making sure your torso is facing forward while keeping a slight lift in the chest.",
      "Extend your arms overhead, keeping them parallel to each other with palms facing inward, and reach through the fingertips while avoiding tension in the shoulders.",
      "Press firmly into your front foot and root down through the back heel to maintain balance and groundedness.",
      "Breathe deeply, maintaining steady inhales and exhales, and hold the position for 5 to 10 breaths before switching sides."
    ]
  },
  {
    "id": 8,
    "name": "Warrior II",
    "cues": [
      "Start in Warrior I (Virabhadrasana I) with your front knee bent and your back leg straight.",
      "Open your hips and shoulders to face the side, aligning your body with the long edge of the mat.",
      "Extend both arms out to shoulder height, parallel to the floor, with your palms facing down.",
      "Bend your front knee deeply to a 90-degree angle, ensuring that your knee is directly over your ankle, not extending beyond it.",
      "Firmly press the outer edge of your back foot into the mat, keeping your back leg straight and strong. Activate the muscles in your back leg to support the alignment of your hips.",
      "Engage your core by gently pulling your navel toward your spine, lifting through your chest, and avoid arching your lower back.",
      "Breathe deeply, maintaining steady inhales and exhales, and hold the position for 5 to 10 breaths before switching sides."
    ]
  },
  {
    "id": 9,
    "name": "Warrior III",
    "cues": [
      "Begin in Warrior I, ensure your hips and shoulders are square to the front.",
      "Shift your weight into your front leg, grounding through the heel of the front foot, and gently lift your back leg off the floor. Keep your back leg straight, with your foot flexed and strong.",
      "Simultaneously, lean your torso forward, keeping your spine long and straight, and align your body from your fingertips to your lifted heel, creating a straight line.",
      "Extend your arms forward, parallel to the floor, with your palms facing each other or down, depending on your comfort.",
      "Engage your core muscles deeply to support your spine, and ensure your hips stay square to the ground, not rotating open. Keep your standing leg slightly bent if needed for stability.",
      "Focus on a fixed point in front of you to help with balance, and breathe deeply, maintaining steady, controlled breaths throughout the pose.",
      "Hold the pose for 5 to 10 breaths, keeping your body active and aligned. To come out of the pose, gently lower the lifted leg and return to Warrior I, then switch sides."
    ]
  },
  {
    "id": 10,
    "name": "Reverse Warrior",
    "cues": [
      "From Warrior II, flip your front palm to face up and reach your arm overhead.",
      "Lean back, bringing your front arm along your ear, and keeping your back leg strong and straight.",
      "Maintain a deep bend in your front knee, but avoid overextending your lower back.",
      "Reach through the fingers and create a stretch along the entire side body.",
      "Keep your chest open and breathe deeply as you feel the stretch in the hips, legs, and arms for 5 to 10 breaths."
    ]
  },
  {
    "id": 11,
    "name": "Extended Side Angle",
    "cues": [
      "Start in Warrior II with your feet wide apart, ensuring your front knee is bent at a 90-degree angle, directly over the ankle, and your back leg is straight, pressing the outer edge of the back foot into the floor.",
      "Reach your front arm forward, lengthening through the fingertips, and then lower it toward the floor or a block placed next to your front foot, keeping your shoulder aligned with your wrist.",
      "Extend your top arm overhead, creating a straight line from your back heel through the back leg, side body, and fingertips, reaching strongly through both arms.",
      "Engage your core muscles, drawing the navel in slightly to stabilize the pelvis and protect your lower back, keeping the torso long and lifted.",
      "Open your chest toward the ceiling, rotating the top ribs upward while keeping both shoulders stacked, avoiding any rounding or collapsing in the chest.",
      "Gaze can be directed upward toward your top hand, or forward toward the horizon, depending on your neck’s comfort and your desired focus.",
      "Ensure your front knee remains aligned with the toes and does not extend past the ankle, deepening the bend only as your flexibility allows.",
      "Press firmly through the outer edge of the back foot to help maintain balance and prevent the back leg from collapsing inward.",
      "Breathe deeply for 5 to 10 breaths, maintaining length in the spine, and create a stretch along the side body from the back foot to the fingertips."
    ]
  },
  {
    "id": 12,
    "name": "Triangle Pose",
    "cues": [
      "Start by standing with your feet wide apart, ensuring that your front foot points straight ahead while your back foot is at a 45-degree angle, ensuring a stable base.",
      "Engage your legs, drawing energy up through the legs to create strong, straight lines. Ensure your knees are soft but not locked, and your thighs are active.",
      "Reach your arms out parallel to the floor, keeping them strong and extended, and make sure your shoulders are not raised towards your ears.",
      "Hinge at your hips as you lean over your front leg, keeping your torso long and your spine straight. Avoid rounding your back, and think of lengthening from your tailbone to the crown of your head.",
      "Lower your hand to your shin, ankle, or a block placed under your hand for extra support, ensuring that your body stays open and your chest is rotated upward.",
      "Extend your top arm toward the ceiling, keeping your shoulders stacked and your chest open. Create a straight line from your back heel to your top fingertips, engaging the core to support the spine.",
      "Gaze toward your top hand, or if this strains the neck, look forward or down at the floor, ensuring the neck stays relaxed and the spine stays aligned.",
      "Keep breathing deeply, maintaining a steady, calm rhythm as you hold the position for 5 to 10 breaths."
    ]
  },
  {
    "id": 13,
    "name": "Half Moon Pose",
    "cues": [
      "Start in Warrior II, shift your weight onto your front leg, pressing your front foot into the mat, and slowly lift your back leg so it’s parallel to the floor, keeping your foot flexed and engaged.",
      "Place your bottom hand on the floor directly below your shoulder, or on a yoga block to raise the floor up if you need more support. Make sure the block is positioned about 6-12 inches away from your foot, in line with your body, for balance.",
      "Engage your core to stabilize your torso, ensuring that your chest opens to the side and your spine stays long. Your torso should be in one straight line from the grounded hand to the lifted foot.",
      "Point your lifted foot toward the ceiling, and reach your raised arm straight up, keeping your fingers spread wide. Ensure the arm is in line with your torso, and your bicep is close to your ear.",
      "For additional support, practice the pose near a wall. Place your lifted foot against the wall to create a sense of stability. This can help you build confidence in the pose and work on balance.",
      "Continue breathing deeply, keeping a steady and calm rhythm as you hold the pose for 5 to 10 breaths."
    ]
  },
  {
    "id": 14,
    "name": "Chair Pose",
    "cues": [
      "Begin in Mountain Pose, standing tall with your feet together or hip-width apart, grounding through all four corners of your feet.",
      "Inhale deeply, and as you exhale, bend your knees deeply as if you are sitting down into an imaginary chair. Keep your knees behind your toes and track them directly over your ankles, making sure they don’t collapse inward.",
      "Push your hips back, ensuring that your thighs are parallel to the ground or as low as comfortable. Keep your weight in your heels and press through the inner edges of your feet for stability.",
      "Extend your arms straight up overhead with palms facing inward. Keep your shoulders relaxed and your arms active, reaching strongly through your fingertips.",
      "Engage your core by drawing your navel toward your spine to create stability in your torso. Tuck your tailbone slightly to prevent your lower back from arching excessively and lengthen your spine upwards, avoiding slumping.",
      "Lift your chest, ensuring that your ribs don’t flare out. Keep your gaze forward or slightly upward, but avoid straining your neck by keeping your chin slightly tucked.",
      "Hold the pose, breathing deeply and evenly for 5 to 10 breaths. With each exhale, sink a little deeper into the chair, maintaining the integrity of your posture and keeping your core engaged for balance and support."
    ]
  },
  {
    "id": 15,
    "name": "Goddess Pose",
    "cues": [
      "Start in Mountain Pose, standing tall with your feet together and arms by your sides.",
      "Step your feet wide apart, about 3 to 4 feet, with your toes turned outward at a 45-degree angle. Ensure your feet are firmly grounded and parallel to each other.",
      "Bend your knees deeply, keeping them aligned over your toes. Avoid letting your knees cave inward. Lower your hips down towards the floor, aiming for your thighs to be parallel to the floor or slightly lower while maintaining a neutral spine.",
      "Extend your arms out to the sides at shoulder height, keeping your palms facing down. Bend your elbows to 90 degrees, ensuring the forearms are parallel to the floor. Draw your shoulder blades gently down your back, keeping your shoulders away from your ears.",
      "Engage your core by drawing your navel toward your spine to support your lower back. Keep your chest lifted without over-arching your back. Keep your neck neutral, with your gaze straight ahead or slightly up.",
      "Press evenly into all four corners of your feet—inner heels, outer heels, inner toes, and outer toes. Feel the strength and energy flowing through your legs, quads, glutes, and inner thighs.",
      "Continue breathing deeply, maintaining steady and controlled breaths. Hold the pose for 5 to 10 breaths, feeling strength and stability through your body."
    ]
  },
  {
    "id": 16,
    "name": "High Lunge",
    "cues": [
      "Start in Mountain Pose with your feet together and standing tall.",
      "Step your left foot back about 3 to 4 feet, keeping your feet hip-width apart.",
      "Bend your right knee to a 90-degree angle, ensuring it is directly over your ankle, and keep your left leg straight with the heel lifted off the ground.",
      "Lift your arms overhead, keeping your palms facing each other, with your shoulders relaxed and your chest open.",
      "Engage your core, drawing the navel in, and lengthen your spine as you reach the crown of your head toward the ceiling.",
      "Press into your front foot and the ball of your back foot, keeping your hips square to the front of the mat.",
      "Maintain steady breath for 5 to 10 breaths, settling deeper into the lunge while keeping your gaze forward or slightly up."
    ]
  },
  {
      "id": 17,
      "name": "Low Lunge",
      "cues": [
          "Start in Mountain Pose, standing tall with feet hip-width apart.",
          "Step one foot back, ensuring the front foot is aligned directly under the front knee, with the knee bent to a 90-degree angle.",
          "Lower your back knee to the floor, placing the top of your back foot flat on the mat for stability.",
          "Square your hips to the front, ensuring they are evenly aligned, and avoid twisting or tilting.",
          "Lift your torso upright and extend your arms overhead, with palms facing each other and shoulders relaxed away from your ears.",
          "Engage your core muscles to support the lower back and maintain balance as you gently press your hips forward.",
          "Ground through your front foot and breathe deeply for 5 to 10 breaths, feeling the stretch through your hip flexors, thighs, and chest."
      ]
  },
  {
    "id": 18,
    "name": "Pyramid Pose",
    "cues": [
      "Start in Mountain Pose with your feet hip-width apart and arms by your sides.",
      "Step your feet wide apart, about 3-4 feet, keeping your feet parallel or turning your right foot outward by about 45 degrees and your left foot slightly turned inward.",
      "Engage your thighs and lift your pelvic floor as you square your hips towards the front of the mat, pulling the left hip forward and the right hip back to level the pelvis.",
      "Inhale to lengthen your spine, and as you exhale, begin to hinge from your hips, not your waist, reaching your torso forward and then down towards your front leg.",
      "Place your hands on your front shin, ankle, or a block under your hands to keep your spine long. Keep your shoulders relaxed and avoid rounding your back.",
      "Press down through your back leg, keeping it straight and active, with your back heel grounded and your thigh lifted.",
      "Hold the pose for 5 to 10 breaths, continuing to lengthen through the spine, then slowly rise up by engaging your core and stepping back to Mountain Pose before switching sides."
    ]
  },
  { 
    "id": 19,
    "name": "Wide-Legged Forward Fold",
    "cues": [
      "Begin in Mountain Pose with your feet wide apart, ensuring that your legs are about 3-4 feet apart, depending on your flexibility. Turn your toes slightly inward, and rotate your heels outward, keeping your legs active.",
      "Hinge from your hips, not from your waist, keeping your spine long and your chest open. Imagine a string pulling the crown of your head forward as you fold your torso towards the floor.",
      "As you reach forward, place your hands on the floor, your ankles, or use blocks under your hands for support, depending on your flexibility. If you can’t reach the floor comfortably, using blocks can keep your spine aligned and reduce strain.",
      "Relax your neck, allowing your head to hang heavy, and release tension in your face and jaw. Keep your gaze soft or direct it towards your feet.",
      "Press the outer edges of your feet into the floor to create stability, and keep your heels grounded while gently engaging your inner thighs. Keep the weight evenly distributed in your feet.",
      "Hold the pose for 5 to 10 breaths, focusing on lengthening your spine with each inhale and deepening the fold with each exhale. With every breath, allow the upper body to release more tension, letting gravity assist in the stretch."
    ]
  },
  {
    "id": 20,
    "name": "Standing Split",
    "cues": [
      "Begin in Mountain Pose, with your feet hip-width apart and your weight evenly distributed between both feet.",
      "Shift your weight onto your right leg, pressing firmly into the ground with your right foot. Engage your right thigh and lift your left leg straight behind you, keeping the left leg as straight as possible and in line with your torso.",
      "As you lift your left leg, square your hips so that both hips face the floor. Avoid letting the left hip open up to the side. Keep your pelvis neutral and your spine long.",
      "Place your hands on the floor directly below your shoulders or use yoga blocks under your hands for additional support. Make sure your wrists, elbows, and shoulders are aligned, and press the ground away to lift your torso slightly.",
      "Lengthen your spine as you fold forward, reaching your chest towards your standing leg. Keep your gaze down to the floor or slightly forward, maintaining a long neck and stable balance.",
      "Focus on engaging your standing leg, pressing firmly into the ground with the heel and activating the thigh muscles. This will help maintain balance and stability as you hold the pose.",
      "Breathe deeply, holding the pose for 5 to 10 breaths. With each exhale, try to lengthen through your spine and deepen the stretch in your hamstrings without forcing your lifted leg higher.",
      "To release, slowly lower your lifted leg with control and return to Mountain Pose."
    ]
  },
  {
    "id": 21,
    "name": "Tree Pose",
    "cues": [
      "Begin in Mountain Pose, with your feet together and grounding down through all four corners of your standing foot.",
      "Shift your weight onto one leg, engaging the muscles of the standing leg to create stability.",
      "Slowly lift your opposite foot, placing the sole of your foot on the inner thigh, calf, or ankle of your standing leg (avoiding the knee). Ensure your foot is pressing gently into your leg for support.",
      "Press the sole of your foot into your leg while also pressing your leg into your foot, creating a dynamic balance between the two.",
      "Bring your hands together in front of your heart in a prayer position (Anjali Mudra), or extend your arms overhead with your palms facing each other. Keep your shoulders relaxed and arms active.",
      "Focus your gaze on a steady point in front of you at eye level to help with balance, and maintain a calm, even breath to help center your focus.",
      "Hold the pose for 5 to 10 breaths, and to come out of the pose, slowly lower your raised leg and return to Mountain Pose with control."
    ]
  },
  {
    "id": 22,
    "name": "Dancer Pose",
    "cues": [
      "Start in Mountain Pose, grounding evenly through the four corners of both feet.",
      "Shift your weight onto your standing leg, ensuring your knee is slightly bent.",
      "Reach back with one hand to grab the inside of your opposite foot or ankle. If you have limited flexibility, use a yoga strap around your foot or ankle for support.",
      "Lift your back leg behind you, aiming to create a straight line from your lifted leg to the crown of your head. Extend your opposite arm forward, keeping your chest lifted and your gaze focused on a point in front of you.",
      "Engage your core, drawing your navel in toward your spine, to keep your torso upright and prevent arching your lower back.",
      "Press firmly into the standing leg, keeping the knee slightly bent and the foot active to maintain stability and balance.",
      "Hold the pose for 5 to 10 deep breaths, keeping your focus steady, then slowly release and return to Mountain Pose."
    ]
  },
  {
    "id": 23,
    "name": "Eagle Pose",
    "cues": [
      "Start by standing tall in Mountain Pose, grounding evenly through both feet and engaging your legs and core.",
      "Shift your weight onto your left leg, then cross your right leg over your left, wrapping your right foot around the back of your left calf. If this is too intense, you can keep the right foot on the floor or place it lightly on the floor for extra balance.",
      "Bend both knees slightly as if sitting into a chair, keeping your core engaged to protect the lower back and maintain balance.",
      "Extend your arms forward, parallel to the ground, and then cross your right arm under your left arm. Bring your palms to touch, or if that’s not accessible, place the backs of the hands together or hold opposite shoulders.",
      "Draw your elbows down towards your chest to deepen the shoulder stretch, ensuring that your shoulders are relaxed and away from your ears.",
      "Focus on lengthening your spine by reaching the crown of your head toward the ceiling and maintaining a steady gaze (drishti) to help with balance.",
      "Hold the pose for 5 to 10 breaths, breathing deeply and steadily, and focus on maintaining balance and stability throughout."
    ]
  },
  {
    "id": 24,
    "name": "Crow Pose",
    "cues": [
      "Start in a squatting position with your feet hip-width apart, grounding through the balls of your feet and spreading your toes for stability.",
      "Place your hands firmly on the floor about shoulder-width apart, with your fingers spread wide to distribute your weight evenly across your palms. Keep your elbows slightly bent.",
      "Bring your knees to the backs of your upper arms, keeping your thighs close to your chest. Ensure that your knees are not pressing directly into the elbows, but rather resting on the triceps to provide stability.",
      "Shift your weight forward gradually, keeping your core engaged and lifting your feet off the ground, balancing solely on your hands. Keep your gaze focused either slightly forward or down to help with balance.",
      "Activate your core muscles to maintain control of your body and avoid collapsing in the lower back. Keep your spine long and your body aligned, with the hips lifted and shoulders actively pressing away from the floor.",
      "Hold the pose while breathing deeply and steadily for 5 to 10 breaths. Focus on maintaining a firm connection through your hands and arms, and ensure your weight is evenly distributed across your palms and fingers to protect your wrists."
    ]
  },
  {
    "id": 25,
    "name": "Side Crow Pose",
    "cues": [
      "Start in a squatting position with your feet together, knees bent, and hips close to your heels. Keep your spine long and your chest lifted.",
      "Twist your torso to one side, bringing your opposite elbow across your thigh or knee. Place both hands firmly on the ground shoulder-width apart, with fingers spread wide for stability.",
      "Bend your elbows slightly, creating a shelf with your upper arms to support your knees or thighs. Ensure your elbows are not flaring out but remain aligned under your shoulders.",
      "Engage your core and shift your weight forward into your hands. Begin lifting both feet off the floor, balancing your knees on one upper arm or splitting the weight between both arms if more advanced.",
      "Keep your gaze forward or slightly down to maintain balance and prevent straining your neck. Focus on keeping your core strong, your shoulders away from your ears, and your body steady.",
      "Breathe deeply and hold the pose for 5 to 10 breaths, maintaining control and alignment. To release, lower your feet back to the floor gently and return to the starting position."
    ]
  },
  {
    "id": 26,
    "name": "Garland Pose",
    "cues": [
      "Begin in Mountain Pose with your feet slightly wider than hip-width apart and toes pointing slightly outward.",
      "On an exhale, bend your knees and lower your hips into a deep squat, keeping your heels flat on the ground or using a folded blanket or wedge under them for support if needed.",
      "Spread your knees wide, aligning them with your toes, and ensure your spine stays long as you sink deeper into the squat.",
      "Bring your palms together in a prayer position (Anjali Mudra) at your chest, lightly pressing your thumbs against your sternum.",
      "Place your elbows inside your knees and use gentle pressure to open the hips further, being mindful not to overstretch.",
      "Engage your core, keeping your chest lifted and your back straight, while lengthening through the crown of your head.",
      "Hold the pose for 5 to 10 breaths, and slowly rise back into Mountain Pose with control when ready."
    ]
  },
  {
    "id": 27,
    "name": "Feathered Peacock Pose",
    "cues": [
      "Start in Dolphin Pose with your forearms on the ground, elbows directly under your shoulders, and your arms parallel to each other. Press your forearms firmly into the mat and engage your core and legs.",
      "Walk your feet toward your elbows to prepare for the lift. Keep your feet together and engaged as you move closer to the forearms, gradually shortening the distance between your feet and elbows.",
      "From here, lift one leg at a time, engaging your core, and begin to stack your hips over your shoulders. Keep the legs straight and active as you continue to lift the other leg overhead.",
      "Press into your forearms to maintain stability, and aim to keep your body aligned in a straight line from your forearms to your feet. Keep your chest open and your shoulders engaged to prevent any collapsing in the upper body.",
      "Hold the pose for 5 to 10 seconds, or as long as you can maintain proper form. To come out of the pose, slowly lower one leg at a time back to the ground."
    ]
  },
  {
    "id": 28,
    "name": "Handstand Pose",
    "cues": [
      "Begin in Mountain Pose, with your feet hip-width apart.",
      "Place your hands on the floor in front of you, about shoulder-width apart. Spread your fingers wide and press firmly into the ground for stability. Keep your wrists aligned directly under your shoulders.",
      "Shift your weight slightly forward onto your hands and begin to bend your knees, preparing to kick up into the handstand.",
      "On your next inhale, engage your core, and as you exhale, kick up with one leg, using controlled momentum to lift your other leg toward the ceiling. Focus on keeping your body straight as both legs rise.",
      "Once both legs are extended toward the ceiling, press strongly into your hands and actively engage your arms, shoulders, core, and legs to maintain a straight line from hands to feet.",
      "Focus on balance by keeping your gaze slightly between your hands or toward the floor. Maintain deep, steady breaths and stay aware of any slight adjustments needed to hold the pose.",
      "Hold the pose for 5 to 10 seconds, or as long as you can maintain proper form. To exit the pose, gently lower one leg back down, followed by the other, and return to Mountain Pose with control."
    ]
  },
  {
    "id": 29,
    "name": "Shoulderstand Pose",
    "cues": [
      "Begin by lying flat on your back in Corpse Pose, with your legs extended and arms resting by your sides, palms facing up.",
      "Press your arms into the floor to engage your upper body, and lift your legs and hips toward the ceiling. Keep your feet together and legs straight.",
      "Support your lower back with your hands by placing them on your lower back, keeping your elbows shoulder-width apart and your forearms perpendicular to the floor.",
      "Ensure that your neck remains relaxed, avoiding any direct pressure on it. Engage your core and legs to lift the torso and create a straight line from your shoulders to your feet.",
      "Align your body so that your legs are vertically stacked over your shoulders, with your gaze directed upward or slightly toward the chest to avoid strain on the neck.",
      "Draw your shoulder blades toward your spine, keeping your chest open and avoiding collapsing the ribcage.",
      "Hold the pose for 5 to 10 seconds, while maintaining a straight line from shoulders to feet."
    ]
  },
  {
    "id": 30,
    "name": "Fish Pose",
    "cues": [
      "Begin seated with your legs extended straight in front of you and your hands resting beside your hips on the floor, palms facing down.",
      "Press your hands into the floor and engage your legs, keeping them straight and active. Flex your feet to help ground your legs.",
      "Slowly begin to arch your back by lifting your chest up and forward, placing your forearms on the floor for support.",
      "As you continue to lift your chest, drop the crown of your head gently towards the floor. Keep your shoulders relaxed and away from your ears.",
      "Ensure your elbows remain grounded, pressing them into the floor to deepen the chest opening, and avoid putting any unnecessary weight on your neck.",
      "Hold the pose, breathing deeply for 5 to 10 breaths. Feel the stretch across your chest, throat, and upper back, while maintaining an open and relaxed neck."
    ]
  },
  {
    "id": 31,
    "name": "Camel Pose",
    "cues": [
      "Start by kneeling on the floor with your knees hip-width apart, ensuring your thighs are perpendicular to the floor.",
      "Engage your core muscles and lengthen your spine as you begin to gently arch your back, making sure your pelvis is aligned with your knees.",
      "Place your hands on your lower back for support, with fingers pointing down toward the floor, to maintain stability as you begin to lean back.",
      "As you continue to lean back, reach your hands toward your heels, one at a time if necessary, while lifting your chest toward the ceiling.",
      "Keep your hips pressed forward, avoiding any excessive movement in the lower back, and make sure to engage your glutes and thighs to protect your lumbar spine.",
      "Focus on lifting through the chest, drawing your shoulder blades back and down, while gently relaxing your head back (optional) to fully open your throat.",
      "Hold the pose for 5 to 10 breaths, keeping your gaze toward the ceiling or lightly toward the back of the room, and feel the stretch along the front of your body from the chest down to the thighs."
    ]
  },
  {
    "id": 32,
    "name": "Bridge Pose",
    "cues": [
      "Begin by lying flat on your back in Corpse Pose, with your arms relaxed by your sides.",
      "Bend your knees and place your feet flat on the floor, hip-width apart, ensuring that your heels are close enough to touch your fingertips.",
      "Press into your feet, particularly through the heels and inner arches, as you begin to lift your hips towards the ceiling. Keep your shoulders and head grounded on the mat.",
      "Engage your glutes, legs, and core to help lift your hips, creating a straight line from your knees to your shoulders.",
      "Interlace your hands underneath your back, pressing your arms firmly into the floor to help elevate your hips further. Be sure your shoulders stay relaxed and away from your ears.",
      "Engage your thighs and squeeze your glutes to maintain the lift. Keep your knees in line with your toes and avoid letting them splay outward.",
      "Ensure your neck is relaxed, with your chin slightly tucked toward your chest, maintaining a neutral position in the cervical spine.",
      "Hold the pose for 5 to 10 breaths, breathing deeply and steadily, maintaining the lift of your hips."
    ]
  },
  {
    "id": 33,
    "name": "Wheel Pose",
    "cues": [
      "Begin in Corpse Pose, lying on your back with your legs extended and arms resting by your sides, palms facing upward.",
      "Bend your knees and place your feet flat on the floor, hip-width apart. Ensure your feet are parallel, with the toes pointing forward and the soles pressing into the floor.",
      "Place your hands behind your head, with your fingers pointing toward your shoulders and your elbows pointing straight up. Press your palms into the floor, aligning them with your shoulders.",
      "Engage your legs by pressing your feet into the ground as you begin to lift your hips toward the ceiling. As your hips lift, press into your hands to straighten your arms and push your chest upwards into the backbend.",
      "Ensure your thighs remain parallel, keeping your knees in line with your feet. Engage your core and avoid overarching your lower back. Maintain a neutral neck by letting your head hang freely or keeping your gaze slightly upward.",
      "Hold the pose, breathing deeply and focusing on expanding your chest and creating space across the front of your body. Continue lifting through your chest, engaging your arms and legs for stability for 5 to 10 breaths."
    ]
  },
  {
      "id": 34,
      "name": "Reclining Bound Angle Pose", 
      "cues": [
          "Begin in Corpse Pose, lying flat on your back with your legs extended and arms relaxed by your sides.",
          "Bend your knees and bring the soles of your feet together, allowing your knees to gently open out to the sides. Let gravity guide your knees downward without forcing them.",
          "Ensure your spine remains neutral. If your lower back feels strained, slide a bolster or folded blanket under your hips or slightly elevate your torso with additional props.",
          "Position your arms in a comfortable position: rest them by your sides with palms facing up, place them on your belly, or extend them overhead for a gentle stretch through the upper body.",
          "Relax your shoulders away from your ears and keep your chest open. Use a pillow or blanket under your head if needed for added support.",
          "Close your eyes and take slow, deep breaths, focusing on releasing tension in your hips, thighs, and lower back with each exhale.",
          "Hold the pose for 5 to 10 breaths, or as long as it feels comfortable, maintaining your breath and a sense of ease throughout."
      ]
  },
  {
    "id": 35,
    "name": "Legs-Up-The-Wall Pose",
    "cues": [
      "Begin by sitting sideways with one hip close to a wall. Slowly lower your upper body down onto your back as you swing your legs up against the wall.",
      "Adjust your hips so they are as close to the wall as comfortably possible. Your legs should extend straight up, resting fully against the wall.",
      "Place a folded blanket, bolster, or cushion under your hips for added support, especially if you feel discomfort in your lower back.",
      "Let your arms relax naturally by your sides, palms facing up, or rest your hands on your belly to connect with your breath.",
      "Soften your jaw, shoulders, and belly, releasing tension as you settle into the pose. Close your eyes and focus on steady, deep breaths.",
      "Stay in the pose for 5 to 10 slow and deep breaths, or as long as it feels restorative, letting gravity guide relaxation into your body and mind."
    ]
  },
  {
    "id": 36,
    "name": "Boat Pose",
    "cues": [
      "Start seated with your knees bent and feet flat on the floor, keeping your spine long and your shoulders relaxed.",
      "Engage your core and lean back slightly, keeping your back straight and avoiding collapsing in the lower back.",
      "Lift your legs into a V-shape, either keeping your knees bent for a gentler variation or extending your legs fully for a more advanced option.",
      "Extend your arms forward, parallel to the floor, with palms facing inward or slightly upward to help maintain balance.",
      "Focus on lifting your chest and lengthening your spine, rather than collapsing the torso or rounding the shoulders.",
      "Engage your abdominal muscles deeply to maintain stability and prevent strain on the lower back. Keep your core activated and avoid sinking into the pose.",
      "Hold the pose for 10 seconds, or longer if comfortable, while maintaining steady, deep breaths."
    ]
  },
  {
    "id": 37,
    "name": "Seated Forward Fold",
    "cues": [
      "Sit with your legs extended straight in front of you, with your feet flexed and hip-width apart.",
      "Inhale deeply to lengthen your spine, creating space in the vertebrae. Imagine a string gently pulling you up from the crown of your head.",
      "As you exhale, hinge from your hips to fold forward. Keep a slight bend in your knees if you have tight hamstrings or discomfort in your lower back.",
      "Reach forward toward your feet, ankles, or shins. If you can’t reach them, use a yoga strap or belt around the balls of your feet to hold onto.",
      "Focus on lengthening your torso, rather than forcing the fold. If you feel a strain in the lower back, ease off a little and prioritize length over depth.",
      "Relax your neck, allowing the head to drop gently toward the floor if comfortable.",
      "Breathe deeply and steadily for 5 to 10 breaths, allowing each exhalation to deepen the stretch. With each breath, try to relax more into the pose, releasing tension in your body."
    ]
  },
  {
    "id": 38,
    "name": "Bound Angle Pose",
    "cues": [
      "Sit on the floor with your legs extended in front of you.",
      "Bring the soles of your feet together, and bend your knees, drawing your heels toward your pelvis. Keep the feet close enough so that your knees can open comfortably to the sides.",
      "Hold onto your feet or ankles with your hands, gently pressing your palms into them. If you can't reach your feet, use a yoga strap around the feet to provide support and gently pull yourself deeper into the stretch.",
      "Engage your thighs and lift your kneecaps to protect the knees, while gently pressing your knees down toward the floor. Ensure you are not forcing them down, but allowing gravity to assist in the stretch.",
      "If you choose to fold forward, hinge from your hips rather than rounding your back. Reach your chest toward your feet, maintaining a long spine, and only go as deep as feels comfortable.",
      "Stay in the pose for 5 to 10 breaths, allow each exhalation to release tension in your hips and inner thighs. Feel the stretch in your groins and the deepening of the stretch with every breath."
    ]
  },
  {
    "id": 39,
    "name": "Happy Baby Pose",
    "cues": [
      "Begin in Corpse Pose lying flat on your back, with your arms extended along your sides and your legs relaxed, feet hip-width apart.",
      "Draw your knees toward your chest, keeping your feet flexed and the soles facing the ceiling.",
      "Grasp the outsides of your feet with your hands, bringing your arms to the inside of your legs. Gently open your knees wider than your torso, aiming to bring them toward the floor beside your body, without forcing the stretch.",
      "Relax your shoulders away from your ears and soften your neck, letting your head rest comfortably on the mat.",
      "Hold the pose for 5 to 10 breaths, maintaining your breath and body awareness. With each inhale, lengthen through your spine, and with each exhale, release into the stretch, allowing your hips, inner thighs, and lower back to soften and relax."
    ]
  },
  {
    "id": 40,
    "name": "Corpse Pose",
    "cues": [
      "Begin by lying flat on your back, with your legs extended and feet hip-width apart. Allow your arms to rest by your sides, with your palms facing upward.",
      "Ensure that your body is aligned, with your head, neck, and spine in a neutral position.",
      "Close your eyes and bring your attention inward. Take a few deep breaths to settle into the pose, and then begin to relax each part of your body, starting from your feet and slowly moving upwards.",
      "As you breathe, allow your breath to become slow and deep, focusing on a natural rhythm. Inhale gently, filling your lungs fully, and exhale completely, letting go of any remaining tension with each breath.",
      "Let go of any thoughts or distractions that arise. If your mind wanders, gently bring your focus back to your breath and the sensation of your body resting on the floor.",
      "Hold the pose for 5 to 10 minutes, allowing your body to integrate the effects of your practice."
    ]
  },
  {
    "id": 41,
    "name": "Cobra Pose",
    "cues": [
      "Begin by lying on your stomach with your legs extended behind you, feet hip-width apart, and the tops of your feet pressing into the mat. Place your hands under your shoulders, with your elbows close to your body and your fingers spread wide.",
      "Press your pubic bone gently into the floor, and engage your legs by lifting the kneecaps slightly, ensuring that the tops of your feet remain grounded. Activate your glutes and thighs to support the lower back and prevent over-arching.",
      "On an inhale, begin to lift your chest off the floor, straightening your arms but keeping your elbows slightly bent. Avoid pushing your hands into the floor too forcefully, allowing the back muscles to do most of the work.",
      "Open your chest and broaden your collarbones, drawing the shoulder blades gently together and down your back. Keep your shoulders relaxed, away from your ears, and avoid arching excessively in the lower back by engaging the lower body and keeping the hips grounded.",
      "Hold the pose for 5 to 10 breaths, breathing deeply and continuously. With each inhale, lengthen your spine, lifting through the crown of your head, and with each exhale, deepen into the stretch while maintaining stability and control throughout the body."
    ]
  },
  {
    "id": 42,
    "name": "Locust Pose",
    "cues": [
      "Lie on your stomach with your arms extended alongside your body, palms facing down.",
      "On an inhale, lift your chest, legs, and arms off the floor, engaging your back muscles.",
      "Keep your legs straight and together, and avoid clenching your glutes while maintaining length in your spine.",
      "Focus on lifting from the chest and legs, opening the heart while keeping the neck long.",
      "Hold the pose, breathing deeply, and engage the back of the body to maintain stability."
    ]
  },
  {
    "id": 43,
    "name": "Bow Pose",
    "cues": [
      "Lie on your stomach with your arms extended by your sides and bend your knees to bring your heels toward your hips.",
      "Reach your hands back to grasp your ankles, and on an inhale, lift your chest and legs off the floor.",
      "Press your feet into your hands and continue to lift your chest, deepening the backbend while keeping your hips grounded.",
      "Maintain an active core to support your lower back, and keep your neck neutral by looking forward or slightly up.",
      "Hold the pose, breathing deeply, and focus on lifting and expanding your heart."
    ]
  },
  {
    "id": 44,
    "name": "Puppy Pose",
    "cues": [
      "Start on your hands and knees, with your hips above your knees and your hands slightly forward.",
      "On an inhale, slowly lower your chest and chin toward the floor while keeping your hips lifted.",
      "Keep your arms extended forward, with your palms pressing down into the floor and fingers spread wide.",
      "Focus on elongating your spine, lengthening your chest, and relaxing your neck.",
      "Hold the pose, breathing deeply, and focus on the gentle stretch in your shoulders and upper back."
    ]
  },
  {
    "id": 45,
    "name": "Cat-Cow Pose",
    "cues": [
      "Begin in a tabletop position with your wrists directly under your shoulders and knees under your hips.",
      "On an inhale, drop your belly toward the floor and lift your head and tailbone toward the ceiling (Cow Pose).",
      "On an exhale, round your back, tucking your chin to your chest, and draw your belly button toward your spine (Cat Pose).",
      "Move smoothly between the two poses with your breath, maintaining a fluid motion of your spine.",
      "Focus on the connection between breath and movement, feeling each vertebrae articulate."
    ]
  },
  {
    "id": 46,
    "name": "Thread the Needle",
    "cues": [
      "Start in a tabletop position with your wrists directly under your shoulders and knees under your hips.",
      "On an inhale, lift your right arm toward the ceiling, opening your chest.",
      "On an exhale, thread your right arm underneath your left arm, bringing your right shoulder and ear to the floor.",
      "Keep your left hand pressing into the floor for support, or extend your left arm overhead for a deeper stretch.",
      "Hold the pose, breathing deeply, and allow your right shoulder and upper back to release into the stretch."
    ]
  },
  {
    "id": 47,
    "name": "Reverse Plank Pose",
    "cues": [
      "Begin seated with your legs extended straight in front of you and your hands placed behind your hips, fingers pointing toward your feet.",
      "Press firmly into your palms and lift your hips toward the ceiling, creating a straight line from your head to your heels.",
      "Engage your core to prevent your hips from sagging and keep your body aligned.",
      "Roll your shoulders back and open your chest, drawing your shoulder blades together.",
      "Press through your heels and activate your legs, keeping them straight and strong.",
      "Relax your neck and allow your head to drop back gently, or keep it in a neutral position if that feels more comfortable.",
      "Hold the pose for 5 breaths, then slowly lower your hips back to the mat with control."
    ]
  },
  {
    "id": 48,
    "name": "Pigeon Pose",
    "cues": [
      "Begin in a tabletop position, bringing your right knee forward and placing it behind your right wrist.",
      "Extend your left leg straight behind you, lowering your hips toward the floor.",
      "Ensure your back leg is extended straight and the top of your foot is facing down.",
      "Fold forward over your bent leg, keeping your spine long and chest open.",
      "Hold the pose, breathing deeply, and focus on releasing tension in your hips."
    ]
  },
  {
    "id": 49,
    "name": "Plow Pose",
    "cues": [
      "Begin lying on your back with your arms at your sides, palms facing down.",
      "On an inhale, lift your legs up toward the ceiling, keeping them straight, and engage your core.",
      "Exhale and slowly lower your legs over your head, bringing your toes toward the floor behind you.",
      "Support your lower back with your hands if needed, or keep your arms flat on the ground for additional stability.",
      "Relax your neck and shoulders, ensuring there’s no strain or discomfort in the cervical spine.",
      "Keep your legs active and straight, and your hips aligned over your shoulders.",
      "Breathe deeply and hold the pose for 5 to 10 breaths, then gently roll down vertebra by vertebra to return to the starting position."
    ]
  },
  {
    "id": 50,
    "name": "Supine Twist",
    "cues": [
      "Lie on your back and draw your knees toward your chest.",
      "Extend your arms out to the sides, and on an exhale, drop your knees to one side, keeping your shoulders grounded.",
      "Turn your head in the opposite direction to deepen the twist and stretch your spine.",
      "Keep your legs stacked and your knees bent, allowing your spine to gently twist.",
      "Hold the pose, breathing deeply, and feel the release in your back and shoulders."
    ]
  },
  {
    "id": 51,
    "name": "Half Lord of the Fishes",
    "cues": [
      "Sit with your legs extended in front of you, then bend your right knee and cross it over your left leg.",
      "Place your right foot flat on the floor next to your left knee, and inhale to lengthen your spine.",
      "On an exhale, twist your torso to the right, using your left elbow to press against your right knee.",
      "Keep your hips grounded and shoulders relaxed, deepening the twist with each exhale.",
      "Hold the pose, breathing deeply, and focus on the stretch through your spine and chest."
    ]
  },
  {
    "id": 52,
    "name": "Side Plank",
    "cues": [
      "Begin in a plank position, then shift your weight onto your left hand and the edge of your left foot.",
      "Stack your right foot on top of your left, or place it in front of your left foot for stability.",
      "Lift your right arm toward the ceiling and engage your core and legs to maintain balance.",
      "Keep your body in a straight line from head to heels, avoiding sagging in the hips.",
      "Hold the pose, breathing deeply, and feel the engagement in your core and shoulders."
    ]
  },
  {
    "id": 53,
    "name": "Wild Thing",
    "cues": [
      "Begin in Downward-Facing Dog, then shift your weight forward into a backbend position.",
      "Lift your right leg, bending your knee, and open your chest as you rotate your body to face the ceiling.",
      "Place your right foot on the floor behind you, and reach your left arm overhead, creating a heart-opening shape.",
      "Engage your core and glutes to maintain balance, and avoid over-arching your back.",
      "Hold the pose, breathing deeply, and feel the openness in your chest and shoulders."
    ]
  },
  {
    "id": 54,
    "name": "Tiger Pose",
    "cues": [
      "Start in a tabletop position, then extend your right arm forward and left leg back.",
      "On an inhale, bend your left knee and bring your heel toward your glutes while reaching for your foot with your left hand.",
      "Draw your knee and elbow toward each other, rounding your spine slightly.",
      "On an exhale, extend your arm and leg back out, keeping your spine long.",
      "Repeat the movement with breath, focusing on lengthening and contracting with each inhale and exhale."
    ]
  },
  {
    "id": 55,
    "name": "Gate Pose",
    "cues": [
      "Start seated with your legs extended wide apart.",
      "Turn your right foot to point toward the front of the mat and bend your right knee, keeping your left leg extended.",
      "Inhale and reach your left arm toward the left foot, and on an exhale, extend your torso over your left leg.",
      "Keep your chest open and your right leg active, avoiding any rounding in your back.",
      "Hold the pose, breathing deeply, and feel the stretch along the side of your body."
    ]
  },
  {
    "id": 56,
    "name": "Frog Pose",
    "cues": [
      "Start in a tabletop position and widen your knees as far as is comfortable, keeping your feet pointing outwards.",
      "Lower your hips toward the floor, keeping your shoulders stacked over your wrists.",
      "Engage your inner thighs and press your hips down, opening your hips and groin.",
      "Keep your spine neutral and avoid collapsing your chest.",
      "Hold the pose, breathing deeply, and focus on relaxing your hips and groin."
    ]
  },
  {
    "id": 57,
    "name": "Lizard Pose",
    "cues": [
      "Begin in a tabletop position, then step your right foot forward between your hands.",
      "Lower your hips toward the floor, and place your elbows on the floor for a deeper stretch in your hips.",
      "Keep your back leg extended and your back foot active, pressing the top of your foot into the floor.",
      "Hold the pose, breathing deeply, and focus on relaxing your hips while maintaining stability."
    ]
  },
  {
    "id": 58,
    "name": "Fallen Triangle",
    "cues": [
      "Start in a Downward-Facing Dog position.",
      "Lift your right leg and rotate your torso to face the floor, bringing your right foot towards the ground in a modified triangle shape.",
      "Extend your left arm toward the ceiling, opening your chest while keeping your body in a straight line.",
      "Hold the pose, breathing deeply, and maintain openness in your chest and shoulders."
    ]
  },
  {
    "id": 59,
    "name": "Bird of Paradise",
    "cues": [
      "Start in a standing position and bring your right knee toward your chest.",
      "Place your left hand on the floor or a block, and extend your right leg out to the side.",
      "On an inhale, begin to straighten your right leg while reaching your right arm forward and up, keeping your chest open.",
      "Balance in the pose, breathing deeply, and focus on engaging your core and leg muscles."
    ]
  },
  {
    "id": 60,
    "name": "Extended Hand-to-Big-Toe Pose",
    "cues": [
      "Start standing with your legs extended and feet hip-width apart.",
      "Shift your weight onto your left leg, and extend your right leg forward, holding your right big toe with your right hand.",
      "Lengthen your spine and keep your left knee straight, lifting your chest as you hinge forward from the hips.",
      "Focus on keeping your right leg straight and your body in alignment.",
      "Hold the pose, breathing deeply, and feel the stretch in your hamstring and calf."
    ]
  },
  {
    "id": 61,
    "name": "Standing Forward Fold",
    "cues": [
      "Stand with your feet hip-width apart and hinge at your hips to fold forward.",
      "Keep a slight bend in your knees to protect your lower back, and let your head hang heavy.",
      "You can hold onto opposite elbows or let your hands rest on the floor or blocks.",
      "Focus on lengthening your spine, reaching the crown of your head toward the floor.",
      "Breathe deeply, allowing your upper body to release toward your legs with each exhale."
    ]
  },
  {
    "id": 62,
    "name": "Halfway Lift",
    "cues": [
      "From a forward fold, inhale and lift your torso halfway up, keeping your spine long.",
      "Place your hands on your shins or thighs (avoiding the knees) and keep your back flat.",
      "Lengthen your neck and draw your shoulder blades down your back.",
      "Engage your core and legs to maintain balance, and keep your gaze forward.",
      "Hold the pose for a breath or two, then fold forward again."
    ]
  },
  {
    "id": 63,
    "name": "Ragdoll Pose",
    "cues": [
      "From a standing position, bend your knees and fold forward, letting your torso hang toward your thighs.",
      "Hold onto opposite elbows and allow your body to sway gently from side to side.",
      "Relax your neck, letting your head hang heavy, and soften your face.",
      "Breathe deeply and allow your spine to release, creating space in your back and neck."
    ]
  },
  {
    "id": 64,
    "name": "Eight-Angle Pose",
    "cues": [
      "Start seated with your legs extended and bend your knees, placing your feet flat on the floor.",
      "Place your hands on the floor behind you, fingers pointing back, and engage your core.",
      "Twist your torso to the right and place your left arm around your right shin.",
      "Lift your feet off the ground and extend your legs out to the side, balancing on your hands.",
      "Focus on engaging your core to maintain balance, and keep your spine long."
    ]
  },
  {
    "id": 65,
    "name": "Bound Side Angle",
    "cues": [
      "From Warrior II, bring your left hand behind your back and bind it around your right thigh or wrist.",
      "Bend your right knee and lower your body into the side angle, with your left leg straight and grounded.",
      "Open your chest, keeping your heart lifted, and gaze upward or forward.",
      "Use the bind to deepen the stretch in your chest and shoulders, and engage your core for stability.",
      "Hold the pose, breathing deeply, and maintain length in your spine."
    ]
  },
  {
    "id": 66,
    "name": "Bound Forward Fold",
    "cues": [
      "Start in a standing position with your feet hip-width apart.",
      "Bend your knees and fold forward, reaching your hands behind your back and clasping your hands together.",
      "If possible, press your palms together and let your arms extend overhead or toward the floor.",
      "Keep your legs engaged, and let your torso release toward your legs.",
      "Hold the pose, breathing deeply, and feel the stretch in your shoulders and hamstrings."
    ]
  },
  {
    "id": 67,
    "name": "Half Splits",
    "cues": [
      "Begin in a kneeling position and step your right foot forward, keeping your left knee on the ground.",
      "Extend your right leg straight, flexing your right foot and lengthening your spine.",
      "Fold forward over your right leg, keeping your back straight and your chest open.",
      "Engage your core and keep your hips squared as you deepen the stretch in your hamstrings.",
      "Hold the pose, breathing deeply, and focus on lengthening your spine."
    ]
  },
  {
    "id": 68,
    "name": "Full Splits",
    "cues": [
      "Start in a lunge position with your right leg forward and left leg extended behind you.",
      "Gradually slide your right foot forward and your left foot back, lowering your hips toward the floor.",
      "Keep your hips square and your torso lifted, maintaining a long spine.",
      "Engage your core to protect your lower back, and keep your back leg active.",
      "Hold the pose, breathing deeply, and focus on relaxing your hips and legs."
    ]
  },
  {
    "id": 69,
    "name": "King Pigeon Pose",
    "cues": [
      "Begin in Pigeon Pose, with your right leg bent in front of you and your left leg extended behind you.",
      "Bend your left knee and bring your left foot toward your glutes, holding your left ankle with your left hand.",
      "Open your chest and keep your spine long as you reach your right arm overhead.",
      "If comfortable, bring your right hand to your left foot and extend the stretch in your chest and shoulders.",
      "Hold the pose, breathing deeply, and focus on releasing tension in your hips and upper body."
    ]
  },
  {
    "id": 70,
    "name": "Lotus Pose",
    "cues": [
      "Sit on the floor with your legs extended in front of you.",
      "Bend your knees and place each foot on the opposite thigh, bringing your feet as close to your hips as possible.",
      "Sit tall, lengthening your spine and keeping your chest open.",
      "Relax your hands on your knees, palms facing up, and focus on steadying your breath.",
      "Hold the pose, breathing deeply, and focus on cultivating stillness and inner peace."
    ]
  },
  {
    "id": 71,
    "name": "Elevated Lotus Pose",
    "cues": [
      "Begin in Lotus Pose, with each foot placed on the opposite thigh.",
      "Place your hands firmly on the floor beside your hips, fingers pointing forward.",
      "Engage your core and press firmly into your palms as you lift your body off the ground.",
      "Keep your shoulders down and away from your ears while maintaining a steady breath.",
      "Hold the pose, focusing on balance and strength, and gently lower yourself back down when ready."
    ]
  },
  {
    "id": 72,
    "name": "Cow Face Pose",
    "cues": [
      "Sit with your legs extended in front of you, then bend your knees and stack your right knee on top of your left.",
      "Bring your feet as close to your hips as possible, keeping your knees stacked.",
      "Extend your right arm overhead and bend your elbow, reaching your right hand down your back.",
      "Bring your left arm behind you to clasp your right hand or use a strap between your hands.",
      "Hold the pose, breathing deeply, and feel the stretch in your shoulders, hips, and thighs."
    ]
  },
  {
    "id": 73,
    "name": "Seated Spinal Twist",
    "cues": [
      "Sit with your legs extended in front of you, then bend your right knee and place your right foot outside your left thigh.",
      "Place your left elbow outside your right knee and twist your torso to the right.",
      "Inhale to lengthen your spine, and exhale to deepen the twist.",
      "Keep your chest open and avoid collapsing your shoulders.",
      "Hold the pose, breathing deeply, and focus on releasing tension in your spine."
    ]
  },
  {
    "id": 74,
    "name": "Hero Pose",
    "cues": [
      "Sit with your knees bent and feet together, with your thighs parallel and your shins resting on the floor.",
      "If necessary, sit on a block or cushion to elevate your hips.",
      "Sit tall, lengthening your spine and relaxing your shoulders down your back.",
      "Focus on grounding your legs and maintaining a straight posture.",
      "Hold the pose, breathing deeply, and feel a stretch in your thighs and hips."
    ]
  },
  {
    "id": 75,
    "name": "Revolved Triangle",
    "cues": [
      "Start in a standing position, and step your feet wide apart.",
      "Turn your right foot forward and your left foot slightly in, keeping your legs straight.",
      "Reach your right hand to the floor or a block, and extend your left arm toward the ceiling.",
      "Twist your torso toward your right leg, keeping your hips square and your spine long.",
      "Hold the pose, breathing deeply, and focus on lengthening your spine with each inhale."
    ]
  },
  {
    "id": 76,
    "name": "Revolved Side Angle",
    "cues": [
      "From Warrior II, bring your left hand to your right thigh and place your right arm overhead.",
      "As you twist your torso to the right, keep your legs strong and your hips squared.",
      "Open your chest to face the ceiling and extend through the fingertips.",
      "Engage your core and maintain a steady, deep breath as you hold the twist.",
      "Focus on lengthening your spine and deepening the twist with each exhale."
    ]
  },
  {
    "id": 77,
    "name": "Shoulder Pressing Pose",
    "cues": [
      "Start in a seated position, with your legs extended in front of you.",
      "Bend your knees and place your feet flat on the floor.",
      "Place your palms on the floor behind you, with your fingers pointing forward.",
      "Press your hands into the floor and lift your hips toward the ceiling, engaging your core and legs.",
      "Hold the pose, breathing deeply, and focus on engaging your shoulder muscles."
    ]
  },
  {
    "id": 78,
    "name": "Flying Pigeon Pose",
    "cues": [
      "Start in a standing position and bring your right knee toward your chest.",
      "Place your right ankle on your left upper arm and extend your left leg behind you.",
      "Hinge at your hips to fold forward and extend your arms forward.",
      "Balance on your arms, keeping your core engaged and your gaze steady.",
      "Hold the pose, breathing deeply, and focus on maintaining stability and control."
    ]
  },
  {
    "id": 79,
    "name": "Firefly Pose",
    "cues": [
      "Start in a seated position with your legs extended in front of you.",
      "Bend your knees and bring your feet to the floor, keeping your feet wide apart.",
      "Place your hands behind your legs, gripping the backs of your thighs or calves.",
      "Straighten your legs and lift them off the floor, balancing on your hands.",
      "Hold the pose, breathing deeply, and engage your core to maintain balance."
    ]
  },
  {
    "id": 80,
    "name": "Monkey Pose",
    "cues": [
      "Begin in a seated position with one leg extended forward and the other leg bent with your foot near your hip.",
      "Straighten the extended leg and fold forward, reaching toward the toes.",
      "Engage your core to keep your spine long as you deepen the stretch in your hamstrings.",
      "Relax your neck and jaw, and breathe deeply as you hold the stretch."
    ]
  },
  {
    "id": 81,
    "name": "Ganda Bherundasana",
    "cues": [
      "Start in a kneeling position, then place your hands on the floor in front of you.",
      "Lift your hips and bring your feet over your head, coming into a chin stand.",
      "Press firmly through your forearms and chin to balance, keeping your legs straight and active.",
      "Engage your core to support your body, and keep your gaze steady.",
      "Breathe deeply, focusing on maintaining stability as you hold the pose."
    ]
  },
  {
    "id": 82,
    "name": "Scorpion Pose",
    "cues": [
      "Start in a forearm stand or a supported handstand position.",
      "Bend your knees and bring your feet toward your head, creating a scorpion shape with your body.",
      "Extend your legs as much as your flexibility allows, keeping your core engaged for stability.",
      "Press firmly into the forearms and maintain a long spine, focusing on balance.",
      "Hold the pose, breathing steadily and maintaining control."
    ]
  },
  {
    "id": 83,
    "name": "Half Moon Bound Pose",
    "cues": [
      "Start in a standing position with your feet hip-width apart.",
      "Bend forward into a half moon pose, reaching one arm toward the floor while the other arm binds behind your back.",
      "Twist your torso to open your chest, and engage your core to maintain balance.",
      "Keep your legs active and your spine long as you deepen the stretch.",
      "Hold the pose, breathing deeply, and focus on maintaining length through your torso."
    ]
  },
  {
    "id": 84,
    "name": "Hummingbird Pose",
    "cues": [
      "Start in a seated position with your legs extended in front of you.",
      "Bend your knees and place your feet on the floor.",
      "Place your hands behind your thighs and lean forward slightly.",
      "Lift your feet off the ground, balancing on your hands while keeping your core engaged.",
      "Focus on maintaining balance, and hold the pose with steady breaths."
    ]
  },
  {
    "id": 85,
    "name": "Peacock Pose",
    "cues": [
      "Begin by kneeling and placing your hands on the floor in front of you.",
      "Bend your elbows and bring your knees to your upper arms, creating a balance between your arms and legs.",
      "Press down through your hands and lift your feet off the floor, bringing your legs together.",
      "Engage your core and keep your spine long as you hold the pose.",
      "Focus on steadying your breath and maintaining balance."
    ]
  },
  {
    "id": 86,
    "name": "Compass Pose",
    "cues": [
      "Start seated with your legs extended in front of you.",
      "Bend your right knee and bring your right foot toward your chest.",
      "Hold your right foot with both hands, then extend your left leg straight.",
      "Slowly rotate your torso to the right, extending your right leg to the side while keeping your spine long.",
      "Keep your gaze focused forward, breathing deeply as you hold the pose."
    ]
  },
  {
    "id": 87,
    "name": "Sleeping Vishnu",
    "cues": [
      "Lie on your back with your arms by your sides and legs extended.",
      "Bend your right knee and place your right foot on the floor next to your hip.",
      "Cross your left leg over your right, with your left foot resting on the floor.",
      "Extend your arms overhead or in a comfortable position and relax into the stretch.",
      "Breathe deeply, allowing your body to release tension as you hold the pose."
    ]
  },
  {
    "id": 88,
    "name": "Dragonfly Pose",
    "cues": [
      "Start seated with your legs wide apart, feet flexed.",
      "Slowly fold forward, reaching your arms toward the floor or your feet.",
      "Engage your legs and keep your chest open as you lengthen your spine.",
      "If possible, bring your head to the floor while maintaining a long back.",
      "Breathe deeply, focusing on lengthening your spine and deepening the stretch."
    ]
  },
  {
    "id": 89,
    "name": "Grasshopper Pose",
    "cues": [
      "Begin in a seated position and bend your knees to bring your feet off the floor.",
      "Place your hands on the floor and engage your core to lift your body into the air.",
      "Extend your legs to the side, keeping them straight and active.",
      "Focus on balancing on your hands, maintaining a steady gaze.",
      "Hold the pose, breathing steadily and maintaining control."
    ]
  },
  {
    "id": 90,
    "name": "Baby Grasshopper",
    "cues": [
      "Start in a low squat, with your knees bent and feet flat on the floor.",
      "Place your hands on the floor and press down through your palms.",
      "Lift your hips and bring your knees toward your chest, balancing on your hands.",
      "Extend your legs to the side, keeping them straight and engaged.",
      "Focus on maintaining balance and breathing deeply."
    ]
  },
  {
    "id": 91,
    "name": "Caterpillar Pose",
    "cues": [
      "Sit with your legs extended in front of you, keeping your feet flexed.",
      "Inhale to lengthen your spine, and exhale to fold forward over your legs.",
      "Keep your arms extended toward your feet, and relax your neck and face.",
      "Allow your chest to soften toward your thighs as you deepen the stretch.",
      "Breathe deeply, allowing your body to release into the pose."
    ]
  },
  {
    "id": 92,
    "name": "Revolved Chair Pose",
    "cues": [
      "Begin in Chair Pose with your feet together and your knees bent.",
      "Bring your palms together in front of your chest and twist your torso to the right.",
      "Place your left elbow outside your right knee and engage your core.",
      "Keep your chest open and your gaze forward or upward.",
      "Hold the pose, breathing deeply, and focus on deepening the twist with each exhale."
    ]
  },
  {
    "id": 93,
    "name": "Side Stretch Pose",
    "cues": [
      "Start in a standing position with your feet hip-width apart.",
      "Lift your arms overhead and interlace your fingers.",
      "Lean to the right, stretching the left side of your body.",
      "Keep your feet grounded and engage your core for stability.",
      "Hold the stretch for a few breaths, then switch sides."
    ]
  },
  {
    "id": 94,
    "name": "Hero Pose with Recline",
    "cues": [
      "Begin in Hero Pose, sitting on your shins with your knees together.",
      "Slowly lower your torso back onto the floor, supporting yourself with your hands.",
      "Keep your thighs grounded and allow your body to rest as much as you can.",
      "Relax your arms by your sides and allow your chest to open.",
      "Breathe deeply, allowing your body to soften into the pose."
    ]
  },
  {
    "id": 95,
    "name": "Intense Side Stretch",
    "cues": [
      "Start in a standing position with your feet wide apart.",
      "Extend your arms overhead and then lean to one side, reaching for your foot with your hand.",
      "Keep your torso open and lengthen your spine as you stretch.",
      "Engage your core to maintain balance and stability.",
      "Breathe deeply, holding the stretch, then repeat on the other side."
    ]
  },
  {
    "id": 96,
    "name": "Revolved Crescent Lunge",
    "cues": [
      "Start in a low lunge with your right foot forward and your left knee on the floor.",
      "Place your left hand on the floor or a block and twist your torso to the right.",
      "Extend your right arm toward the ceiling, keeping your chest open.",
      "Engage your core to maintain stability and balance.",
      "Hold the pose, breathing deeply and focusing on deepening the twist."
    ]
  },
  {
    "id": 97,
    "name": "Tortoise Pose",
    "cues": [
      "Start seated with your legs extended in front of you.",
      "Bend your knees and bring your feet toward your hips.",
      "Fold forward, placing your hands under your feet and your forehead toward the floor.",
      "Relax your head and neck, and allow your body to soften into the stretch.",
      "Breathe deeply, focusing on releasing tension in your back and shoulders."
    ]
  },
  {
    "id": 98,
    "name": "One-Legged Bridge Pose",
    "cues": [
      "Begin on your back with your knees bent and feet flat on the floor.",
      "Lift your hips toward the ceiling, keeping your feet and shoulders grounded.",
      "For a variation, lift one leg while keeping the other leg grounded.",
      "Engage your core and squeeze your glutes as you hold the pose.",
      "Breathe deeply, focusing on maintaining stability and length in your spine."
    ]
  },
  {
    "id": 99,
    "name": "Wheel Pose Variation",
    "cues": [
      "Lie on your back with your knees bent and feet flat on the floor.",
      "Place your hands by your ears, with your fingers pointing toward your shoulders.",
      "Press into your hands and feet to lift your body into a backbend.",
      "For a variation, lift one leg off the floor while keeping your hips lifted.",
      "Hold the pose, breathing deeply, and focus on maintaining an open chest."
    ]
  },
  {
    "id": 100,
    "name": "Standing Bow Pose",
    "cues": [
      "Start in a standing position with your feet together and arms by your sides.",
      "Bend one knee and grab your ankle with the same-side hand.",
      "Extend the opposite arm forward as you lean forward, balancing on one leg.",
      "Engage your core and keep your chest open, focusing on balance.",
      "Hold the pose, breathing deeply, and slowly return to standing."
    ]
  }
]