[
  {
    "id": 1,
    "name": "Downward Dog",
    "cues": [
      "Start on all fours with your wrists directly under your shoulders and your knees under your hips. Spread your fingers wide and press firmly into the mat.",
      "On an inhale, tuck your toes and lift your hips towards the ceiling, aiming to form an inverted 'V' shape with your body.",
      "As you exhale, press your heels towards the floor, but don't worry if they don’t touch the mat. Keep your spine long and draw your chest toward your thighs.",
      "Inhale and ensure that your neck is relaxed, with your head between your arms. Your gaze should be directed toward your navel or your thighs.",
      "Exhale and engage your core to maintain stability, keeping your body active throughout the entire pose.",
      "Breathe deeply and evenly in and out through the nose for 5 to 10 breaths, focusing on elongating your spine and deepening the stretch in your hamstrings."
    ]
  },
  {
    "id": 2,
    "name": "Tree Pose",
    "cues": [
      "Begin standing tall in Mountain Pose, with your feet together and your arms at your sides.",
      "On an inhale, slowly shift your weight into your left foot and raise your right foot off the ground, bringing the sole of your foot to your inner left thigh, calf, or ankle (avoid placing it directly on your knee).",
      "Exhale and bring your hands into a prayer position at your heart center or extend them overhead, palms facing each other, to increase the challenge.",
      "Keep your gaze steady and focused on a point ahead to help maintain balance.",
      "Inhale and lengthen your spine, lifting through the crown of your head. Engage your core to stabilize.",
      "Exhale and relax your shoulders, making sure that your standing leg is straight and engaged.",
      "Continue to breathe deeply and steadily in and out through your nose, holding the pose for 5 to 10 breaths before switching sides."
    ]
  },
  {
    "id": 3,
    "name": "Warrior I",
    "cues": [
      "Start in a standing position and step your feet about 3 to 4 feet apart, keeping your feet parallel to each other.",
      "On an inhale, turn your right foot out 90 degrees and bend your right knee so that your thigh is parallel to the floor, ensuring that your knee is directly over your ankle.",
      "As you exhale, press the back foot firmly into the mat, with the left leg straight and active. Keep your hips facing forward, square your shoulders to the front of the mat.",
      "Inhale and lift your arms overhead, palms facing each other or open to the sides. Reach through the fingertips, elongating your torso.",
      "Exhale and draw your navel towards your spine to engage your core and maintain balance.",
      "Breathe steadily in and out through your nose, holding the pose for 5 to 10 breaths before switching sides."
    ]
  },
  {
    "id": 4,
    "name": "Warrior II",
    "cues": [
      "From Warrior I, exhale and open your hips and shoulders to face the long edge of the mat, turning your back foot out slightly and keeping it rooted into the ground.",
      "Inhale and extend your arms out to the sides, keeping them parallel to the floor, with your palms facing down.",
      "Exhale and bend your front knee deeply, ensuring the knee is directly over the ankle. Keep your back leg straight and strong.",
      "Engage your core and lift through the chest, while keeping your shoulders relaxed and your gaze forward over your front hand.",
      "Breathe deeply and consistently in and out through your nose, focusing on deepening the stretch and building strength in your legs.",
      "Hold the pose for 5 to 10 breaths before switching sides."
    ]
  },
  {
    "id": 5,
    "name": "Child's Pose",
    "cues": [
      "Begin in a kneeling position with your big toes touching and knees spread apart, wider than hip-width, if needed for more comfort.",
      "On an inhale, lengthen your spine and reach your arms forward on the mat.",
      "As you exhale, slowly lower your torso towards the mat, resting your forehead on the ground or a block. Extend your arms fully or bring them alongside your body with palms facing up.",
      "Inhale and gently press your hips back toward your heels, creating length in the spine.",
      "Exhale and relax your chest and shoulders, allowing them to soften into the mat.",
      "Breathe deeply and evenly, allowing your body to relax further with each exhalation, staying in the pose for 5 to 10 breaths."
    ]
  },
  {
    "id": 6,
    "name": "Cobra Pose",
    "cues": [
      "Begin by lying face down with your legs extended behind you, tops of your feet pressing into the mat. Place your hands under your shoulders with your elbows bent and close to your body.",
      "On an inhale, press into your hands and slowly lift your chest off the ground, keeping your elbows bent and hugging them towards your ribs.",
      "Exhale and lengthen your spine as you reach the crown of your head toward the ceiling. Engage your legs and press the tops of your feet into the mat for stability.",
      "Inhale and lift your chest a little higher, if comfortable, without over-arching your back.",
      "Exhale and release any tension in your shoulders, keeping your elbows slightly bent to avoid straining your arms.",
      "Breathe deeply in and out through your nose, holding for 5 to 10 breaths, and then gently lower your chest back to the mat."
    ]
  },
  {
    "id": 7,
    "name": "Bridge Pose",
    "cues": [
      "Begin lying on your back with your knees bent and feet flat on the floor, hip-width apart, and your arms by your sides.",
      "On an inhale, press your feet into the mat and lift your hips towards the ceiling, creating a straight line from your knees to your shoulders.",
      "Exhale and engage your glutes and core to lift your pelvis higher, ensuring your knees are aligned with your hips and not splaying outward.",
      "Inhale and lengthen your spine, lifting your chest slightly towards your chin, and press your arms into the floor for added stability.",
      "Exhale and relax your face, jaw, and neck, avoiding any tension in your upper body.",
      "Continue to breathe deeply and steadily in and out through your nose, holding the pose for 5 to 10 breaths before lowering your hips back to the mat."
    ]
  },
  {
    "id": 8,
    "name": "Triangle Pose",
    "cues": [
      "Start standing with your feet about 3 to 4 feet apart, arms extended out to the sides.",
      "On an inhale, lengthen your spine and reach both arms wide.",
      "Exhale and extend your torso over your right leg, bringing your right hand toward your shin, ankle, or a block. Keep your left arm reaching toward the ceiling, with your gaze toward your left hand.",
      "Inhale and keep your chest open, creating a long line from your left hand to your right foot.",
      "Exhale and engage your legs, rooting down into your feet to deepen the stretch and keep your balance.",
      "Breathe deeply in and out through your nose, holding the pose for 5 to 10 breaths before switching sides."
    ]
  },
  {
    "id": 9,
    "name": "Seated Forward Bend",
    "cues": [
      "Begin seated with your legs extended straight in front of you and your feet flexed.",
      "Inhale and lengthen your spine, reaching through the crown of your head.",
      "As you exhale, slowly hinge forward from your hips, keeping your spine long and your chest open.",
      "Inhale and elongate your spine further, drawing your torso toward your thighs.",
      "Exhale and gently fold deeper, reaching for your feet or shins, while relaxing your neck and jaw.",
      "Breathe deeply and steadily in and out through your nose, staying in the pose for 5 to 10 breaths."
    ]
  },
  {
    "id": 10,
    "name": "Mountain Pose",
    "cues": [
      "Stand tall with your feet together and arms at your sides. Ground down through your feet, feeling the connection to the earth.",
      "On an inhale, lift your chest and lengthen your spine, reaching through the crown of your head.",
      "Exhale and relax your shoulders away from your ears, keeping your arms relaxed but engaged.",
      "Inhale and firm your thighs, lifting your kneecaps without locking your knees.",
      "Exhale and engage your core, pulling your belly button toward your spine.",
      "Breathe deeply in and out through your nose, grounding yourself and cultivating focus and stability for 5 to 10 breaths."
    ]
  },
  {
    "id": 11,
    "name": "Chair Pose",
    "cues": [
      "Start standing in Mountain Pose with your feet together and arms at your sides.",
      "On an inhale, reach your arms overhead, palms facing each other or arms parallel.",
      "As you exhale, bend your knees and lower your hips as if sitting back into an imaginary chair, keeping your knees aligned with your ankles.",
      "Inhale and draw your belly button in, engaging your core to support your spine.",
      "Exhale and relax your shoulders, avoiding tension in your neck.",
      "Inhale and lengthen your spine, lifting through the crown of your head.",
      "Exhale and ensure your weight is balanced in your heels, not your toes.",
      "Breathe deeply and steadily, keeping your chest open and your knees from collapsing inward. Hold the pose for 5 to 10 breaths before standing up."
    ]
  },
  {
    "id": 12,
    "name": "Camel Pose",
    "cues": [
      "Begin in a kneeling position with your knees hip-width apart and your thighs parallel to each other.",
      "On an inhale, press your hips forward and lift your chest toward the ceiling, gently arching your back.",
      "As you exhale, reach your hands back to your heels or place them on your lower back for support, depending on flexibility.",
      "Inhale and lengthen your spine, keeping your pelvis tucked slightly forward for stability.",
      "Exhale and soften your shoulders away from your ears, deepening the backbend without straining your lower back.",
      "Breathe steadily and deeply in and out through your nose, holding the pose for 5 to 10 breaths.",
      "To exit, slowly come back up by engaging your core and lifting your torso up while keeping your hands on your lower back for support."
    ]
  },
  {
    "id": 13,
    "name": "Boat Pose",
    "cues": [
      "Begin seated with your knees bent and feet flat on the mat, hip-width apart.",
      "On an inhale, lift your feet off the mat, bringing your shins parallel to the floor.",
      "Exhale and lean back slightly, keeping your spine straight. Engage your core, lifting your chest toward your thighs.",
      "Inhale and straighten your legs if possible, keeping them parallel to the floor. Reach your arms forward, parallel to the ground.",
      "Exhale and keep your core engaged, ensuring your back is not rounded and your chest remains open.",
      "Breathe deeply in and out through your nose, holding the pose for 5 to 10 breaths. To challenge yourself, you can extend your arms overhead or try straightening both legs."
    ]
  },
  {
    "id": 14,
    "name": "Plank Pose",
    "cues": [
      "Start in a push-up position with your hands directly under your shoulders and your feet hip-width apart.",
      "On an inhale, engage your core and lift your body into a straight line from head to heels.",
      "Exhale and press your heels toward the back of the room, keeping your legs straight and your thighs engaged.",
      "Inhale and make sure your shoulders are away from your ears, with your elbows slightly bent to avoid locking them.",
      "Exhale and draw your navel towards your spine, keeping your core engaged to prevent your lower back from sinking.",
      "Breathe steadily in and out through your nose, holding the pose for 5 to 10 breaths, ensuring your body stays in one straight line without sagging in the middle."
    ]
  },
  {
    "id": 15,
    "name": "Bow Pose",
    "cues": [
      "Begin lying on your stomach with your arms by your sides and your legs extended.",
      "On an inhale, bend your knees and reach your arms back to grasp your ankles, or place your hands on the tops of your feet.",
      "Exhale and gently lift your chest and legs off the ground, using your arms to pull your feet towards your body.",
      "Inhale and press your feet into your hands to lift your chest higher, creating a deep backbend.",
      "Exhale and engage your legs, keeping them active and reaching your chest further forward without collapsing your lower back.",
      "Breathe deeply and steadily in and out through your nose, holding the pose for 5 to 10 breaths before gently releasing back to the mat."
    ]
  },
  {
    "id": 16,
    "name": "Crow Pose",
    "cues": [
      "Start in a squat position with your feet slightly apart and your hands on the mat in front of you.",
      "On an inhale, bend your elbows slightly and lift your hips toward the ceiling, bringing your knees towards your upper arms.",
      "Exhale and carefully shift your weight forward, lifting one foot off the ground, then the other, finding your balance.",
      "Inhale and engage your core to maintain stability while keeping your gaze forward and your body steady.",
      "Exhale and keep your arms strong, supporting the weight of your body with your hands.",
      "Breathe deeply in and out through your nose, holding the pose for 3 to 5 breaths before gently lowering back down."
    ]
  },
  {
    "id": 17,
    "name": "Happy Baby",
    "cues": [
      "Begin lying on your back with your knees bent and your feet flat on the mat.",
      "On an inhale, bring your knees toward your chest and grab the outsides of your feet with your hands.",
      "Exhale and gently pull your knees toward the floor, keeping your ankles directly over your knees.",
      "Inhale and keep your feet flexed while pressing your lower back into the mat for added stretch.",
      "Exhale and relax your head, neck, and shoulders, ensuring they stay grounded on the mat.",
      "Breathe deeply and steadily in and out through your nose, holding the pose for 5 to 10 breaths, gently rocking from side to side if desired."
    ]
  },
  {
    "id": 18,
    "name": "Butterfly Pose",
    "cues": [
      "Begin seated with your legs extended straight in front of you.",
      "On an inhale, bend your knees and bring the soles of your feet together, letting your knees fall open to the sides.",
      "Exhale and gently lower your torso towards your feet, keeping your spine long and your chest open.",
      "Inhale and lengthen your spine, drawing your torso closer to your feet.",
      "Exhale and relax into the stretch, allowing your knees to soften toward the floor.",
      "Breathe deeply and steadily in and out through your nose, holding the pose for 5 to 10 breaths, letting the hips and groin release tension."
    ]
  },
  {
    "id": 19,
    "name": "Headstand",
    "cues": [
      "Begin on your hands and knees, then interlace your fingers and place your forearms on the mat, creating a tripod shape with your head and hands.",
      "On an inhale, place the crown of your head gently on the mat and lift your knees off the floor, walking your feet closer to your body.",
      "Exhale and slowly begin to raise your legs, keeping your core engaged for support.",
      "Inhale and lift your legs into the air, stacking your hips over your shoulders. Engage your legs and keep them straight.",
      "Exhale and ensure your body is stable, maintaining a straight line from head to feet.",
      "Breathe deeply and steadily in and out through your nose, holding the pose for 3 to 5 breaths, then carefully lower your legs back down."
    ]
  },
  {
    "id": 20,
    "name": "Reclined Twist",
    "cues": [
      "Begin lying on your back with your knees bent and your feet flat on the floor, hip-width apart.",
      "On an inhale, reach your arms out to the sides in a T-shape, palms facing down.",
      "Exhale and slowly lower your knees to one side, keeping both shoulders on the floor.",
      "Inhale and lengthen your spine, while gently twisting through your torso.",
      "Exhale and deepen the twist, keeping your gaze towards the opposite hand or up toward the ceiling.",
      "Breathe deeply and steadily in and out through your nose, holding the pose for 5 to 10 breaths before switching sides."
    ]
  }
]

