[  
  {
    "id": 1,
    "name": "Mountain Pose",
    "desc": "Mountain Pose, or Tāḍāsana, is a foundational standing posture in yoga that emphasizes strength, stability, and alignment. In this pose, you stand tall with your feet together, grounding through the soles while lengthening your spine and reaching upward through the crown of your head."
  },
  {
    "id": 2,
    "name": "Downward-Facing Dog",
    "desc": "Downward Dog, or Adho Mukha Svanasana, is a foundational yoga pose that promotes strength, flexibility, and balance. In this pose, your body forms an inverted 'V' shape, with hands and feet firmly grounded, hips lifted high, and the spine elongated."
  },
  {
    "id": 3,
    "name": "Plank Pose",
    "desc": "Plank Pose, or Phalakasana, is a fundamental yoga posture that focuses on building strength and stability. The pose involves holding a position similar to a push-up, with the body in a straight line from head to heels. Plank Pose is commonly used in both beginner and advanced yoga practices as a building block for more complex poses."
  },
  {
    "id": 4,
    "name": "Four-Limbed Staff Pose",
    "desc": "Four-Limbed Staff Pose, or Chaturanga Dandasana, is a foundational yoga pose that builds strength, stability, and focus. In this pose, the body is held parallel to the floor, supported by the hands and toes, with the elbows bent at a 90-degree angle and tucked close to the sides."
  },
  {
    "id": 5,
    "name": "Upward-Facing Dog",
    "desc": "Upward-Facing Dog, or Urdhva Mukha Svanasana in Sanskrit, is a foundational backbend and heart-opening pose.  To perform the pose, the body is supported by the hands and the tops of the feet, with the thighs and pelvis lifted off the ground. The heart is drawn forward, and the shoulders are rolled back, creating an expansive and open posture."
  },
  {
    "id": 6,
    "name": "Child's Pose",
    "desc": "Child’s Pose, or Balasana in Sanskrit, is a restorative yoga pose that offers a deep sense of relaxation.  To perform Child’s Pose, you start by kneeling on the mat, then fold your torso forward, bringing your forehead to the ground while extending your arms out in front or resting them alongside your body. "
  },
  {
    "id": 7,
    "name": "Warrior I",
    "desc": "Warrior I Pose, or Virabhadrasana I, is a foundational yoga posture symbolizing strength and focus. It involves stepping one leg forward into a lunge, with the back foot angled outward and arms extended overhead."
  },
  {
    "id": 8,
    "name": "Warrior II",
    "desc": "Warrior II Pose, or Virabhadrasana II, is a powerful standing yoga posture that enhances strength and stability. In this pose, the practitioner steps into a wide stance, with the front knee bent at a 90-degree angle and the back leg straight. The hips and shoulders are aligned to face the side, with the arms extended parallel to the floor, palms facing down."
  },
  {
    "id": 9,
    "name": "Warrior III",
    "desc": "Warrior III Pose, or Virabhadrasana III, is a standing balance posture that builds strength, stability, and concentration. To achieve this pose, begin by grounding one leg firmly into the mat while extending the opposite leg straight behind. The body is hinged at the hips, with the torso parallel to the floor and the arms extended forward, creating a straight line from fingertips to toes."
  },
  {
    "id": 10,
    "name": "Reverse Warrior",
    "desc": "Reverse Warrior Pose, or Viparita Virabhadrasana, is a variation of the traditional Warrior pose.  In this pose, one leg is bent deeply, with the front knee aligned over the ankle, while the back leg remains straight and strong. The arms are extended, with one reaching down toward the front leg and the other stretching overhead, creating a deep lateral stretch through the torso and hips. "
  },
  {
    "id": 11,
    "name": "Extended Side Angle",
    "desc": "Extended Side Angle Pose or Utthita Parsvakonasana is a dynamic standing yoga posture that stretches and strengthens the body. In this pose, one leg is bent at a right angle, while the other leg remains straight, grounding through the foot. One arm extends down to rest on the floor or a block next to the front foot, while the other arm stretches overhead, reaching in line with the body."
  },
  {
    "id": 12,
    "name": "Triangle Pose",
    "desc": "Triangle Pose or Trikonasana is a standing posture that emphasizes balance, flexibility, and strength. In this pose, the body forms a triangle shape as the legs are spread wide, and one arm reaches towards the floor while the other extends upward, creating a line of energy from the feet to the fingertips."
  },
  {
    "id": 13,
    "name": "Half Moon Pose",
    "desc": "Half Moon Pose or Ardha Chandrasana is a standing balance posture that combines strength and focus. In this pose, the practitioner balances on one leg while the opposite leg extends straight back and parallel to the ground, creating a crescent moon shape with the body. The torso opens to the side, with one hand reaching toward the ground for support and the other arm extended skyward, forming a long line from the fingertips to the lifted foot."
  },
  {
    "id": 14,
    "name": "Chair Pose",
    "desc": "Chair Pose or Utkatasana is a standing posture that engages the entire body white strengthening the legs, core, and upper body. To enter the pose, begin by standing with your feet hip-width apart, then bend your knees as if you are sitting back into an invisible chair, lowering your hips toward the floor while keeping the chest lifted. The arms extend overhead with the palms facing inward, creating a strong line from the fingertips to the hips."
  },
  {
    "id": 15,
    "name": "Goddess Pose",
    "desc": "Goddess Pose or Utkata Konasana is a powerful standing pose. To enter the pose, begin by standing with your feet wide apart, slightly turned outward, and your knees bent deeply as if sitting into an imaginary chair. The legs should be positioned in a wide stance, with the knees aligned over the toes, while the thighs remain parallel to the floor or slightly lower. Your arms are extended outward at shoulder height, with palms facing upward, engaging the shoulders and arms."
  },
  {
    "id": 16,
    "name": "Crescent High Lunge Pose",
    "desc": "High Lunge Pose or Utthita Ashwa Sanchalanasana is a dynamic standing pose that strengthens the legs while opening the hips. To enter the pose, step one foot forward into a deep lunge, keeping the front knee bent at a 90-degree angle while the back leg is extended straight behind you with the heel lifted. The arms can be extended overhead, and the chest remains lifted with a focus on maintaining balance and alignment."
  },
  {
    "id": 17,
    "name": "Low Lunge",
    "desc": "Low Lunge Pose or Anjaneyasana is a deep hip-opening posture. To enter the pose, start in a standing position and step one leg back, lowering the knee to the floor, and keeping the other leg bent at a 90-degree angle. The back leg remains extended, with the knee gently touching the ground and the top of the foot facing down. The arms can be extended overhead, or placed on the hips, with the chest open and the spine elongated. "
  },
  {
    "id": 18,
    "name": "Pyramid Pose",
    "desc": "Pyramid Pose or Parsvottanasana is a standing forward fold that offers a deep stretch to the legs, hips, and spine. To enter the pose, begin with a wide stance, with one foot facing forward and the other foot turned slightly inward. As you fold over your front leg, keep your spine long and your chest open, aiming to bring your torso toward your thigh while keeping the hips squared. The back leg remains straight, with the back heel grounded, and the hands can rest on the floor or behind your back."
  },
  {
    "id": 19,
    "name": "Wide-Legged Forward Fold",
    "desc": "Wide-Legged Forward Fold or Prasarita Padottanasana is a grounding yoga posture that stretches and strengthens the lower body. To enter the pose, you begin by standing with your feet wide apart, then slowly fold forward from the hips, allowing your chest to drop towards the floor. The hands can rest on the floor, a block, or your legs, depending on your flexibility."
  },
  {
    "id": 20,
    "name": "Standing Split",
    "desc": "Standing Split or Uttanasana Variation is a yoga pose that challenges balance and flexibility while deeply stretching the legs and spine. To enter the pose, start in a standing position and shift your weight onto one leg. From there, hinge forward at the hips, extending the other leg upwards toward the sky. The hands may rest on the floor or the standing leg for support."
  },
  {
    "id": 21,
    "name": "Tree Pose",
    "desc": "Tree Pose or Vrksasana is a standing balance yoga posture. In this pose, one leg is rooted firmly to the ground, while the other leg is bent and the foot is placed either on the inner thigh. The arms are typically raised above the head, with palms pressing together in a prayer position."
  },
  {
    "id": 22,
    "name": "Dancer Pose",
    "desc": "Dancer Pose, or Natarajasana in Sanskrit, is a yoga pose that combines balance, strength, and flexibility. To enter the pose, one stands tall on one leg, grounding through the standing foot while the opposite leg is lifted backward, with the hand on the same side reaching to clasp the ankle or foot. The free arm extends forward for balance, creating a dynamic arch through the body."
  },
  {
    "id": 23,
    "name": "Eagle Pose",
    "desc": "Eagle Pose, or Garudasana, is a posture that embodies balance and focus. In this pose, practitioners begin by standing tall and then cross one leg over the other, wrapping it around the standing leg while simultaneously crossing the arms in front of the body, bringing the palms to touch."
  },
  {
    "id": 24,
    "name": "Crow Pose",
    "desc": "Crow Pose, or Kakasana in Sanskrit, is a foundational arm balance that challenges both strength and balance. In this pose, practitioners crouch down, placing their hands on the floor with the fingers spread wide for stability, and then lift their hips while balancing the knees on the upper arms."
  },
  {
    "id": 25,
    "name": "Side Crow Pose",
    "desc": "Side Crow Pose, or Parsva Kakasana in Sanskrit, is an advanced variation of the traditional Crow Pose. In this posture, practitioners balance on their hands while twisting their torso to one side, with one knee resting on the upper arm and the other leg extended behind them. "
  },
  {
    "id": 26,
    "name": "Garland Pose",
    "desc": "Garland Pose, or Malasana, is a deep squat that helps open the hips, stretch the lower back, and strengthen the legs. In this pose, the feet are flat on the ground with the knees bent wide apart, and the palms come together in a prayer position. Garland Pose promotes flexibility in the hips and groins while improving ankle mobility. It also encourages a sense of grounding and stability, making it a great posture for centering the mind and relieving tension in the lower body."
  },
  {
    "id": 27,
    "name": "Feathered Peacock Pose",
    "desc": "Feathered Peacock Pose, or Pincha Mayurasana, is a challenging forearm balance in yoga that combines strength, balance, and flexibility. In this pose, the practitioner balances on the forearms while lifting the legs overhead, extending them straight toward the sky."
  },
  {
    "id": 28,
    "name": "Handstand Pose",
    "desc": "Handstand Pose, known as Adho Mukha Vrksasana in Sanskrit, is an advanced yoga posture that involves balancing the body upside down with the hands placed firmly on the ground. This pose requires significant strength, balance, and coordination, engaging the core, arms, and shoulders."
  },
  {
    "id": 29,
    "name": "Shoulderstand Pose",
    "desc": "Shoulderstand Pose, or Sarvangasana, is an inverted yoga posture. In this pose, the body is supported by the shoulders while the legs are lifted toward the ceiling, creating an alignment where the shoulders, neck, and spine form a straight line. "
  },
  {
    "id": 30,
    "name": "Fish Pose",
    "desc": "Fish Pose, or Matsyasana in Sanskrit, is a backbend asana that opens the chest and stretches the front of the body. The pose is performed by lying on the back, lifting the chest while arching the back, and supporting the body with the forearms or hands."
  },
  {
    "id": 31,
    "name": "Camel Pose",
    "desc": "Camel Pose, or Ustrasana, is a backbend that opens up the chest, stretches the spine, and strengthens the legs. In this pose, you kneel with your knees hip-width apart and your hands placed on your lower back. As you inhale, you arch your back, lifting your chest towards the sky while reaching for your heels with your hands."
  },
  {
    "id": 32,
    "name": "Bridge Pose",
    "desc": "Bridge Pose, or Setu Bandhasana, is a gentle backbend that strengthens the glutes, lower back, and legs while opening the chest. To enter the pose, lie on your back with your feet flat on the floor, hip-width apart, and your knees bent. Press your feet into the ground and lift your hips toward the ceiling, creating a backbend."
  },
  {
    "id": 33,
    "name": "Wheel Pose",
    "desc": "Wheel Pose, or Chakrasana (also known as Urdhva Dhanurasana), is a deep backbend that opens the chest, strengthens the arms and legs, and stretches the spine. In the finished shape, the body forms an arch with the hands and feet pressing into the floor, lifting the hips and chest toward the ceiling."
  },
  {
    "id": 34,
    "name": "Reclining Bound Angle Pose",
    "desc": "Reclining Bound Angle Pose or Supta Baddha Konasana is a deeply restorative yoga posture that opens the hips, stretches the inner thighs, and promotes relaxation. In this pose, the practitioner lies on their back with the soles of the feet pressed together, knees gently falling open to the sides, forming a diamond shape with the legs. Often supported with props like blocks or bolsters under the knees or back, this posture encourages the release of tension in the lower body while allowing the chest and abdomen to expand, facilitating deep, diaphragmatic breathing. It is ideal for calming the mind, relieving stress, and enhancing flexibility in the hips and groin, making it a favorite in restorative or gentle yoga practices."
  },
  {
    "id": 35,
    "name": "Legs Up the Wall Pose",
    "desc": "Legs Up The Wall Pose or Viparita Karani is a deeply restorative and gentle pose that offers a soothing reprieve for both body and mind. In this pose, the body rests on the floor with the legs extended vertically up a wall, creating a mild inversion that encourages blood flow to the upper body and brain."
  },
  {
    "id": 36,
    "name": "Boat Pose",
    "desc": "Boat Pose or Navasana is a dynamic seated posture that builds core strength, balance, and focus. In this pose, the body forms a V-shape, with the legs lifted and extended forward, the spine elongated, and the arms reaching out parallel to the floor."
  },
  {
    "id": 37,
    "name": "Seated Forward Fold",
    "desc": "Seated Forward Fold, or Paschimottanasana, is a pose that provides a deep stretch to the entire back of the body, including the spine, hamstrings, and calves. Sitting with the legs extended straight in front of you, the pose involves hinging from the hips to lengthen the torso over the legs while reaching toward the feet."
  },
  {
    "id": 38,
    "name": "Bound Angle Pose",
    "desc": "Bound Angle Pose, or Baddha Konasana, is a seated yoga posture that deeply stretches the inner thighs, hips, and groin while promoting flexibility and relaxation. In this pose, you sit on the floor with your spine tall and legs bent, bringing the soles of your feet together, allowing your knees to open wide to each side."
  },
  {
    "id": 39,
    "name": "Happy Baby Pose",
    "desc": "Happy Baby Pose, or Ananda Balasana, is a restorative pose that relaxes the body and gently stretches the hips, lower back, and thighs. Lying on your back, draw your knees toward your chest and grasp the outsides of your feet with your hands, keeping your arms inside your legs. Bend your knees and open them wide, bringing them toward the floor beside your torso, with the soles of your feet facing the ceiling."
  },
  {
    "id": 40,
    "name": "Corpse Pose",
    "desc": "Corpse Pose or Savasana is a deeply restorative and meditative yoga posture that allows the body and mind to fully relax. Typically performed at the end of a yoga session, it involves lying flat on the back with the legs extended and the arms relaxed by the sides, palms facing upward."
  },
  {
    "id": 41,
    "name": "Cobra Pose",
    "desc": "Cobra Pose, or Bhujangasana, is a backbend that stretches and strengthens the spine, chest, and shoulders. Lying on the stomach, the palms are under the shoulders, and as the practitioner inhales, they lift the chest and head by straightening the arms, creating an arch while keeping the lower body grounded."
  },
  {
    "id": 42,
    "name": "Locust Pose",
    "desc": "Locust Pose, or Salabhasana, is a strengthening backbend that targets the back, glutes, and legs while improving spinal flexibility. From a prone position with arms extended behind and palms facing down, the practitioner lifts the chest, legs, and arms, creating a deep front-body extension."
  },
  {
    "id": 43,
    "name": "Bow Pose",
    "desc": "Bow Pose, known as Dhanurasana in Sanskrit, is a yoga posture that embodies strength, flexibility, and openness. It is practiced by lying on the stomach, bending the knees, and grasping the ankles while lifting the chest and thighs off the ground."
  },
  {
    "id": 44,
    "name": "Puppy Pose",
    "desc": "Puppy Pose, known in Sanskrit as Uttana Shishosana, stretches the spine, shoulders, and chest, creating space and relieving tension in the upper back. The practitioner stretches forward from all fours, with hips over knees, arms extended, and chest melting toward the floor. The forehead or chin rests on the mat, creating a gentle arch in the spine and a playful, heart-opening shape."
  },
  {
    "id": 45,
    "name": "Cat-Cow Pose",
    "desc": "Cat-Cow Pose is a gentle flow between two poses that warms up the spine, increases flexibility, and relieves tension in the back and neck. Start on all fours with your wrists under your shoulders and knees under your hips. Inhale to arch your back and lift your chest (Cow Pose), then exhale to round your spine and tuck your chin towards your chest (Cat Pose). This movement helps to increase spinal mobility, improve posture, and release tension in the back and neck."
  },
  {
    "id": 46,
    "name": "Thread the Needle",
    "desc": "Thread the Needle is a gentle twist that stretches the shoulders, upper back, and neck while relieving tension and stress. Start on all fours, then slide one arm under the other, bringing the shoulder and the side of the head to the mat. This pose gently stretches the shoulder and upper back while providing a mild twist to the spine. It is particularly beneficial for relieving tension in the shoulders and neck, especially after long hours at a desk."
  },
  {
    "id": 47,
    "name": "Upward Plank Pose",
    "desc": "The Upward Plank Pose, or Purvottanasana, is a rejuvenating and strength-building yoga posture that opens the chest, shoulders, and front body. To perform this pose, the practitioner starts seated with legs extended forward and palms pressed into the mat slightly behind the hips, fingers pointing toward the feet, then lifts the hips to create a straight line from shoulders to heels, resembling an upward-facing plank."
  },
  {
    "id": 48,
    "name": "Half Pigeon Pose",
    "desc": "Half Pigeon Pose, or Ardha Kapotasana, is a deeply restorative yoga posture that targets the hips, glutes, and lower back, offering a profound stretch and release of tension. To perform this pose, the practitioner begins in a tabletop position and brings one knee forward, placing it behind the wrist while extending the opposite leg straight back behind them. The torso is then lowered toward the floor, with the arms either extended forward or resting on the mat."
  },
  {
    "id": 49,
    "name": "Plow Pose",
    "desc": "Plow Pose, or Halasana, is a deeply restorative inversion that stretches and lengthens the spine, shoulders, and hamstrings while calming the nervous system. From a lying position, the practitioner lifts the legs overhead and attempts to touch the floor with their toes, bringing the body into a long, curved shape. This pose helps alleviate tension in the back and neck, improves flexibility, and stimulates the thyroid gland. Plow Pose also encourages a sense of deep relaxation, making it a great counterpose for forward folds or an energizing practice in itself."
  },
  {
    "id": 50,
    "name": "Gate Pose",
    "desc": "Gate Pose ,or Parighasana, is a yoga posture that offers a deep stretch to the entire body, particularly the sides, hips, and legs. To enter the pose, begin by kneeling on the mat with your knees hip-width apart and your legs extended wide apart. One leg is kept straight, and the other knee remains bent with the foot firmly planted on the floor. Reach the arm on the side of the straight leg overhead, while the opposite hand rests on the bent knee or the floor for support."
  },
  {
    "id": 51,
    "name": "Frog Pose",
    "desc": "Frog Pose, or Mandukasana, is a hip-opening posture that stretches and strengthens the lower body. To enter the pose, begin by kneeling on the mat with your knees wide apart and your feet turned outward, so the soles face each other. Place your hands on the floor between your legs, keeping your arms straight, and lower your torso towards the ground, aiming to bring your chest closer to the floor."
  },
  {
    "id": 52,
    "name": "Side Plank",
    "desc": "Side Plank is a dynamic core-strengthening pose that also engages the arms, shoulders, and obliques while improving balance and stability. Begin in a plank position, then rotate onto one side, stacking your feet and extending your top arm toward the ceiling. This pose strengthens the core, arms, and shoulders, while also opening the chest and promoting balance. It is a powerful pose for building strength and stability in the body."
  },
  {
    "id": 53,
    "name": "Wild Thing",
    "desc": "Wild Thing is a backbend that stretches the chest, shoulders, and hips while strengthening the arms and core. From a Downward-Facing Dog position, flip one foot over the head, arch the back, and reach the opposite arm behind you, lifting the chest and hips. This pose provides a deep stretch to the chest and shoulders, strengthens the arms and core, and opens the hips. It also energizes the body and stimulates the heart chakra."
  },
  {
    "id": 54,
    "name": "Tiger Pose",
    "desc": "Tiger Pose is a backbend and balance pose that stretches the front body and strengthens the core, back, and legs. Start in a tabletop position, then extend one leg behind you, flexing the foot and lifting it towards the ceiling while simultaneously arching your back and looking forward. This pose engages the core and strengthens the back, glutes, and legs while providing a deep stretch to the front body. It also encourages focus and balance."
  },
  {
    "id": 57,
    "name": "Lizard Pose",
    "desc": "Lizard Pose is a deep hip opener that stretches the hips, groins, and thighs while improving flexibility and stability. Start in a low lunge, then bring both hands to the inside of your front foot, lowering your hips towards the ground. This pose deeply stretches the hips and groins, improving flexibility in the lower body. It also helps to open the chest and shoulders while strengthening the legs and core."
  },
  {
    "id": 58,
    "name": "Fallen Triangle",
    "desc": "Fallen Triangle is a side bend and balance pose that stretches the hamstrings, hips, and chest while strengthening the core and legs. Begin in a standing position, then hinge at the hips and bring one hand to the floor while extending the opposite leg upwards and the other arm overhead. This pose promotes flexibility in the hips and hamstrings while also improving balance and strengthening the legs and core."
  },
  {
    "id": 59,
    "name": "Bird of Paradise",
    "desc": "Bird of Paradise is an advanced balance pose that opens the hips, stretches the legs, and strengthens the core. From a standing position, bend one knee and place your opposite foot behind the bent leg, then grab your foot with your hand and slowly lift the leg towards the ceiling while balancing on the other leg. This pose challenges your flexibility and balance, while strengthening the legs, core, and arms."
  },
  {
    "id": 60,
    "name": "Extended Hand-to-Big-Toe Pose",
    "desc": "Extended Hand-to-Big-Toe Pose is a standing pose that stretches the hamstrings, calves, and hips while improving balance and coordination. Stand tall and extend one leg straight in front of you, holding the big toe with your hand, while keeping your spine long and chest open. This pose provides a deep stretch to the hamstrings and calves, and challenges your balance, core strength, and coordination."
  },
  {
    "id": 61,
    "name": "Standing Forward Fold",
    "desc": "Standing Forward Fold, or Uttānāsana, is a calming yoga posture that promotes flexibility. In this pose, you hinge at the hips with a long spine, allowing your upper body to drape over your legs as you ground through your feet. The crown of your head reaches toward the earth, creating a gentle release for the back, while your hamstrings and calves stretch deeply."
  },
  {
    "id": 62,
    "name": "Halfway Lift",
    "desc": "Halfway Lift is a simple yet powerful pose that strengthens the back and promotes spinal alignment while stretching the hamstrings. From a standing position, hinge at the hips and bring your hands to your shins, lifting your chest halfway toward the sky, keeping your spine long and your core engaged. This pose enhances spinal flexibility, encourages proper posture, and prepares the body for deeper forward bends or other poses that require a strong and stable core."
  },
  {
    "id": 63,
    "name": "Ragdoll Pose",
    "desc": "Ragdoll Pose is a playful and relaxing forward bend that releases tension in the neck, shoulders, and back while stretching the hamstrings. Start by standing with your feet hip-width apart, then fold forward, letting your upper body hang down loosely, with your arms dangling or holding opposite elbows. This pose promotes relaxation by gently stretching the spine and the back of the legs, while also offering a soothing counter to more intense poses."
  },
  {
    "id": 64,
    "name": "Eight-Angle Pose",
    "desc": "Eight-Angle Pose is an arm balance that strengthens the arms, wrists, and core while stretching the hips and hamstrings. Begin seated, then bring one knee to the outer edge of the opposite arm and lift your legs off the floor, balancing on your hands. This advanced pose requires strength, balance, and flexibility, offering a challenge for the body and mind as it encourages focus and control. It also builds strength in the arms and core while providing a deep stretch in the hips."
  },
  {
    "id": 65,
    "name": "Bound Side Angle",
    "desc": "Bound Side Angle is a deep lunge pose that stretches the sides of the body, hips, and shoulders while strengthening the legs and core. From a standing position, step one foot back into a lunge, then reach one arm behind your back to bind with the opposite hand. This pose opens the hips, stretches the sides of the body, and strengthens the legs and core, offering a deep stretch to the groins and chest. It also helps improve balance and flexibility in the hips and shoulders."
  },
  {
    "id": 66,
    "name": "Bound Forward Fold",
    "desc": "Bound Forward Fold is a variation of Forward Fold that stretches the hamstrings, calves, and lower back while promoting deep relaxation and opening the chest. From a standing position, bend forward and clasp your hands behind your back, allowing your chest to open and your shoulders to soften. This pose deepens the stretch in the hamstrings and back, while also opening the chest and shoulders, providing a counterpose to more intense backbends or chest-opening poses."
  },
  {
    "id": 67,
    "name": "Half Splits",
    "desc": "Half Splits is a forward fold variation that targets the hamstrings and hips, offering a gentle stretch to the back of the legs while promoting flexibility. From a kneeling position, extend one leg forward with the heel on the floor and the toes pointing up, then gently fold over the extended leg, keeping your spine long. This pose helps to stretch the hamstrings and improve flexibility in the legs, while also releasing tension in the hips and lower back."
  },
  {
    "id": 68,
    "name": "Full Splits",
    "desc": "Full Splits is a deep stretch that targets the hamstrings, hips, and groins, increasing flexibility and range of motion in the legs. Begin in a lunge position, then slowly extend your front leg straight and lower your hips towards the ground, aiming to bring both legs into a straight line. This advanced pose requires patience and practice, and while it offers a deep stretch, it also strengthens the legs and core. It helps to release tightness in the lower body and promotes flexibility."
  },
  {
    "id": 69,
    "name": "King Pigeon Pose",
    "desc": "King Pigeon Pose is a deep backbend and hip opener that stretches the hips, thighs, and chest while strengthening the back and core. Begin in a Pigeon Pose, then bend the back leg and reach back with your hand to grab the foot, opening your chest and arching your back. This challenging pose deepens the stretch in the hips, opens the chest, and strengthens the back, making it an excellent pose for improving flexibility and spinal mobility."
  },
  {
    "id": 70,
    "name": "Lotus Pose",
    "desc": "Lotus Pose is a seated pose that promotes deep meditation by opening the hips and calming the mind. Begin seated with one leg bent and the foot resting on the opposite thigh, then repeat on the other side, creating a cross-legged position. This pose requires flexibility in the hips and ankles and helps promote a grounded and centered feeling. It also encourages a calm mind, making it an excellent choice for meditation or deep breathing practices."
  },
  {
    "id": 71,
    "name": "Elevated Lotus Pose",
    "desc": "Elevated Lotus Pose combines the grounding and meditative qualities of Lotus Pose with the strength and balance required to lift the body off the ground. By pressing firmly into the hands and engaging the core, practitioners lift their seated Lotus position, activating the shoulders, arms, and abdominal muscles. This pose builds upper body strength, enhances balance, and fosters mental focus while maintaining the calming essence of the Lotus Pose."
  },
  {
    "id": 72,
    "name": "Cow Face Pose",
    "desc": "Cow Face Pose is a seated posture that stretches the hips, shoulders, and arms while improving flexibility and posture. Begin seated, then stack one knee on top of the other while bringing the arms behind the back to clasp opposite hands. This pose offers a deep stretch to the shoulders and outer hips, and also helps to open the chest. It is a great pose for releasing tension in the upper body and improving spinal alignment."
  },
  {
    "id": 73,
    "name": "Seated Spinal Twist",
    "desc": "Seated Spinal Twist is a gentle twist that stretches the spine, shoulders, and hips while promoting detoxification and mental clarity. Begin seated with your legs extended in front of you, then cross one leg over the other and twist your torso towards the bent knee. This pose improves spinal flexibility, releases tension in the back and shoulders, and helps to promote deep breathing and relaxation. It is an excellent pose for relieving tension and improving posture."
  },
  {
    "id": 74,
    "name": "Hero Pose",
    "desc": "Hero Pose is a seated pose that stretches the thighs, knees, and ankles while promoting a sense of calm and centeredness. Begin by sitting on your knees with your hips resting on the floor, then extend your feet out to either side and sit upright, aligning the spine. This pose is great for improving posture and flexibility in the lower body, and it is often used as a starting position for meditation and pranayama practices. It also encourages a sense of grounding and stability."
  },
  {
    "id": 75,
    "name": "Revolved Triangle",
    "desc": "Revolved Triangle is a standing twist that stretches the hamstrings, hips, and spine while strengthening the core and legs. From a wide-legged stance, turn one foot outward and reach your opposite hand toward the foot, twisting your torso and opening your chest. This pose deeply stretches the legs and spine while also improving balance and flexibility. It is a great pose for strengthening the legs and core, as well as improving spinal mobility."
  },
  {
    "id": 76,
    "name": "Revolved Side Angle",
    "desc": "Revolved Side Angle is a standing pose that strengthens the legs and core while opening the chest and stretching the hips and groins. From a wide-legged stance, bend one knee into a lunge, then twist your torso toward the bent leg and bring your opposite hand to the floor, extending your top arm toward the sky. This pose improves balance, flexibility, and strength, and also opens the hips and chest, creating a deep stretch throughout the body."
  },
  {
    "id": 77,
    "name": "Shoulder Pressing Pose",
    "desc": "Shoulder Pressing Pose is an arm balance that strengthens the shoulders, arms, and core while stretching the wrists and upper back. Begin in a seated position, then press your hands into the floor, lift your legs, and balance on your arms. This challenging pose builds strength and stability in the upper body and core while also improving balance and focus. It is an excellent pose for developing arm and shoulder strength."
  },
  {
    "id": 78,
    "name": "Flying Pigeon Pose",
    "desc": "Flying Pigeon Pose is an advanced arm balance that requires strength and flexibility in the arms, core, and legs. Begin in a standing position, then squat low and bring one leg over the opposite arm while balancing on your hands, lifting your feet off the ground. This pose requires balance and focus while also deepening the stretch in the hips and opening the chest. It is an excellent pose for building strength and flexibility in the arms and core."
  },
  {
    "id": 79,
    "name": "Firefly Pose",
    "desc": "Firefly Pose is an advanced arm balance that strengthens the arms, core, and legs while stretching the hamstrings and groins. From a seated position, extend your legs wide and place your hands on the floor between your legs, then lift your feet off the floor and straighten your legs while balancing on your hands. This pose requires strength, flexibility, and balance, and is excellent for building arm, core, and leg strength while increasing flexibility in the hips and legs."
  },
  {
    "id": 80,
    "name": "Monkey Pose",
    "desc": "Monkey Pose is a deep hamstring stretch that opens the hips and strengthens the legs while improving flexibility. From a standing position, step one leg forward and bend the front knee into a lunge, then straighten the back leg and extend the front leg straight while keeping the chest lifted. This pose helps to increase flexibility in the hamstrings and hips, and it also improves balance and leg strength, making it a great preparation for deeper stretches."
  },
  {
    "id": 81,
    "name": "Ganda Bherundasana",
    "desc": "Ganda Bherundasana, also known as Chin Stand, is an advanced arm balance that requires strength, flexibility, and focus. Begin in a seated position and place your hands behind you, then press into the floor and lift your body into a supported position, balancing on your chin. This challenging pose strengthens the arms, shoulders, and core, while also promoting flexibility in the hips and spine. It is an excellent pose for building upper body strength and improving balance and control."
  },
  {
    "id": 82,
    "name": "Scorpion Pose",
    "desc": "Scorpion Pose is a dramatic backbend and arm balance that requires deep flexibility in the spine, shoulders, and legs, along with core strength. From a forearm stand, begin to curve your back and lower your legs behind you, aiming to bring your feet to the floor while maintaining balance on your forearms. This pose opens the chest, improves spinal flexibility, and strengthens the core and shoulders. It is a visually striking and challenging pose that enhances body awareness and control."
  },
  {
    "id": 83,
    "name": "Half Moon Bound Pose",
    "desc": "Half Moon Bound Pose is a variation of Half Moon Pose that adds an arm bind to deepen the stretch in the shoulders and hips. From a standing position, extend one leg and reach the opposite hand toward the floor, then wrap your top arm behind your back and bind your hands together. This pose improves balance, opens the hips, and stretches the sides of the body while strengthening the legs and core. The arm bind adds an extra layer of depth, promoting flexibility in the shoulders and chest."
  },
  {
    "id": 84,
    "name": "Hummingbird Pose",
    "desc": "Hummingbird Pose, or Mayurasana, is a challenging arm balance that requires strength in the arms, core, and wrists, along with flexibility in the legs and hips. Begin in a squatting position and place your hands on the floor, then lean forward and lift your legs off the ground, balancing on your arms. This pose strengthens the core and arms while stretching the hips and promoting balance and focus. It is an advanced pose that builds strength, flexibility, and coordination."
  },
  {
    "id": 89,
    "name": "Grasshopper Pose",
    "desc": "Grasshopper Pose (Maksikanagasana Variation) is an advanced arm balance that challenges both strength and flexibility. Start in a seated position with your hands on the floor behind you, then twist your torso and extend your legs outward, balancing on your hands. This pose builds strength in the arms, wrists, and core while stretching the hips and legs. It also requires a deep sense of focus and balance to hold the posture and maintain stability."
  },
  {
    "id": 90,
    "name": "Baby Grasshopper",
    "desc": "Baby Grasshopper Pose (Parsva Bhuja Dandasana) is a challenging arm balance that strengthens the core and arms while improving balance and flexibility. Begin in a low squat position and place your hands on the floor, then twist your torso and lift your legs off the ground, balancing on your hands. This pose requires strength in the arms and core, as well as flexibility in the hips and legs. It is an excellent pose for developing balance and body awareness."
  },
  {
    "id": 91,
    "name": "Caterpillar Pose",
    "desc": "Caterpillar Pose (Paschimottanasana Variation) is a seated forward fold that targets the back, hamstrings, and spine, while promoting deep relaxation. Begin seated with your legs extended forward, then fold over your legs, reaching your head toward the floor. This variation deepens the stretch in the hamstrings and back, while also calming the mind and promoting a sense of introspection. It is a great pose for increasing flexibility in the spine and hamstrings."
  },
  {
    "id": 92,
    "name": "Revolved Chair Pose",
    "desc": "Revolved Chair Pose (Parivrtta Utkatasana) is a twisting variation of Chair Pose that strengthens the legs, core, and arms while increasing flexibility in the spine and hips. From Chair Pose, twist your torso to one side, placing your opposite elbow on the outside of your knee, and extend your other arm upward. This pose builds strength in the legs and core, while also improving flexibility in the spine and shoulders. It helps to release tension and promote deep concentration and focus."
  },
  {
    "id": 93,
    "name": "Side Stretch Pose",
    "desc": "Side Stretch Pose (Parsvottanasana) is a standing pose that stretches the sides of the body, hips, and legs while improving balance and flexibility. From a standing position, step one foot back into a lunge, then fold forward and reach one hand to the floor while the other extends upward. This pose stretches the hamstrings, hips, and sides of the torso, while also improving balance and focus. It is an excellent pose for opening the hips and lengthening the sides of the body."
  },
  {
    "id": 94,
    "name": "Hero Pose with Recline",
    "desc": "Hero Pose with Recline (Supta Virasana) is a seated stretch that targets the thighs, hips, and lower back while promoting deep relaxation. Begin in Hero Pose, then slowly recline back onto the floor, bringing your arms overhead or by your sides. This pose stretches the quadriceps, hips, and groins while also calming the mind and improving spinal alignment. It is a great pose for releasing tension in the lower body and promoting flexibility."
  },
  {
    "id": 95,
    "name": "Intense Side Stretch",
    "desc": "Intense Side Stretch (Parsvottanasana) is a standing forward fold that stretches the hamstrings, hips, and sides of the body while improving flexibility and balance. From a standing position, step one leg back and fold forward, bringing your hands to the floor or your shins, while extending your chest toward your thighs. This pose deepens the stretch in the hamstrings and hips, while also promoting balance and flexibility in the spine and torso."
  },
  {
    "id": 96,
    "name": "Revolved Crescent Lunge",
    "desc": "Revolved Crescent Lunge (Parivrtta Alanasana) is a twisting variation of Crescent Lunge that strengthens the legs and core while improving spinal mobility. From a high lunge, twist your torso and bring your opposite elbow to the outside of your knee, extending your top arm toward the sky. This pose strengthens the legs, opens the chest, and promotes flexibility in the spine and hips, making it an excellent pose for building strength and improving balance."
  },
  {
    "id": 97,
    "name": "Tortoise Pose",
    "desc": "Tortoise Pose (Kurmasana) is a seated forward fold that stretches the back, hips, and hamstrings while promoting deep relaxation. Begin seated with your legs extended wide apart, then fold forward and place your chest on the floor, extending your arms out in front of you. This pose deeply stretches the hamstrings, hips, and spine, while also calming the mind and promoting a sense of introspection."
  },
  {
    "id": 98,
    "name": "One-Legged Bridge Pose",
    "desc": "One-Legged Bridge Pose (Setu Bandha Sarvangasana with one leg lifted) is a variation of Bridge Pose that challenges the core and legs while deepening the stretch in the hips and thighs. Begin in Bridge Pose, then lift one leg off the ground, keeping your hips lifted and your body in a straight line. This pose strengthens the legs, core, and glutes while also stretching the hamstrings and opening the hips."
  },
  {
    "id": 99,
    "name": "Wheel Pose Variation",
    "desc": "Wheel Pose Variation (Urdhva Dhanurasana with one leg lifted) is an advanced variation of Wheel Pose that requires flexibility, strength, and balance. From a Wheel Pose, lift one leg off the floor while maintaining the bend in your back and extending your chest toward the sky. This variation increases the challenge of the pose by adding instability, promoting greater flexibility in the back and hips, and strengthening the arms, legs, and core."
  },
  {
    "id": 100,
    "name": "Standing Bow Pose",
    "desc": "Standing Bow Pose (Dandayamana Dhanurasana) is a standing balance that stretches the chest, shoulders, and hips while strengthening the legs and core. From a standing position, grab one foot behind you with one hand, then lean forward, extending your opposite arm forward while kicking the lifted leg back. This pose improves balance, flexibility, and strength, while opening the chest and hips and increasing the sense of focus and concentration."
  }
]