[
  {
    "id": 1,
    "name": "Mountain Pose",
    "modification": "For those with ankle or knee issues, widening the stance by separating the feet a few inches can provide extra stability and reduce strain. If balance is a concern, standing near a wall or using a block under your feet for support can help maintain the pose with more confidence. For practitioners with shoulder tension or limited mobility, keeping the arms by the sides or placing the palms facing inward rather than reaching upwards can help alleviate discomfort."
  },
  {
    "id": 2,
    "name": "Downward-Facing Dog",
    "modification": "For individuals with tight hamstrings or calves, keeping the knees bent can prevent overstraining the legs and lower back. This modification helps maintain a long, neutral spine, avoiding rounding in the back, and allows the body to relax into the stretch more comfortably. It also ensures that the core remains engaged without creating excessive tension in the lower back or hamstrings. If reaching the heels to the floor is difficult, using props like blocks or cushions under the feet can provide support. Elevating the heels allows practitioners to focus on lifting the hips and lengthening the spine rather than forcing the heels down, which can lead to unnecessary strain. For those with wrist discomfort or injuries, instead of pressing directly into the palms, practitioners can make fists, use a yoga block under the hands, or try a forearm variation of the pose. These adjustments reduce pressure on the wrists while still engaging the shoulders and core. Using a wedge-shaped block to elevate the hands slightly can also provide additional support and ease strain on the wrists."
  },
  {
    "id": 3,
    "name": "Plank Pose",
    "modification": "One simple modification is to perform the pose on your forearms instead of your hands, known as Forearm Plank. This reduces the pressure on the wrists and can help you maintain better alignment in the shoulders. If you still find it difficult to maintain the pose, try lowering your knees to the ground. This modification lightens the load on the core and helps you focus on building strength gradually without compromising form. Using props such as yoga blocks under the hands or a cushion under the knees can further reduce strain and provide more support during the hold. Another accessible option is to perform a wall plank by placing your hands on a wall at shoulder height and stepping your feet back until your body forms an angled line. This variation eliminates pressure on the wrists and shoulders while still engaging the core and promoting proper alignment. Additionally, you can reduce the duration of the hold, working up to longer times as you build strength and endurance. By adjusting the pose to fit your body’s needs, you can still enjoy the benefits of Plank Pose while minimizing the risk of injury."
  },
  {
    "id": 4,
    "name": "",
    "modification": ""
  },
  {
    "id": 5,
    "name": "Upward-Facing Dog",
    "modification": "If the backbend feels too intense or if there's lower back discomfort, you can also perform a gentler version by keeping the thighs on the mat, creating a variation called Cobra Pose (Bhujangasana), which still engages the upper back and chest but with less strain on the lower spine. For those with tight hips or lower back concerns, placing the knees on the mat can help by taking some pressure off the lower body while still allowing the chest and upper body to lift."
  },
  {
    "id": 6,
    "name": "Child's Pose",
    "modification": "If you have knee discomfort or injury, placing a cushion or blanket under the knees can provide additional support. You can also try keeping the knees slightly apart, rather than together, to reduce pressure on the knees and make the pose more comfortable. If you experience tightness in the hips or lower back, using a bolster or pillow between your legs or under your chest can help support the body and promote a deeper, more restorative stretch. For individuals with neck discomfort, placing a small cushion under the forehead or using a block to elevate the head can prevent strain and allow for a more relaxed position. Additionally, if the full forward bend is difficult, you can modify the pose by simply sitting on the heels with a slight lean forward, keeping the chest lifted to avoid excess pressure on the back."
  },
  {
    "id": 7,
    "name": "Warrior I",
    "modification": "If you have tight hips or difficulty keeping the back heel on the floor, you can shorten your stance or angle your back foot slightly to relieve tension. Focus on keeping the pelvis square and avoid arching the lower back. If you're pregnant, widen the stance for more balance and support."
  },
  {
    "id": 8,
    "name": "Warrior II",
    "modification": "If your hips feel tight, shorten your stance and bend your front knee more deeply. If you're pregnant, make sure to keep your belly open by widening your legs a bit and keeping your arms at a comfortable height. Maintain even weight distribution across both legs for stability."
  },
  {
    "id": 9,
    "name": "Warrior III",
    "modification": "If balance is challenging, practice near a wall for support or use a block under your hands for extra stability. You can also perform the pose with a slight bend in the standing leg to make it easier. For more balance, focus on a single point in front of you and engage your core."
  },
  {
    "id": 10,
    "name": "Extended Side Angle",
    "modification": "If you have tight shoulders, try placing your bottom hand on a block or your knee for support. Keep your core engaged and avoid letting your chest collapse. For a deeper stretch, use your elbow on your thigh instead of your hand if reaching the floor is too intense."
  },
  {
    "id": 11,
    "name": "Reverse Warrior",
    "modification": "If you experience discomfort in the knees or hips, shorten your stance or slightly bend the front knee. Focus on reaching the back leg actively to avoid collapsing into the lower back. You can also rest the back hand on your hip for more stability."
  },
  {
    "id": 12,
    "name": "Triangle Pose",
    "modification": "If reaching the floor is difficult, use a block under your hand or keep your hand on your shin or thigh. You can also bend the front knee slightly to reduce strain in the hamstrings and lower back. For more support, keep your gaze forward or down instead of up."
  },
  {
    "id": 13,
    "name": "Half Moon Pose",
    "modification": "If balance is challenging, use a block under your bottom hand or practice next to a wall for stability. Focus on lifting the back leg from the hip and avoid overextending the spine. For a gentler option, bend the standing leg slightly to reduce strain."
  },
  {
    "id": 14,
    "name": "Chair Pose",
    "modification": "If your knees are sensitive, don't bend them too deeply and keep your weight in your heels. You can place a block between your thighs to engage the inner legs and activate the core. Keep your arms at a comfortable height to avoid straining the shoulders."
  },
  {
    "id": 15,
    "name": "Goddess Pose",
    "modification": "If you experience tightness in the hips, shorten the stance or lower the knees slightly. Keep the core engaged and avoid letting the knees collapse inward. You can also place a block under your hips for more support if you're new to this pose."
  },
  {
    "id": 16,
    "name": "High Lunge",
    "modification": "If balance or flexibility is an issue, place your hands on your front thigh or use a block for extra height under the hands. You can drop the back knee to the floor for a more accessible variation or keep the back heel lifted to stretch the calf more deeply."
  },
  {
    "id": 17,
    "name": "Low Lunge",
    "modification": "If your knees or hips are tight, keep the back knee on the floor and use padding under the knee for comfort. Use blocks under your hands for added support if you're unable to reach the floor. Keep your chest open and avoid collapsing the lower back."
  },
  {
    "id": 18,
    "name": "Pyramid Pose",
    "modification": "If you have tight hamstrings, bend the front knee slightly and use blocks under your hands for extra height. Keep your back leg engaged and your hips square to the front for a deeper stretch. You can also place a blanket under the back knee if it feels uncomfortable."
  },
  {
    "id": 19,
    "name": "Wide-Legged Forward Fold",
    "modification": "If your hamstrings are tight, keep a slight bend in the knees to avoid straining the lower back. You can place a block under your hands or rest your head on a cushion or block if the floor feels far away. Engage the thighs to deepen the stretch and avoid rounding the back."
  },
  {
    "id": 20,
    "name": "Standing Split",
    "modification": "If balance is challenging, practice next to a wall or use blocks under your hands for added support. Keep the standing leg slightly bent for stability and focus on engaging the core to keep the body in a straight line. For a gentler option, keep the lifted leg lower and avoid overstretching."
  },
  {
    "id": 26,
    "name": "Garland Pose",
    "modification": "If you're unable to squat deeply, place a block or cushion under your heels to provide extra support. If your hips or knees feel strained, sit higher up with a wider stance to reduce intensity. For additional comfort, you can also hold onto a prop or use a bolster under your seat to assist with depth. Focus on keeping your spine long and your chest open."
  },
  {
    "id": 41,
    "name": "Cobra Pose",
    "modification": "If you have lower back discomfort, avoid coming into a deep backbend and keep the elbows slightly bent for support. Use a block under your pelvis if you find it challenging to engage the lower body. Keep your elbows close to your body and avoid collapsing the chest."
  },
  {
    "id": 42,
    "name": "Locust Pose",
    "modification": "If you have neck or back discomfort, keep your head and chest slightly lower to avoid strain. You can also lift the chest less and keep the arms out in front of you rather than reaching back to hold the legs. Use a cushion under the belly for more comfort."
  },
  {
    "id": 43,
    "name": "Bow Pose",
    "modification": "If you're working on flexibility, use a yoga belt or strap around your feet for support. Engage the legs and avoid overextending the back to protect the spine. If you're pregnant, avoid this deep backbend and opt for a gentler variation."
  },
  {
    "id": 44,
    "name": "Puppy Pose",
    "modification": "If your shoulders feel tense, keep the chest lifted and avoid dropping the forehead all the way to the floor. You can use a block under your chest for support or keep the knees slightly bent if your back feels tight."
  },
  {
    "id": 45,
    "name": "Cat-Cow Pose",
    "modification": "If you have neck or back issues, move slowly and focus on gentle movements. Keep the core engaged during the cow pose to avoid over-arching the lower back. Use a cushion under the knees if you're uncomfortable on the floor."
  },
  {
    "id": 46,
    "name": "Thread the Needle",
    "modification": "To make the stretch more accessible, keep the lower arm bent and only reach the upper arm over the head if comfortable. You can place a block under the head for support if your neck feels strained. Engage the core to help protect the lower back."
  },
  {
    "id": 47,
    "name": "Reverse Plank Pose",
    "modification": "If lifting the hips fully is challenging, keep the knees bent with feet flat on the ground in a tabletop position to reduce the intensity. Place a folded blanket or yoga block under the hands if wrist discomfort arises. Engage the core and focus on lifting the chest to maintain alignment, even in a modified variation."
  },
  {
    "id": 48,
    "name": "Pigeon Pose",
    "modification": "If you're working on flexibility, use a cushion or blanket under the hips for added support. Keep your back leg extended straight and avoid collapsing into the lower back. If you're pregnant, use a bolster under the chest or come into a supported variation."
  },
  {
    "id": 49,
    "name": "Plow Pose",
    "modification": "If touching the floor with your toes is challenging, keep your legs bent and only lower them as far as comfortable. You can also place a blanket or cushion under your back for additional support and to reduce strain on the neck. If you experience discomfort in your shoulders, avoid deepening the stretch too much and focus on lifting your hips instead of trying to touch your feet to the floor."
  },
  {
    "id": 50,
    "name": "Supine Twist",
    "modification": "If you have neck or lower back discomfort, keep the knees bent or use a cushion under the knees for support. You can also modify the twist by keeping the shoulders on the ground or reducing the depth of the twist. Avoid forcefully twisting if you're pregnant."
  },
  {
    "id": 51,
    "name": "Half Lord of the Fishes",
    "modification": "If the twist is too intense, keep the bottom leg extended instead of bent. You can sit on a cushion or block to make the twist more accessible, and always keep the spine tall to avoid compressing the back. If you're pregnant, avoid deep twisting and opt for a gentler version."
  },
  {
    "id": 52,
    "name": "Side Plank",
    "modification": "If you're building strength, start with the lower knee on the ground for added stability. You can also keep the bottom knee bent to make the pose more accessible. Focus on engaging the core and avoiding any sagging in the hips."
  },
  {
    "id": 53,
    "name": "Wild Thing",
    "modification": "If your back is tight, use a block under your hand for extra support or keep the feet on the floor instead of lifting them. Avoid deep backbends if you have lower back discomfort, and engage the core to protect the spine."
  },
  {
    "id": 54,
    "name": "Tiger Pose",
    "modification": "If your knees or wrists are sensitive, perform this pose with a cushion under the knees or modify by keeping the torso upright. Keep the core engaged and avoid overextending the back. You can also bend the top knee slightly to reduce strain on the lower back."
  },
  {
    "id": 55,
    "name": "Gate Pose",
    "modification": "If you have tight hips or legs, reduce the angle of the bend in the extended leg and focus on reaching for the foot rather than the floor. Use a block under the hand for support, and avoid collapsing into the lower back by keeping the core engaged."
  },
  {
    "id": 56,
    "name": "Frog Pose",
    "modification": "To make the stretch more comfortable, place blankets under the knees for extra cushioning. Keep the feet flexed and avoid over-stretching the groin area. You can also perform this pose with a gentler angle if your hips are very tight."
  },
  {
    "id": 57,
    "name": "Lizard Pose",
    "modification": "If your hips are tight, lower the back knee to the ground and keep a cushion under the knee for support. You can also use a block under the hands for added height or perform the pose with the back knee lifted for a deeper stretch."
  },
  {
    "id": 58,
    "name": "Fallen Triangle",
    "modification": "If you're working on balance, keep the top leg bent instead of straight to reduce strain. You can also place a block under the hand for extra height and support. Keep the chest open and avoid rounding the back to protect the spine."
  },
  {
    "id": 59,
    "name": "Bird of Paradise",
    "modification": "If you're unable to reach your foot or balance, use a strap around the foot to help lift it. Focus on keeping the hips square and avoid over-stretching the hamstrings. Use a wall for balance support if needed."
  },
  {
    "id": 60,
    "name": "Extended Hand-to-Big-Toe Pose",
    "modification": "If you're unable to reach the foot, use a yoga strap around the foot to help lengthen the arms. Keep the core engaged and avoid rounding the back to maintain stability. Bend the supporting leg slightly if you feel tension in the knee or lower back."
  },
  {
    "id": 81,
    "name": "Ganda Bherundasana",
    "modification": "If you're working on this advanced arm balance, practice it near a wall for support or start by holding a chin stand with feet on the floor before lifting the legs. Use a block or cushion under the head to reduce pressure. Keep the elbows bent and the core engaged for more stability."
  },
  {
    "id": 82,
    "name": "Scorpion Pose",
    "modification": "If you're new to this pose, practice a more gentle variation by keeping the feet on the floor or performing a forearm version. You can also use a block under the feet or hands to increase stability and focus on building strength gradually."
  },
  {
    "id": 83,
    "name": "Half Moon Bound Pose",
    "modification": "If you have tight hamstrings or hips, use a block under your hand for added support and modify the bind by using a strap or belt. Keep the pelvis open and engage the core to maintain balance, and avoid forcing the backbend."
  },
  {
    "id": 84,
    "name": "Hummingbird Pose",
    "modification": "This advanced balance pose can be modified by keeping the feet on the ground or using a wall for support. Focus on lifting through the chest and maintaining a strong core to help with the balance before attempting a full version."
  },
  {
    "id": 85,
    "name": "Peacock Pose",
    "modification": "If you're struggling to lift into the pose, try starting with your feet on the floor and focus on strengthening the arms and core. Use blocks under your hands for more height and work on flexibility in the legs and back before progressing to a full expression."
  },
  {
    "id": 86,
    "name": "Compass Pose",
    "modification": "If you're unable to hold the pose with the legs extended, bend the knee of the extended leg and work on lengthening the spine. You can use a strap around the foot to help lengthen the leg. Avoid forcing the stretch in the hip flexors."
  },
  {
    "id": 87,
    "name": "Sleeping Vishnu",
    "modification": "For a gentler version, keep the knees bent and the foot of the extended leg on the ground. Use a cushion or bolster under your head and shoulders for added comfort. Focus on deepening the twist without forcing it, and avoid straining the lower back."
  },
  {
    "id": 88,
    "name": "Dragonfly Pose",
    "modification": "If you're new to this deep stretch, start with a simpler seated forward fold or use props such as blocks to support the chest and reduce the intensity. Keep the spine long and avoid rounding the back while focusing on opening the hips."
  },
  {
    "id": 89,
    "name": "Grasshopper Pose",
    "modification": "For a more accessible version, practice with the knees bent and keep the feet closer to the floor. Use blocks under the hands for extra height if needed, and focus on strengthening the core and arms before attempting a deeper expression."
  },
  {
    "id": 90,
    "name": "Baby Grasshopper",
    "modification": "This arm balance can be practiced by keeping the back knee on the ground or using blocks under the hands for extra support. Focus on strengthening the core and arms and lifting the legs gradually once balance and stability are established."
  },
  {
    "id": 91,
    "name": "Caterpillar Pose",
    "modification": "If your hamstrings are tight, use a prop like a bolster under the chest or knees for added support. Bend the knees slightly to reduce strain, and focus on lengthening the spine as you fold forward rather than forcing the stretch."
  },
  {
    "id": 92,
    "name": "Revolved Chair Pose",
    "modification": "To reduce intensity, keep the knees slightly bent or take a gentler twist. Use a block between the thighs for added stability and avoid collapsing the chest. Keep the core engaged and focus on maintaining balance and alignment in the twist."
  },
  {
    "id": 93,
    "name": "Side Stretch Pose",
    "modification": "If the stretch feels too intense, reduce the range of motion and keep the knees slightly bent. Use a block under the hand for more support, and avoid collapsing the chest as you lengthen through the side body."
  },
  {
    "id": 94,
    "name": "Hero Pose with Recline",
    "modification": "If sitting on the floor is uncomfortable, place a cushion or block under the hips or knees to reduce strain. You can also place a bolster under the back for added support while gently reclining without forcing the lower back."
  },
  {
    "id": 95,
    "name": "Intense Side Stretch",
    "modification": "If your hamstrings are tight, bend the knees slightly and use blocks under the hands for more support. Focus on lengthening the spine and avoiding the collapse of the chest towards the legs. Keep the core engaged for stability."
  },
  {
    "id": 96,
    "name": "Revolved Crescent Lunge",
    "modification": "If balancing is difficult, keep the back knee on the ground or use a block under the hand for more support. Twist gently from the abdomen rather than the lower back, and keep the hips squared for better alignment."
  },
  {
    "id": 97,
    "name": "Tortoise Pose",
    "modification": "If you have tight hamstrings, bend the knees slightly and use a block under the forehead for extra support. Focus on lengthening the spine and relaxing into the forward fold. Keep the feet hip-width apart to prevent strain on the lower back."
  },
  {
    "id": 98,
    "name": "One-Legged Bridge Pose",
    "modification": "To make this pose more accessible, keep both feet on the floor or bend the knee of the lifted leg. Use a block under the lower back for more support if needed, and focus on lifting the hips without over-straining the glutes or hamstrings."
  },
  {
    "id": 99,
    "name": "Wheel Pose Variation",
    "modification": "If lifting into Wheel Pose feels too intense, practice with the feet closer to the hands or use a block under the lower back. Keep the core engaged and avoid over-arching the lower back. You can also practice a bridge pose as a more accessible alternative."
  },
  {
    "id": 100,
    "name": "Standing Bow Pose",
    "modification": "If balancing is challenging, use a wall or chair for support. Keep the lifted leg slightly bent and focus on lengthening through the spine. If you have tight hips, you can reduce the intensity by not reaching as far forward or backward."
  }
]