[
  {
    "id": 1,
    "name": "Downward Dog",
    "modification": "If you have wrist or back issues, try bending your knees slightly to take pressure off the lower back and wrists. You can also perform the pose with forearms on the ground (Dolphin Pose) to reduce the strain on your wrists. Keep your hands shoulder-width apart and feet hip-width apart for a more stable base."
  },
  {
    "id": 2,
    "name": "Tree Pose",
    "modification": "If balance is an issue, practice Tree Pose near a wall for extra support. Instead of placing your foot on your thigh, place it lower on your calf to reduce strain on the knee. If you're pregnant, avoid placing the foot too high on the thigh and focus on keeping your foot on the calf or ankle."
  },
  {
    "id": 3,
    "name": "Warrior I",
    "modification": "If you have tight hips or knees, reduce the depth of the lunge to prevent strain on the knees. Keep your back leg straight and hip-width apart, or try keeping the back knee on the ground (Low Lunge) for extra support. For shoulder injuries, keep your arms extended to the sides or lower them to shoulder height instead of raising them overhead."
  },
  {
    "id": 4,
    "name": "Warrior II",
    "modification": "If you have knee issues, avoid bending the front knee too deeply and ensure that it is aligned with the ankle. You can also practice the pose with your hands resting on your hips or in a more relaxed arm position. For balance support, practice near a wall or use blocks for added height."
  },
  {
    "id": 5,
    "name": "Child's Pose",
    "modification": "For those with knee or hip pain, try placing a cushion between your thighs and calves for added support. If your forehead does not reach the ground, place a block or cushion underneath your head for comfort. For pregnant individuals, widen your knees and rest your torso between them to make more room for the belly."
  },
  {
    "id": 6,
    "name": "Cobra Pose",
    "modification": "If you have back pain or neck issues, only lift your chest slightly off the floor and avoid forcing the backbend. You can also practice the pose with the elbows bent and forearms on the ground (Sphinx Pose) for a gentler stretch. If you're pregnant, keep the arch shallow and avoid any discomfort in the lower back."
  },
  {
    "id": 7,
    "name": "Bridge Pose",
    "modification": "For individuals with tight hamstrings or lower back issues, keep your feet farther apart or place a block under your sacrum for added support. You can also keep the knees closer together to reduce strain on the hips and knees. Pregnant individuals may want to avoid lifting the hips too high and use a bolster under the back for added comfort."
  },
  {
    "id": 8,
    "name": "Triangle Pose",
    "modification": "For tight hamstrings or hips, use a block under your bottom hand to make the pose more accessible. You can also bend the front knee slightly to reduce strain on the lower back and hips. If you're pregnant, avoid twisting the torso too deeply and modify the position by keeping the hand on the thigh instead of reaching for the floor."
  },
  {
    "id": 9,
    "name": "Seated Forward Bend",
    "modification": "If you have tight hamstrings or back pain, use a strap around the feet to help lengthen the spine as you fold forward. You can also keep your knees bent or place a cushion under the knees for support. If you're pregnant, avoid deep forward bends and focus on a gentle stretch, keeping the spine long."
  },
  {
    "id": 10,
    "name": "Mountain Pose",
    "modification": "If you have balance issues, stand near a wall or use a block between the thighs for additional stability. Keep the feet hip-width apart and slightly bend the knees if you have tightness in the lower back or legs. If you're pregnant, ensure you're standing in a comfortable, stable position with slightly more space between the feet for balance."
  },
  {
    "id": 11,
    "name": "Chair Pose",
    "modification": "For individuals with knee or back issues, keep the knees slightly bent or reduce the depth of the squat. You can also perform Chair Pose with a block between the thighs to help engage the inner thighs and keep the knees aligned. If you're pregnant, avoid squatting too deeply and focus on a more upright position."
  },
  {
    "id": 12,
    "name": "Camel Pose",
    "modification": "If you have lower back or neck issues, avoid arching too deeply and keep your hands on your lower back for support. You can also place a block or cushion under the pelvis to prevent overstretching the lower back. Pregnant individuals should avoid deep backbends and may benefit from performing this pose with less intensity, or skipping it altogether."
  },
  {
    "id": 13,
    "name": "Boat Pose",
    "modification": "If you have lower back pain or core weakness, keep your feet on the floor and avoid lifting the legs too high. Alternatively, practice with a straight back and knees bent to reduce strain on the lower back. Pregnant individuals should avoid boat pose due to the compression of the abdomen and focus on gentle core exercises."
  },
  {
    "id": 14,
    "name": "Plank Pose",
    "modification": "To reduce pressure on the wrists, practice Plank Pose on your forearms (Forearm Plank) or keep the knees on the floor. If you have lower back issues, focus on engaging your core to maintain a straight line from head to heels. For pregnant individuals, consider practicing Plank Pose with the knees down to make it more accessible."
  },
  {
    "id": 15,
    "name": "Bow Pose",
    "modification": "If you have lower back or hip pain, avoid lifting the legs too high or arching too deeply. Use a prop or cushion under the pelvis for support, and only perform a gentle version of the pose. Pregnant individuals should avoid deep backbends and may modify the pose by keeping the chest lifted without bending the back."
  },
  {
    "id": 16,
    "name": "Crow Pose",
    "modification": "For those new to Crow Pose, keep your feet on the ground for a more accessible version, or use a cushion or prop under the knees for added support. Practice by keeping your arms engaged and your gaze focused on the ground. If you're pregnant, it's best to avoid this pose due to the balance and core work required."
  },
  {
    "id": 17,
    "name": "Happy Baby",
    "modification": "For those with tight hips or lower back pain, keep the knees bent at a less extreme angle and use a block under the lower back for support. Pregnant individuals should avoid this pose as it may put pressure on the abdomen, and instead focus on more gentle stretches."
  },
  {
    "id": 18,
    "name": "Butterfly Pose",
    "modification": "If you have tight hips or lower back pain, sit on a cushion or blanket to elevate the hips and reduce strain on the lower back. You can also bend your knees slightly or use blocks under the thighs for additional support. Pregnant individuals should avoid deep forward bends and focus on a gentle stretch with the back straight."
  },
  {
    "id": 19,
    "name": "Headstand",
    "modification": "Headstand should be avoided if you're new to inversions or have neck, back, or shoulder injuries. You can modify this pose by practicing it with a wall for support or by working on alternatives like Dolphin Pose or Shoulder Stand, which also build shoulder strength. Pregnant individuals should avoid inversions due to the pressure on the head and neck."
  },
  {
    "id": 20,
    "name": "Reclined Twist",
    "modification": "If you have spinal issues or are pregnant, modify the twist by keeping the knees slightly bent or doing a gentler version of the twist without bringing the knees too far across the body. Use a bolster under the knees for added support and focus on gentle movement to avoid any compression in the abdomen."
  }
]
