[
  {
    "id": 1,
    "name": "Mountain Pose",
    "modification": "For those with ankle or knee issues, widening the stance by separating the feet a few inches can provide extra stability and reduce strain. If balance is a concern, standing near a wall or using a block under your feet for support can help maintain the pose with more confidence. For practitioners with shoulder tension or limited mobility, keeping the arms by the sides or placing the palms facing inward rather than reaching upwards can help alleviate discomfort."
  },
  {
    "id": 2,
    "name": "Hero Pose",
    "modification": "If sitting directly on your heels feels uncomfortable, try placing a folded blanket, cushion, or bolster under your sit bones to raise them slightly, reducing pressure on the knees and ankles. For those with tight quadriceps or hip flexibility, you can sit on a block or prop your hips with a cushion, allowing the knees to stay in a more comfortable position. If the hips are high and the knees are unable to comfortably touch the floor, using a bolster or blanket under the thighs can provide additional support. If kneeling is painful, an alternative is to place a rolled-up towel or cushion under the knees for extra cushioning. To deepen the stretch while maintaining proper alignment, you can keep the knees together and ensure the spine is tall, avoiding any rounding or arching in the lower back. For individuals with limited ankle mobility or pain, placing a rolled-up towel under the ankles or sitting on a cushion may help alleviate discomfort."
  },
  {
    "id": 3,
    "name": "Lotus Pose",
    "modification": "If sitting in full Lotus Pose is too challenging or painful, you can start by sitting in Easy Pose with your legs crossed and your hands resting on your knees. To reduce pressure on the knees, place a cushion or folded blanket under your sit bones to elevate your hips, which helps to make the pose more comfortable and provides more stability. For those with tight hips or knees, it may be helpful to use props to support the thighs, such as blocks or blankets, to gently support the knees in a more relaxed position rather than forcing them toward the floor. If the ankles are tight, you can place a small rolled towel under them for additional support, helping to maintain comfort. Alternatively, Half Lotus Pose can be practiced, where one foot is placed on the opposite thigh, while the other remains underneath, creating a less intense stretch."
  },
  {
    "id": 4,
    "name": "Staff Pose",
    "modification": "For individuals with tight hamstrings or lower back discomfort, using a cushion or blanket under the hips can help maintain a more neutral spine and alleviate strain. If it's difficult to sit up straight, practitioners can bend their knees slightly while keeping the feet flexed and the legs extended forward. Those with hip or knee injuries should avoid overextending the legs and may benefit from sitting on a block or bolster for additional support. For beginners or those with limited flexibility, practicing with the feet placed closer to the body can make the pose more accessible. To modify for better core engagement, focus on gently drawing the belly button toward the spine and maintaining length in the spine, avoiding slouching."
  },
  {
    "id": 5,
    "name": "Table Top Pose",
    "modification": "If wrist discomfort is present, using props like a folded blanket or a wedge under the palms can relieve pressure. Alternatively, practicing on the fists, or using forearms instead of the hands, can reduce strain on the wrists. For those with sensitive knees, placing a blanket or cushion underneath the knees provides extra padding and support. To maintain proper alignment for individuals with lower back concerns, gently engage the core muscles to prevent the back from sagging. Additionally, if shoulder discomfort arises, it's important to avoid overextending the arms, focusing on keeping the shoulders directly above the wrists. If flexibility in the hips or legs is limited, practitioners can widen the knees slightly or perform the pose with a slightly bent elbow to maintain a comfortable position."
  },
  {
    "id": 6,
    "name": "Cat Pose",
    "modification": "For individuals with wrist pain or injury, one modification is to practice on the forearms rather than the hands, reducing pressure on the wrists. Using a soft mat or padding under the wrists can also help. People with knee discomfort can place a blanket or cushion under their knees for added support. To reduce the intensity of the pose, practitioners can focus on smaller, more controlled movements, gently engaging the core without deep flexion of the spine. Pregnant individuals, particularly in later stages, should avoid deep rounding of the back and may benefit from keeping the spine in a more neutral position or opting for a seated or supported version of the pose. For those with neck pain, it's essential to keep the neck in a neutral alignment, avoiding excessive tilting of the head."
  },
  {
    "id": 7,
    "name": "Cow Pose",
    "modification": " For those with wrist discomfort or injury, practicing on the forearms or using a prop such as a yoga block under the hands can reduce the strain on the wrists. If knee pain is an issue, placing a folded blanket or cushion under the knees provides added support and cushioning. To avoid overextending the lower back, practitioners can focus on keeping the pelvis in a neutral position rather than arching it excessively. Pregnant individuals, especially in later stages, may benefit from keeping the torso more upright and engaging the core lightly to protect the lower back. For individuals with neck pain, it’s important to maintain a neutral neck alignment by looking straight ahead or down, rather than arching the neck excessively."
  },
  {
    "id": 8,
    "name": "Child's Pose",
    "modification": "If you have knee discomfort or injury, placing a cushion or blanket under the knees can provide additional support. You can also try keeping the knees slightly apart, rather than together, to reduce pressure on the knees and make the pose more comfortable. If you experience tightness in the hips or lower back, using a bolster or pillow between your legs or under your chest can help support the body and promote a deeper, more restorative stretch. For individuals with neck discomfort, placing a small cushion under the forehead or using a block to elevate the head can prevent strain and allow for a more relaxed position. Additionally, if the full forward bend is difficult, you can modify the pose by simply sitting on the heels with a slight lean forward, keeping the chest lifted to avoid excess pressure on the back."
  },
  {
    "id": 9,
    "name": "Puppy Pose",
    "modification": " For individuals with tight shoulders, placing the forearms on the mat instead of extending the arms fully can reduce strain while still providing a gentle stretch. To protect sensitive knees, a folded blanket or cushion can be placed under the knees for added comfort. If the lower back feels compressed, practitioners can place a bolster or cushion under the chest to elevate the torso slightly and reduce the intensity of the stretch. Pregnant individuals or those with a limited range of motion can keep the hips slightly behind the knees to create more space in the body. For a gentler variation, the pose can be practiced against a wall, with the hands pressing into the wall while the chest moves forward."
  },
  {
    "id": 10,
    "name": "Tree Pose",
    "modification": "For those with balance challenges, practicing near a wall or holding onto a sturdy surface for support can help maintain stability while developing strength and confidence in the pose. Instead of placing the foot high on the inner thigh, individuals can lower the foot to the ankle or shin to reduce strain on the knee and provide more stability. For those with hip or knee issues, keeping the standing leg slightly bent rather than locked can help alleviate discomfort and provide more control. If it's difficult to keep the hands in a prayer position, the arms can be extended overhead, or they can be placed on the hips to reduce strain on the shoulders. Additionally, those with lower back issues should focus on lengthening the spine and avoiding excessive arching, which can be achieved by keeping the pelvis in a neutral position. Using props like a block under the raised foot for additional support or adjusting the position of the raised leg to reduce tension is another helpful modification."
  },
  {
    "id": 11,
    "name": "Bound Angle Pose",
    "modification": "To accommodate tight hips and groins, sitting on a folded blanket or cushion helps elevate the pelvis, allowing the knees to open more easily and the spine to stay neutral. For knee discomfort or tightness, placing blocks or cushions under the knees reduces pressure, making the pose gentler. Those with limited flexibility in the hips or groin can place the feet farther from the pelvis, creating a wider angle and reducing the intensity of the stretch. For individuals with lower back issues, it’s important to avoid forcing the forward fold. Instead, focus on lengthening the spine and hinging from the hips while keeping the chest open. Using a yoga strap around the feet can help gently deepen the stretch without compromising posture. Pregnant individuals or those with pelvic instability can modify the pose by leaning back slightly with a bolster or cushion for support, avoiding deep forward folds while still benefiting from hip opening."
  },
  {
    "id": 12,
    "name": "Supine Spinal Twist Pose",
    "modification": "For those with tight hips or lower back discomfort, placing a blanket or cushion under the knees or the lower back can offer extra support and reduce strain. If there's limited flexibility in the spine or hips, you can keep the top leg extended straight rather than crossing it over the body, or use a block or cushion under the foot of the top leg to lessen the intensity of the twist. For individuals with neck discomfort or sensitivity, it's helpful to keep the head facing upward or use a cushion under the head to support the neck, rather than turning it to the side. Another modification involves bending the bottom leg slightly or keeping both feet flat on the ground, which can help stabilize the pelvis and lessen the intensity of the twist for beginners or those with joint concerns. Always aim for a comfortable, gentle stretch, listening to your body and adjusting as needed."
  },
  {
    "id": 13,
    "name": "Happy Baby Pose",
    "modification": "For those with sensitive knees, placing a folded blanket, cushion, or yoga mat under the knees can help provide extra comfort and support, alleviating strain. If flexibility or balance is a challenge, using a yoga strap around the feet can make it easier to hold the position without over-extending or pulling too deeply. For individuals with tight hips or hamstrings, a useful modification is to keep the knees closer to the chest or reduce the depth of the hip opening, which prevents discomfort while still offering a gentle stretch. To further reduce strain, placing a cushion or bolster under the sacrum can support the lower back and provide stability. For those with lower back issues, it is important to keep the spine long and avoid excessive pulling on the feet; instead, focus on gently drawing the knees toward the floor while maintaining a neutral pelvis. Pregnant practitioners can modify the pose by using props like cushions to elevate the hips or support the back, allowing for a more comfortable and safe experience, while keeping the torso more upright to avoid pressure on the abdomen."
  },
  {
    "id": 14,
    "name": "Corpse Pose",
    "modification": " For those with back pain or discomfort when lying flat, placing a cushion or bolster under the knees can relieve pressure on the lower back and encourage a more neutral spine alignment. For neck issues, using a small cushion or rolled towel under the head and neck can provide extra support, helping to keep the cervical spine in a comfortable position. Pregnant practitioners, particularly in the second and third trimesters, should avoid lying flat on their backs, as this can compress the vena cava and reduce blood flow. A safer modification is to lie on the left side or prop up the torso with pillows to maintain comfort and circulation. If the shoulders or upper body feel tense, placing a blanket or bolster under the arms or upper back can promote relaxation and reduce strain."
  },
  {
    "id": 15,
    "name": "Plank Pose",
    "modification": "One simple modification is to perform the pose on your forearms instead of your hands, known as Forearm Plank. This reduces the pressure on the wrists and can help you maintain better alignment in the shoulders. If you still find it difficult to maintain the pose, try lowering your knees to the ground. This modification lightens the load on the core and helps you focus on building strength gradually without compromising form. Using props such as yoga blocks under the hands or a cushion under the knees can further reduce strain and provide more support during the hold. Another accessible option is to perform a wall plank by placing your hands on a wall at shoulder height and stepping your feet back until your body forms an angled line. This variation eliminates pressure on the wrists and shoulders while still engaging the core and promoting proper alignment. Additionally, you can reduce the duration of the hold, working up to longer times as you build strength and endurance. By adjusting the pose to fit your body’s needs, you can still enjoy the benefits of Plank Pose while minimizing the risk of injury."
  },
  {
    "id": 16,
    "name": "Four-Limbed Staff Pose",
    "modification": "One common modification is to lower the knees to the ground, which reduces the amount of weight placed on the arms and core while still engaging the upper body. This is particularly helpful for beginners or those with wrist, shoulder, or back limitations. Another modification is performing the pose with the elbows slightly bent rather than locked, which prevents unnecessary strain on the shoulder joints and helps to maintain proper alignment. To further reduce the challenge, practitioners can also perform the pose by lowering down slowly and keeping the chest off the floor, coming into a half-chaturanga position before transitioning into upward dog. Using props like blocks under the chest or hands can also assist in maintaining alignment and stability. It’s important to always focus on keeping the body in a straight line from head to heels, and if that feels difficult, the knees-down variation or a more gradual approach is a great way to build strength and confidence."
  },
  {
    "id": 17,
    "name": "Upward-Facing Dog",
    "modification": "If the backbend feels too intense or if there's lower back discomfort, you can also perform a gentler version by keeping the thighs on the mat, creating a variation called Cobra Pose (Bhujangasana), which still engages the upper back and chest but with less strain on the lower spine. For those with tight hips or lower back concerns, placing the knees on the mat can help by taking some pressure off the lower body while still allowing the chest and upper body to lift."
  },
  {
    "id": 18,
    "name": "Downward-Facing Dog",
    "modification": "For individuals with tight hamstrings or calves, keeping the knees bent can prevent overstraining the legs and lower back. This modification helps maintain a long, neutral spine, avoiding rounding in the back, and allows the body to relax into the stretch more comfortably. It also ensures that the core remains engaged without creating excessive tension in the lower back or hamstrings. If reaching the heels to the floor is difficult, using props like blocks or cushions under the feet can provide support. Elevating the heels allows practitioners to focus on lifting the hips and lengthening the spine rather than forcing the heels down, which can lead to unnecessary strain. For those with wrist discomfort or injuries, instead of pressing directly into the palms, practitioners can make fists, use a yoga block under the hands, or try a forearm variation of the pose. These adjustments reduce pressure on the wrists while still engaging the shoulders and core. Using a wedge-shaped block to elevate the hands slightly can also provide additional support and ease strain on the wrists."
  },
  {
    "id": 19,
    "name": "Garland Pose",
    "modification": "For those with tight hips or limited ankle mobility, placing a folded blanket, yoga wedge, or block under the heels can provide support and help maintain balance. Practitioners with difficulty squatting deeply can sit on a block or low stool, allowing the hips to rest while keeping the spine elongated. To reduce strain on the knees or lower back, the feet can be placed wider apart, or the pose can be practiced with the back supported against a wall. Pregnant individuals or those with abdominal discomfort can widen the stance further to create more space and avoid compression. If holding the pose with hands in a prayer position is challenging, using a sturdy object, such as the back of a chair, for support can help maintain stability."
  },
  {
    "id": 20,
    "name": "Frog Pose",
    "modification": "If you have knee, hip, or lower back concerns, place a folded blanket or cushion under the knees for extra cushioning and support. To protect the knees, use a bolster or block between the legs to reduce the intensity of the stretch, especially if the hips are tight. For those with limited flexibility, consider reducing the depth of the pose by not lowering the torso as far toward the floor—allow your body to gradually open as flexibility increases. If the deep stretch is too intense, avoid going into the full expression of the pose and instead focus on the alignment and gentle engagement of the legs. To further support the posture, you can rest your forearms on the floor instead of keeping the arms straight, which helps reduce strain on the shoulders and upper body."
  },
  {
    "id": 21,
    "name": "Goddess Pose",
    "modification": "For individuals with tight hips, knees, or lower back issues, a wider stance may be beneficial to reduce strain. Placing a block or cushion under the hips can also provide additional support, especially if you’re unable to fully bend your knees or hold the squat for long periods. If knee discomfort arises, consider reducing the depth of the squat, only bending the knees as much as feels comfortable while keeping the knees aligned with the toes to avoid excessive pressure on the knee joints. For those with difficulty holding their arms overhead, the arms can be lowered to shoulder height or extended in front of the body to help with stability. To support the lower back, it’s important to engage the core and avoid arching the back excessively—slightly tucking the pelvis and drawing the navel in can help maintain a neutral spine. Using a wall or other support can also help with balance and alignment, particularly for beginners or those with balance concerns."
  },
  {
    "id": 22,
    "name": "Pyramid Pose",
    "modification": "To modify Pyramid Pose, you can start by using yoga blocks under your hands to bring the floor closer, especially if you find it difficult to reach the ground with your arms fully extended. This helps reduce strain on your hamstrings and lower back. If your hamstrings are tight, consider keeping a slight bend in your front knee to avoid overstretching and maintain stability. You can also reduce the depth of the forward fold by not reaching your chest too far toward the floor, which can prevent discomfort in the lower back. For those with tight hips, adjusting the width of your stance may help, making it a bit wider to allow for more space in the hips and to keep the pelvis squared. If you have knee concerns, keep your back leg slightly bent and ensure the front knee stays aligned with the ankle to avoid unnecessary strain."
  },
  {
    "id": 23,
    "name": "Lizard Pose",
    "modification": "One of the simplest modifications is to place a cushion, blanket, or block under the back knee for extra support and cushioning, which helps to alleviate pressure on the joint. If the hips feel tight, practitioners can elevate their hands on blocks or a sturdy surface, allowing for a less intense stretch while maintaining proper alignment. For those with limited flexibility in the hips or groin, it’s helpful to practice the pose with a gentler variation, such as lowering the back knee to the ground rather than keeping it extended, or modifying the depth of the lunge. If reaching the floor with the forearms is too challenging, you can stay on your hands, or place a prop under your forearms for additional support. Another modification involves using a blanket or bolster under the hips or torso to ensure that the pelvis remains in a neutral position, avoiding any strain in the lower back. Lastly, if balance is an issue, the pose can be practiced with a wider stance between the feet, or by placing the back knee on the floor to create a more stable base."
  },
  {
    "id": 24,
    "name": "Low Lunge",
    "modification": " For those with sensitive knees, placing a folded blanket, cushion, or yoga mat under the back knee can help provide comfort and support. If balance is a challenge, practitioners can place their hands on blocks on either side of the front foot or rest them on the front thigh for added stability. Tight hips or hamstrings can be accommodated by keeping the back knee slightly lifted off the floor, which reduces the depth of the stretch and makes the pose more accessible. Alternatively, the back knee can remain grounded, and the hips can stay higher to ease tension in the hip flexors. For individuals with lower back concerns, engaging the core muscles and maintaining a neutral spine will prevent over-arching and provide additional support. Pregnant practitioners can modify by keeping the torso more upright to avoid compressing the belly, and using a wall or chair for balance if needed."
  },
  {
    "id": 25,
    "name": "Crescent High Lunge",
    "modification": " For those with limited hip flexibility or tight hip flexors, it can be helpful to shorten the stance slightly to reduce strain on the hips and lower back. Placing blocks under the hands can help maintain proper alignment and provide additional support for those who lack the flexibility to reach the floor. To protect the knees, especially for those with knee pain, it’s important to ensure that the front knee is directly over the ankle and does not extend beyond the toes. If balance is a challenge, practicing the pose near a wall or using a chair for support can help improve stability. Individuals with lower back discomfort should focus on engaging the core and maintaining a neutral spine, avoiding excessive arching. For pregnant individuals or those with balance concerns, a smaller lunge and supporting props can make the pose safer and more comfortable."
  },
  {
    "id": 26,
    "name": "Warrior I",
    "modification": "If you have knee issues, you can reduce the depth of your lunge by stepping your front foot slightly closer to the back foot, ensuring that the front knee stays directly above the ankle and doesn’t extend too far forward. For individuals with tight hips or hamstrings, it may help to shorten the stance to reduce the stretch in the legs, allowing the pelvis to stay neutral and preventing strain."
  },
  {
    "id": 27,
    "name": "Warrior II",
    "modification": "If you have knee issues, you can reduce the depth of your lunge by stepping your front foot slightly closer to the back foot, ensuring that the front knee stays directly above the ankle and doesn’t extend too far forward. For individuals with tight hips or hamstrings, it may help to shorten the stance to reduce the stretch in the legs, allowing the pelvis to stay neutral and preventing strain. If shoulder tension or injury is a concern, you can lower the arms or keep them bent at a 90-degree angle rather than fully extended, which can reduce strain on the shoulders. For individuals with balance concerns or those new to yoga, using a wall or chair for support can help with stability."
  },
  {
    "id": 28,
    "name": "Warrior III",
    "modification": "For those with balance difficulties, practicing near a wall or using a sturdy prop for support can provide stability while building confidence. Placing one or both hands on blocks can reduce the strain on the shoulders and help maintain proper alignment in the torso and arms. If lifting the back leg is challenging, practitioners can start by keeping the foot lightly touching the floor or use a chair or wall for light support under the lifted leg to gradually build strength and flexibility. For those with lower back, hip, or knee issues, it may be helpful to slightly bend the standing leg, rather than keeping it straight, to reduce pressure on the joints while still activating the leg muscles. Pregnant practitioners can also modify Warrior III by avoiding deep forward bends or using a chair for extra support to maintain balance without overloading the abdominal muscles. Additionally, focusing on a slower, controlled approach with shorter holds can help build strength and stability without overstraining the body."
  },
  {
    "id": 29,
    "name": "Reverse Warrior",
    "modification": "For those with knee pain or injuries, it's important to ensure that the front knee is not extending beyond the ankle, maintaining a 90-degree angle to reduce strain. Placing a folded blanket or cushion underneath the back knee can offer extra support if practicing a variation where the back knee is on the floor. Individuals with lower back pain can focus on engaging the core and gently tilting the pelvis to avoid arching the lower back too deeply. Keeping the torso upright rather than leaning back too far helps prevent discomfort in the spine. For those with hip injuries, it may be helpful to shorten the stance and avoid going too deep into the bend of the front leg, ensuring the hips stay square rather than rotating outward. Pregnant individuals can modify the pose by reducing the depth of the lunge and keeping the torso more upright to avoid pressure on the abdomen. For those with shoulder injuries, reaching the arms overhead might be uncomfortable, so keeping the arms in a more neutral position, such as extending one arm forward and the other reaching back, or bringing the arms to a more relaxed position at shoulder height, can be an effective modification."
  },
  {
    "id": 30,
    "name": "Extended Side Angle",
    "modification": "For individuals with tight hips or limited flexibility, placing a block under the bottom hand can help bring the floor closer, providing more support and reducing strain on the shoulder and lower back. Those with knee or ankle concerns can widen their stance, ensuring the front knee is aligned with the ankle and not pushing beyond the toes, which will prevent undue stress on the joints. For individuals with lower back issues, it's important to engage the core and avoid over-arching the back, keeping the torso long and the body in one continuous line from the back foot through the fingertips. Pregnant individuals or those with shoulder injuries can modify the pose by keeping the top arm bent, reaching up toward the ceiling or even resting the hand on the hip, to avoid overextending the shoulder. Finally, individuals who find it difficult to reach the floor with the hand can use a block or adjust the angle of the torso to ensure they feel a deep stretch without compromising form or alignment."
  },
  {
    "id": 31,
    "name": "Triangle Pose",
    "modification": " For individuals with tight hamstrings or limited flexibility, placing a block under the lower hand can help support the body and reduce strain, allowing for a more comfortable stretch. If you have tight hips or a stiff lower back, keeping a slight bend in the front knee can alleviate pressure and prevent overextending, helping to maintain a strong, stable base. To avoid straining the neck or back, those with neck or back issues can keep the gaze forward or down rather than up, reducing the twist and keeping the spine neutral. For individuals with balance challenges, practicing the pose near a wall or using a prop for support can provide additional stability. Lastly, if pregnant or in the later stages of pregnancy, modifying the stance by shortening the distance between the feet or placing the hand on the thigh (instead of the floor) can help avoid excessive pressure on the abdomen."
  },
  {
    "id": 32,
    "name": "Half Moon Pose",
    "modification": "Beginners or those with balance challenges can place a yoga block under the lower hand for additional support and to bring the ground closer, making it easier to maintain stability. Instead of reaching the top arm toward the sky, the raised hand can rest on the hip to reduce the intensity of the pose and focus on alignment. For individuals with neck strain, it is beneficial to keep the head in a neutral position, gazing straight ahead or slightly downward, rather than looking up toward the raised hand. To protect the lower back or hips, it's important to keep the standing knee slightly bent, avoiding over-arching the spine, and engaging the core to maintain stability. Pregnant practitioners or those with sensitive lower backs can modify the pose by using a wall for extra support or practicing with a wider stance to reduce pressure."
  },
  {
    "id": 33,
    "name": "Side Plank Pose",
    "modification": "For those with wrist discomfort or injury, practicing the pose on the forearm instead of the hand is a common modification. This reduces the strain on the wrists while still allowing for the core and shoulder engagement. Another option is to place a block under the lower hip to support the body and help lift the pelvis, making the pose more accessible for beginners or those with limited flexibility. For additional stability, you can keep the bottom knee on the ground, which helps distribute the weight more evenly and reduces the intensity of the pose. If balancing on one hand is too challenging, you can stagger the feet by placing the top foot in front of the bottom foot, offering a wider base of support. Another modification is to reduce the lift of the top leg or keep it grounded for a less intense version of the pose. For those with neck or shoulder concerns, keeping the head aligned with the body or looking down rather than lifting the gaze can help alleviate strain."
  },
  {
    "id": 34,
    "name": "Upward Plank Pose",
    "modification": "Beginners or individuals with limited wrist or shoulder strength can practice Reverse Tabletop Pose, where the knees are bent, and the feet are flat on the floor, reducing the intensity on the wrists and hamstrings. To alleviate wrist discomfort, practitioners can place a folded towel or yoga wedge under their hands or turn the fingers outward slightly to reduce strain. For individuals with tight hamstrings, keeping the knees slightly bent instead of fully extended can ease tension and make it easier to lift the hips. Using a yoga block placed under the sacrum can also provide support for the lower back, allowing the practitioner to focus on opening the chest without bearing full weight on the arms. Additionally, maintaining a smaller range of motion by lifting the hips only partway can help build strength and confidence over time."
  },
  {
    "id": 35,
    "name": "Chair Pose",
    "modification": " For those with knee issues, it's important to avoid excessive pressure on the knees by keeping the knees aligned with the toes and not allowing them to extend beyond the toes. Using a yoga block between the thighs can help encourage proper alignment by gently squeezing the block to engage the inner thighs. If lower back pain is a concern, it's helpful to practice with a slightly less deep bend in the knees and focus on maintaining a long, straight spine, lifting the chest rather than sinking into the lower back. Those with tight hips can widen their stance slightly to create more space and comfort in the pelvis, ensuring that the weight is evenly distributed through both feet. Pregnant practitioners or those with balance challenges can use a chair or wall support, especially to prevent excessive strain on the lower back and abdomen, and to reduce the intensity of the pose. For individuals with shoulder or wrist injuries, the arms can be kept in a prayer position at the chest or on the hips instead of extending overhead, reducing strain on the shoulders and wrists."
  },
  {
    "id": 36,
    "name": "Eagle Pose",
    "modification": " For individuals with tight hips or knee, ankle, or hip injuries, one can modify the pose by keeping the bottom leg slightly bent rather than deeply squatting, or by not fully crossing the legs. Instead of wrapping the top leg around the bottom, one can simply place the top foot on the floor for more stability and less strain. If the shoulders are tight or there is discomfort in the arms, the arms can be kept out to the sides or on the hips instead of fully crossing them in front of the body. Using a strap around the arms or holding a block between the palms can also provide additional support and reduce strain on the shoulders. For those with lower back issues, focusing on keeping the spine long and engaged rather than deeply twisting or arching the back can help protect the lower back. Practicing near a wall or using a chair for balance can also be helpful, especially for beginners or those with balance challenges."
  },
  {
    "id": 37,
    "name": "Standing Forward Fold",
    "modification": "For those with tight hamstrings or limited flexibility, bending the knees slightly can help alleviate strain on the lower back and allow for a more comfortable fold. Using blocks under the hands can also provide support, especially for individuals who find it difficult to reach the floor. For those with lower back pain, keeping a slight bend in the knees and focusing on hinging from the hips rather than rounding the spine can help protect the back. Pregnant individuals should avoid deep forward folds and may benefit from placing a block or bolster under the hands to maintain a more upright stance. If neck strain is a concern, avoiding the tendency to let the head hang too heavily can be alleviated by gently drawing the chin toward the chest or using props for support."
  },
  {
    "id": 38,
    "name": "Wide-Legged Forward Fold",
    "modification": "If you have tight hamstrings or lower back discomfort, bending the knees slightly can relieve strain and allow for a more comfortable stretch. Using yoga blocks under the hands or under the forehead can help support the torso, reduce tension in the neck and shoulders, and encourage a longer spine. If you have tight hips, try turning the toes slightly inward to reduce the intensity of the stretch and allow for a deeper fold. For those with lower back pain or limited flexibility, you may also choose to lower the torso by leaning on the blocks rather than reaching the floor, which helps to avoid rounding the spine. Always focus on lengthening the spine first and folding from the hips, rather than forcing the fold, to ensure proper alignment and avoid strain."
  },
  {
    "id": 39,
    "name": "Thread the Needle",
    "modification": " For extra neck support, place a yoga block or bolster under the head instead of letting it rest on the mat. If tight hips or knees make it uncomfortable to sit back fully, try placing a folded blanket under the knees or practicing the pose on a chair, leaning forward slightly and threading one arm under the other. For shoulder sensitivity, keep the threading arm bent at the elbow instead of extending it fully, reducing strain. To deepen the stretch, you can walk the extended arm farther forward or rest the opposite arm on the lower back for a gentle bind."
  },
  {
    "id": 40,
    "name": "Gate Pose",
    "modification": "If you have tight hips or hamstrings, you can reduce the intensity of the side stretch by keeping the torso more upright and not leaning too deeply toward the straight leg. This modification helps prevent overstretching and discomfort in the lower back. For those with knee or hip issues, placing a folded blanket or cushion under the knee of the bent leg can provide extra cushioning and support, helping to alleviate pressure. If reaching the arm overhead is too intense or uncomfortable, you can modify by keeping the arm extended to the side, or place the hand on a block for added support. Additionally, those with shoulder or neck concerns may find it more comfortable to keep the neck in a neutral position, avoiding excessive rotation, and focusing on the lengthening of the spine instead. Using a block under the hand or forearm, if necessary, can also help bring the floor closer, reducing strain in the arms and shoulders."
  },
  {
    "id": 41,
    "name": "Cobra Pose",
    "modification": "For those with lower back discomfort or spinal issues, it’s helpful to engage the core muscles slightly to avoid over-arching the lower back. Placing a folded blanket or cushion under the pelvis can also provide support and reduce strain on the lower back. If neck strain is a concern, practitioners should keep the neck neutral by gazing downward rather than lifting the head too high, ensuring the neck remains aligned with the spine. For beginners or those with limited back flexibility, a more gentle version of the pose can be practiced by keeping the elbows bent and lifting only the upper chest, rather than fully straightening the arms. This modification reduces the intensity of the backbend and makes it more accessible. Pregnant practitioners, particularly in the later stages of pregnancy, should avoid deep backbends that put pressure on the abdomen and instead perform a more shallow lift or even avoid the pose entirely. Using props such as a block under the hands or chest can also help modify the depth of the stretch, making it safer and more comfortable."
  },
  {
    "id": 42,
    "name": "Camel Pose",
    "modification": "For those with tight hips, knees, or lower back, placing a block or cushion under the knees for added support can reduce strain. If reaching the heels is challenging, practitioners can use a yoga belt around their ankles, holding the belt with their hands to gently ease the stretch. To protect the lower back, keeping a slight bend in the lower back rather than overextending can help maintain spinal integrity. For individuals with neck discomfort or who are new to backbends, keeping the head in a neutral position rather than dropping it back can reduce strain on the cervical spine. Additionally, placing the hands on the lower back, instead of reaching for the heels, can help maintain a more controlled and stable alignment. For beginners or those with limited flexibility, performing a modified version of the pose with only a slight backbend while keeping the hips directly over the knees can still offer the benefits of chest opening and spinal stretch without overexertion."
  },
  {
    "id": 43,
    "name": "Bridge Pose",
    "modification": "If you have neck or back discomfort, place a blanket or bolster under your shoulders to provide extra support and reduce the strain on your spine. For those with tight hips or lower back issues, you can place a block under your sacrum to elevate the hips, allowing the body to relax more deeply into the pose without overextending. To make the pose easier on the knees, try placing a block or cushion between the thighs to gently engage the inner thighs and avoid splaying the knees out. If you have tight shoulders, you can keep your arms extended by your sides rather than interlacing your fingers underneath your back, which allows for a more comfortable position without straining the shoulders. For those with limited flexibility in the legs, consider using a strap around the thighs to help guide the knees into alignment and support proper engagement of the legs."
  },
  {
    "id": 44,
    "name": "Locust Pose",
    "modification": "For individuals with lower back discomfort, placing a cushion or blanket under the pelvis can provide extra support and alleviate pressure on the spine. Instead of lifting both legs and the chest simultaneously, practitioners can start by lifting just one leg at a time while keeping the chest grounded. This modification reduces the intensity and allows the muscles to gradually build strength. For those with shoulder or neck issues, keeping the arms extended alongside the body or using a yoga block under the forehead to support the neck can help maintain proper alignment and prevent strain. To ease into the pose, practitioners can also start by practicing a gentler variation, such as Bhujangasana (Cobra Pose), to build strength in the back and shoulders before attempting full Locust Pose. Engaging the core throughout the pose and avoiding overextension can further protect the lower back and prevent injury."
  },
  {
    "id": 45,
    "name": "Half Pigeon Pose",
    "modification": " To protect the knees, practitioners can place a folded blanket or cushion under the bent knee for added support, especially if there is discomfort in that area. If the hips are tight or the pelvis is not aligned, placing a block or blanket under the hip of the bent leg can help level the pelvis and reduce strain. For those with tight quadriceps or hips, it may be helpful to keep the back leg bent rather than straight, which can ease the stretch and prevent discomfort in the lower back. Additionally, using props like blocks or pillows under the upper body can offer support if lowering the chest to the floor feels too intense. For individuals with sciatica or lower back pain, a gentler version of the pose with a less intense forward fold can be practiced by keeping the torso upright or leaning slightly forward."
  },
  {
    "id": 46,
    "name": "Boat Pose",
    "modification": "For beginners or those with weaker core strength, starting with bent knees rather than fully extending the legs can make the pose more manageable. Placing a yoga block or cushion under the hips can provide extra support, helping to alleviate pressure on the lower back and allowing for a gentler engagement of the core muscles. If maintaining balance is difficult, practicing near a wall or using props for stability can provide additional support. For individuals with neck issues, it’s important to avoid straining the neck by keeping the spine long and neutral and refraining from curling the neck or chin toward the chest. Another modification is to perform a half-Boat Pose by keeping the upper body lifted and the legs only partially extended, gradually increasing the range of motion as strength and balance improve."
  },
  {
    "id": 47,
    "name": "Plow Pose",
    "modification": " For those with limited flexibility in the hamstrings or lower back, you can place a bolster, cushion, or folded blanket under your hips to elevate them slightly, reducing strain as you bring your legs overhead. If your feet do not comfortably reach the floor, rest them on a chair, a block, or another supportive surface to avoid overstretching the spine and hamstrings. To protect the neck and shoulders, use a folded blanket under the shoulders to create a gentle lift and reduce pressure on the cervical spine. If extending the arms overhead feels challenging, keep the arms at your sides or place the hands on your lower back for added support. Practitioners with tight shoulders can clasp a yoga strap between their hands instead of interlacing their fingers behind the back. Always move into the pose gradually, and if the full expression feels too intense, you can practice a supported variation like Legs-Up-The-Wall Pose (Viparita Karani) to gain similar benefits in a more restorative way."
  },
  {
    
    "id": 48,
    "name": "Dancer Pose",
    "modification": "For those with limited flexibility in the hips or shoulders, a simpler variation can be performed by keeping the lifted leg lower and avoiding a deep backbend. Instead of holding the foot with the hand, using a yoga strap around the ankle or foot can provide support while still allowing for a stretch in the front of the body. To protect the knees or ankles, practitioners can keep the standing leg slightly bent rather than locking it straight. If balance is a challenge, practicing near a wall for support can help maintain stability and prevent falls. For those with back issues, it's helpful to focus on lengthening the spine and avoiding deep arching by keeping the backbend gentle and engaging the core muscles to support the lower back. Pregnant individuals or those with certain health conditions can modify the pose by reducing the range of motion, keeping the chest and hips open without the full backbend, or practicing the pose with hands on the hips instead of extending them forward."
  },
  {
    "id": 49,
    "name": "Bow Pose",
    "modification": " For those with limited flexibility in the back or thighs, using a yoga strap around the ankles can help bridge the gap, allowing practitioners to hold the strap instead of reaching directly for the feet. Placing a folded blanket under the hips can provide extra cushioning and support, especially for individuals with sensitive hip bones. If lifting both legs and the chest feels too intense, the pose can be modified by lifting one leg at a time while keeping the opposite leg and arm grounded. Alternatively, practicing a partial Bow Pose by keeping the thighs on the mat and focusing on lifting just the chest can help build strength and flexibility gradually. To reduce pressure on the lower back, engaging the core muscles and focusing on lengthening the spine rather than forcing the backbend can also make the pose more accessible."
  },
  {
    "id": 50,
    "name": "Wheel Pose",
    "modification": "For individuals with limited shoulder or hip flexibility, using blocks under the hands or feet can provide extra support and help maintain proper alignment. For those with wrist discomfort, performing the pose with the hands turned outward or using wrist guards can reduce strain on the wrists. To support the lower back, placing a block under the sacrum or practicing a gentler backbend like Bridge Pose can help build the necessary strength and flexibility gradually. If lifting into the full wheel is challenging, practicing backbends such as Cobra Pose or Upward Facing Dog can build strength in the arms, core, and back. For individuals with neck issues, it is important to keep the neck neutral and avoid craning the head back too far; using a cushion or blanket under the head can provide extra support. Additionally, for those with limited strength in the arms or legs, keeping the feet closer to the body or lifting only halfway into the pose can make it more manageable while still offering many of the benefits of the backbend."
  }
]