[
  {
    "id": 1,
    "name": "Mountain Pose",
    "modification": "For those with ankle or knee issues, widening the stance by separating the feet a few inches can provide extra stability and reduce strain. If balance is a concern, standing near a wall or using a block under your feet for support can help maintain the pose with more confidence. For practitioners with shoulder tension or limited mobility, keeping the arms by the sides or placing the palms facing inward rather than reaching upwards can help alleviate discomfort."
  },
  {
    "id": 2,
    "name": "Downward-Facing Dog",
    "modification": "For individuals with tight hamstrings or calves, keeping the knees bent can prevent overstraining the legs and lower back. This modification helps maintain a long, neutral spine, avoiding rounding in the back, and allows the body to relax into the stretch more comfortably. It also ensures that the core remains engaged without creating excessive tension in the lower back or hamstrings. If reaching the heels to the floor is difficult, using props like blocks or cushions under the feet can provide support. Elevating the heels allows practitioners to focus on lifting the hips and lengthening the spine rather than forcing the heels down, which can lead to unnecessary strain. For those with wrist discomfort or injuries, instead of pressing directly into the palms, practitioners can make fists, use a yoga block under the hands, or try a forearm variation of the pose. These adjustments reduce pressure on the wrists while still engaging the shoulders and core. Using a wedge-shaped block to elevate the hands slightly can also provide additional support and ease strain on the wrists."
  },
  {
    "id": 3,
    "name": "Plank Pose",
    "modification": "One simple modification is to perform the pose on your forearms instead of your hands, known as Forearm Plank. This reduces the pressure on the wrists and can help you maintain better alignment in the shoulders. If you still find it difficult to maintain the pose, try lowering your knees to the ground. This modification lightens the load on the core and helps you focus on building strength gradually without compromising form. Using props such as yoga blocks under the hands or a cushion under the knees can further reduce strain and provide more support during the hold. Another accessible option is to perform a wall plank by placing your hands on a wall at shoulder height and stepping your feet back until your body forms an angled line. This variation eliminates pressure on the wrists and shoulders while still engaging the core and promoting proper alignment. Additionally, you can reduce the duration of the hold, working up to longer times as you build strength and endurance. By adjusting the pose to fit your body’s needs, you can still enjoy the benefits of Plank Pose while minimizing the risk of injury."
  },
  {
    "id": 4,
    "name": "Four-Limbed Staff Pose",
    "modification": "One common modification is to lower the knees to the ground, which reduces the amount of weight placed on the arms and core while still engaging the upper body. This is particularly helpful for beginners or those with wrist, shoulder, or back limitations. Another modification is performing the pose with the elbows slightly bent rather than locked, which prevents unnecessary strain on the shoulder joints and helps to maintain proper alignment. To further reduce the challenge, practitioners can also perform the pose by lowering down slowly and keeping the chest off the floor, coming into a half-chaturanga position before transitioning into upward dog. Using props like blocks under the chest or hands can also assist in maintaining alignment and stability. It’s important to always focus on keeping the body in a straight line from head to heels, and if that feels difficult, the knees-down variation or a more gradual approach is a great way to build strength and confidence."
  },
  {
    "id": 5,
    "name": "Upward-Facing Dog",
    "modification": "If the backbend feels too intense or if there's lower back discomfort, you can also perform a gentler version by keeping the thighs on the mat, creating a variation called Cobra Pose (Bhujangasana), which still engages the upper back and chest but with less strain on the lower spine. For those with tight hips or lower back concerns, placing the knees on the mat can help by taking some pressure off the lower body while still allowing the chest and upper body to lift."
  },
  {
    "id": 6,
    "name": "Child's Pose",
    "modification": "If you have knee discomfort or injury, placing a cushion or blanket under the knees can provide additional support. You can also try keeping the knees slightly apart, rather than together, to reduce pressure on the knees and make the pose more comfortable. If you experience tightness in the hips or lower back, using a bolster or pillow between your legs or under your chest can help support the body and promote a deeper, more restorative stretch. For individuals with neck discomfort, placing a small cushion under the forehead or using a block to elevate the head can prevent strain and allow for a more relaxed position. Additionally, if the full forward bend is difficult, you can modify the pose by simply sitting on the heels with a slight lean forward, keeping the chest lifted to avoid excess pressure on the back."
  },
  {
    "id": 7,
    "name": "Warrior I",
    "modification": "If you have knee issues, you can reduce the depth of your lunge by stepping your front foot slightly closer to the back foot, ensuring that the front knee stays directly above the ankle and doesn’t extend too far forward. For individuals with tight hips or hamstrings, it may help to shorten the stance to reduce the stretch in the legs, allowing the pelvis to stay neutral and preventing strain."
  },
  {
    "id": 8,
    "name": "Warrior II",
    "modification": "If you have knee issues, you can reduce the depth of your lunge by stepping your front foot slightly closer to the back foot, ensuring that the front knee stays directly above the ankle and doesn’t extend too far forward. For individuals with tight hips or hamstrings, it may help to shorten the stance to reduce the stretch in the legs, allowing the pelvis to stay neutral and preventing strain. If shoulder tension or injury is a concern, you can lower the arms or keep them bent at a 90-degree angle rather than fully extended, which can reduce strain on the shoulders. For individuals with balance concerns or those new to yoga, using a wall or chair for support can help with stability."
  },
  {
    "id": 9,
    "name": "Warrior III",
    "modification": "For those with balance difficulties, practicing near a wall or using a sturdy prop for support can provide stability while building confidence. Placing one or both hands on blocks can reduce the strain on the shoulders and help maintain proper alignment in the torso and arms. If lifting the back leg is challenging, practitioners can start by keeping the foot lightly touching the floor or use a chair or wall for light support under the lifted leg to gradually build strength and flexibility. For those with lower back, hip, or knee issues, it may be helpful to slightly bend the standing leg, rather than keeping it straight, to reduce pressure on the joints while still activating the leg muscles. Pregnant practitioners can also modify Warrior III by avoiding deep forward bends or using a chair for extra support to maintain balance without overloading the abdominal muscles. Additionally, focusing on a slower, controlled approach with shorter holds can help build strength and stability without overstraining the body."
  },
  {
    "id": 10,
    "name": "Reverse Warrior",
    "modification": "For those with knee pain or injuries, it's important to ensure that the front knee is not extending beyond the ankle, maintaining a 90-degree angle to reduce strain. Placing a folded blanket or cushion underneath the back knee can offer extra support if practicing a variation where the back knee is on the floor. Individuals with lower back pain can focus on engaging the core and gently tilting the pelvis to avoid arching the lower back too deeply. Keeping the torso upright rather than leaning back too far helps prevent discomfort in the spine. For those with hip injuries, it may be helpful to shorten the stance and avoid going too deep into the bend of the front leg, ensuring the hips stay square rather than rotating outward. Pregnant individuals can modify the pose by reducing the depth of the lunge and keeping the torso more upright to avoid pressure on the abdomen. For those with shoulder injuries, reaching the arms overhead might be uncomfortable, so keeping the arms in a more neutral position, such as extending one arm forward and the other reaching back, or bringing the arms to a more relaxed position at shoulder height, can be an effective modification."
  },
  {
    "id": 11,
    "name": "Extended Side Angle",
    "modification": "For individuals with tight hips or limited flexibility, placing a block under the bottom hand can help bring the floor closer, providing more support and reducing strain on the shoulder and lower back. Those with knee or ankle concerns can widen their stance, ensuring the front knee is aligned with the ankle and not pushing beyond the toes, which will prevent undue stress on the joints. For individuals with lower back issues, it's important to engage the core and avoid over-arching the back, keeping the torso long and the body in one continuous line from the back foot through the fingertips. Pregnant individuals or those with shoulder injuries can modify the pose by keeping the top arm bent, reaching up toward the ceiling or even resting the hand on the hip, to avoid overextending the shoulder. Finally, individuals who find it difficult to reach the floor with the hand can use a block or adjust the angle of the torso to ensure they feel a deep stretch without compromising form or alignment."
  },
  {
    "id": 12,
    "name": "Triangle Pose",
    "modification": " For individuals with tight hamstrings or limited flexibility, placing a block under the lower hand can help support the body and reduce strain, allowing for a more comfortable stretch. If you have tight hips or a stiff lower back, keeping a slight bend in the front knee can alleviate pressure and prevent overextending, helping to maintain a strong, stable base. To avoid straining the neck or back, those with neck or back issues can keep the gaze forward or down rather than up, reducing the twist and keeping the spine neutral. For individuals with balance challenges, practicing the pose near a wall or using a prop for support can provide additional stability. Lastly, if pregnant or in the later stages of pregnancy, modifying the stance by shortening the distance between the feet or placing the hand on the thigh (instead of the floor) can help avoid excessive pressure on the abdomen."
  },
  {
    "id": 13,
    "name": "Half Moon Pose",
    "modification": "Beginners or those with balance challenges can place a yoga block under the lower hand for additional support and to bring the ground closer, making it easier to maintain stability. Instead of reaching the top arm toward the sky, the raised hand can rest on the hip to reduce the intensity of the pose and focus on alignment. For individuals with neck strain, it is beneficial to keep the head in a neutral position, gazing straight ahead or slightly downward, rather than looking up toward the raised hand. To protect the lower back or hips, it's important to keep the standing knee slightly bent, avoiding over-arching the spine, and engaging the core to maintain stability. Pregnant practitioners or those with sensitive lower backs can modify the pose by using a wall for extra support or practicing with a wider stance to reduce pressure."
  },
  {
    "id": 14,
    "name": "Chair Pose",
    "modification": " For those with knee issues, it's important to avoid excessive pressure on the knees by keeping the knees aligned with the toes and not allowing them to extend beyond the toes. Using a yoga block between the thighs can help encourage proper alignment by gently squeezing the block to engage the inner thighs. If lower back pain is a concern, it's helpful to practice with a slightly less deep bend in the knees and focus on maintaining a long, straight spine, lifting the chest rather than sinking into the lower back. Those with tight hips can widen their stance slightly to create more space and comfort in the pelvis, ensuring that the weight is evenly distributed through both feet. Pregnant practitioners or those with balance challenges can use a chair or wall support, especially to prevent excessive strain on the lower back and abdomen, and to reduce the intensity of the pose. For individuals with shoulder or wrist injuries, the arms can be kept in a prayer position at the chest or on the hips instead of extending overhead, reducing strain on the shoulders and wrists."
  },
  {
    "id": 15,
    "name": "Goddess Pose",
    "modification": "For individuals with tight hips, knees, or lower back issues, a wider stance may be beneficial to reduce strain. Placing a block or cushion under the hips can also provide additional support, especially if you’re unable to fully bend your knees or hold the squat for long periods. If knee discomfort arises, consider reducing the depth of the squat, only bending the knees as much as feels comfortable while keeping the knees aligned with the toes to avoid excessive pressure on the knee joints. For those with difficulty holding their arms overhead, the arms can be lowered to shoulder height or extended in front of the body to help with stability. To support the lower back, it’s important to engage the core and avoid arching the back excessively—slightly tucking the pelvis and drawing the navel in can help maintain a neutral spine. Using a wall or other support can also help with balance and alignment, particularly for beginners or those with balance concerns."
  },
  {
    "id": 16,
    "name": "Crescent High Lunge",
    "modification": " For those with limited hip flexibility or tight hip flexors, it can be helpful to shorten the stance slightly to reduce strain on the hips and lower back. Placing blocks under the hands can help maintain proper alignment and provide additional support for those who lack the flexibility to reach the floor. To protect the knees, especially for those with knee pain, it’s important to ensure that the front knee is directly over the ankle and does not extend beyond the toes. If balance is a challenge, practicing the pose near a wall or using a chair for support can help improve stability. Individuals with lower back discomfort should focus on engaging the core and maintaining a neutral spine, avoiding excessive arching. For pregnant individuals or those with balance concerns, a smaller lunge and supporting props can make the pose safer and more comfortable."
  },
  {
    "id": 17,
    "name": "Low Lunge",
    "modification": " For those with sensitive knees, placing a folded blanket, cushion, or yoga mat under the back knee can help provide comfort and support. If balance is a challenge, practitioners can place their hands on blocks on either side of the front foot or rest them on the front thigh for added stability. Tight hips or hamstrings can be accommodated by keeping the back knee slightly lifted off the floor, which reduces the depth of the stretch and makes the pose more accessible. Alternatively, the back knee can remain grounded, and the hips can stay higher to ease tension in the hip flexors. For individuals with lower back concerns, engaging the core muscles and maintaining a neutral spine will prevent over-arching and provide additional support. Pregnant practitioners can modify by keeping the torso more upright to avoid compressing the belly, and using a wall or chair for balance if needed."
  },
  {
    "id": 18,
    "name": "Pyramid Pose",
    "modification": "To modify Pyramid Pose, you can start by using yoga blocks under your hands to bring the floor closer, especially if you find it difficult to reach the ground with your arms fully extended. This helps reduce strain on your hamstrings and lower back. If your hamstrings are tight, consider keeping a slight bend in your front knee to avoid overstretching and maintain stability. You can also reduce the depth of the forward fold by not reaching your chest too far toward the floor, which can prevent discomfort in the lower back. For those with tight hips, adjusting the width of your stance may help, making it a bit wider to allow for more space in the hips and to keep the pelvis squared. If you have knee concerns, keep your back leg slightly bent and ensure the front knee stays aligned with the ankle to avoid unnecessary strain."
  },
  {
    "id": 19,
    "name": "Wide-Legged Forward Fold",
    "modification": "If you have tight hamstrings or lower back discomfort, bending the knees slightly can relieve strain and allow for a more comfortable stretch. Using yoga blocks under the hands or under the forehead can help support the torso, reduce tension in the neck and shoulders, and encourage a longer spine. If you have tight hips, try turning the toes slightly inward to reduce the intensity of the stretch and allow for a deeper fold. For those with lower back pain or limited flexibility, you may also choose to lower the torso by leaning on the blocks rather than reaching the floor, which helps to avoid rounding the spine. Always focus on lengthening the spine first and folding from the hips, rather than forcing the fold, to ensure proper alignment and avoid strain."
  },
  {
    "id": 20,
    "name": "Standing Split",
    "modification": "If you have tight hamstrings or limited flexibility, keep a slight bend in the standing leg to avoid over-stretching the hamstrings and straining the lower back. Use yoga blocks under the hands for added support, which helps reduce the pressure on the wrists, shoulders, and core while still allowing for a deep stretch in the hamstrings and hip flexors. If balance is an issue, place one hand on a wall or sturdy object to provide extra stability and prevent tipping over. For those with lower back or hip issues, avoid pulling the head towards the knee and instead focus on lengthening the spine and engaging the core to reduce strain on the lower back. Keeping the hips squared rather than allowing the lifted leg to open to the side can also help protect the hips and prevent discomfort. Additionally, if you have knee problems, it may be helpful to use a cushion or blanket under the knee of the standing leg for extra padding or to bend the standing leg slightly for better alignment and to avoid excessive pressure on the knee joint."
  },
  {
    "id": 21,
    "name": "Tree Pose",
    "modification": "For those with balance challenges, practicing near a wall or holding onto a sturdy surface for support can help maintain stability while developing strength and confidence in the pose. Instead of placing the foot high on the inner thigh, individuals can lower the foot to the ankle or shin to reduce strain on the knee and provide more stability. For those with hip or knee issues, keeping the standing leg slightly bent rather than locked can help alleviate discomfort and provide more control. If it's difficult to keep the hands in a prayer position, the arms can be extended overhead, or they can be placed on the hips to reduce strain on the shoulders. Additionally, those with lower back issues should focus on lengthening the spine and avoiding excessive arching, which can be achieved by keeping the pelvis in a neutral position. Using props like a block under the raised foot for additional support or adjusting the position of the raised leg to reduce tension is another helpful modification."
  },
  {
    "id": 22,
    "name": "Dancer Pose",
    "modification": "For those with limited flexibility in the hips or shoulders, a simpler variation can be performed by keeping the lifted leg lower and avoiding a deep backbend. Instead of holding the foot with the hand, using a yoga strap around the ankle or foot can provide support while still allowing for a stretch in the front of the body. To protect the knees or ankles, practitioners can keep the standing leg slightly bent rather than locking it straight. If balance is a challenge, practicing near a wall for support can help maintain stability and prevent falls. For those with back issues, it's helpful to focus on lengthening the spine and avoiding deep arching by keeping the backbend gentle and engaging the core muscles to support the lower back. Pregnant individuals or those with certain health conditions can modify the pose by reducing the range of motion, keeping the chest and hips open without the full backbend, or practicing the pose with hands on the hips instead of extending them forward."
  },
  {
    "id": 23,
    "name": "Eagle Pose",
    "modification": " For individuals with tight hips or knee, ankle, or hip injuries, one can modify the pose by keeping the bottom leg slightly bent rather than deeply squatting, or by not fully crossing the legs. Instead of wrapping the top leg around the bottom, one can simply place the top foot on the floor for more stability and less strain. If the shoulders are tight or there is discomfort in the arms, the arms can be kept out to the sides or on the hips instead of fully crossing them in front of the body. Using a strap around the arms or holding a block between the palms can also provide additional support and reduce strain on the shoulders. For those with lower back issues, focusing on keeping the spine long and engaged rather than deeply twisting or arching the back can help protect the lower back. Practicing near a wall or using a chair for balance can also be helpful, especially for beginners or those with balance challenges."
  },
  {
    "id": 24,
    "name": "Crow Pose",
    "modification": "For individuals with wrist discomfort or weakness, using yoga blocks under the hands or practicing on a soft surface can help reduce pressure on the wrists. Alternatively, placing a cushion or mat under the knees can provide extra support when transitioning into the pose. If balance is challenging, practitioners can practice by placing a block or cushion under the feet for additional stability, or they can try the pose with their feet hovering just above the floor rather than lifting completely. For those with shoulder injuries, focusing on building strength and flexibility in the shoulders before attempting the full pose is important, and using a strap or a resistance band around the arms can help create stability without straining the joints. To modify for core engagement, beginners can start by practicing the position with the knees resting lightly on the arms, rather than fully lifting into the balance. Pregnant individuals or those with certain injuries may want to skip the full balancing aspect and focus on the arm positioning and strength-building components of the pose."
  },
  {
    "id": 25,
    "name": "Side Crow Pose",
    "modification": "Beginners or those developing core and arm strength can start by practicing the twisting motion while keeping their feet on the floor, placing their hands on blocks for extra elevation and support. For individuals struggling with balance, using a bolster or cushion under the hips can provide a safety net in case of a fall. If wrist discomfort is an issue, practicing on a soft surface or placing a folded towel under the hands can reduce pressure. For additional support, practitioners can rest both knees on one upper arm rather than balancing with one leg extended, which reduces the difficulty of the pose. Alternatively, keeping the bottom knee on the ground and lifting only the top leg allows for a gentler introduction to the pose. Using a wall for support by positioning it in front of the face or side body can also help build confidence and alignment."
  },
  {
    "id": 26,
    "name": "Garland Pose",
    "modification": "For those with tight hips or limited ankle mobility, placing a folded blanket, yoga wedge, or block under the heels can provide support and help maintain balance. Practitioners with difficulty squatting deeply can sit on a block or low stool, allowing the hips to rest while keeping the spine elongated. To reduce strain on the knees or lower back, the feet can be placed wider apart, or the pose can be practiced with the back supported against a wall. Pregnant individuals or those with abdominal discomfort can widen the stance further to create more space and avoid compression. If holding the pose with hands in a prayer position is challenging, using a sturdy object, such as the back of a chair, for support can help maintain stability."
  },
  {
    "id": 41,
    "name": "Cobra Pose",
    "modification": "If you have lower back discomfort, avoid coming into a deep backbend and keep the elbows slightly bent for support. Use a block under your pelvis if you find it challenging to engage the lower body. Keep your elbows close to your body and avoid collapsing the chest."
  },
  {
    "id": 42,
    "name": "Locust Pose",
    "modification": "If you have neck or back discomfort, keep your head and chest slightly lower to avoid strain. You can also lift the chest less and keep the arms out in front of you rather than reaching back to hold the legs. Use a cushion under the belly for more comfort."
  },
  {
    "id": 43,
    "name": "Bow Pose",
    "modification": "If you're working on flexibility, use a yoga belt or strap around your feet for support. Engage the legs and avoid overextending the back to protect the spine. If you're pregnant, avoid this deep backbend and opt for a gentler variation."
  },
  {
    "id": 44,
    "name": "Puppy Pose",
    "modification": "If your shoulders feel tense, keep the chest lifted and avoid dropping the forehead all the way to the floor. You can use a block under your chest for support or keep the knees slightly bent if your back feels tight."
  },
  {
    "id": 45,
    "name": "Cat-Cow Pose",
    "modification": "If you have neck or back issues, move slowly and focus on gentle movements. Keep the core engaged during the cow pose to avoid over-arching the lower back. Use a cushion under the knees if you're uncomfortable on the floor."
  },
  {
    "id": 46,
    "name": "Thread the Needle",
    "modification": "To make the stretch more accessible, keep the lower arm bent and only reach the upper arm over the head if comfortable. You can place a block under the head for support if your neck feels strained. Engage the core to help protect the lower back."
  },
  {
    "id": 47,
    "name": "Reverse Plank Pose",
    "modification": "If lifting the hips fully is challenging, keep the knees bent with feet flat on the ground in a tabletop position to reduce the intensity. Place a folded blanket or yoga block under the hands if wrist discomfort arises. Engage the core and focus on lifting the chest to maintain alignment, even in a modified variation."
  },
  {
    "id": 48,
    "name": "Pigeon Pose",
    "modification": "If you're working on flexibility, use a cushion or blanket under the hips for added support. Keep your back leg extended straight and avoid collapsing into the lower back. If you're pregnant, use a bolster under the chest or come into a supported variation."
  },
  {
    "id": 49,
    "name": "Plow Pose",
    "modification": "If touching the floor with your toes is challenging, keep your legs bent and only lower them as far as comfortable. You can also place a blanket or cushion under your back for additional support and to reduce strain on the neck. If you experience discomfort in your shoulders, avoid deepening the stretch too much and focus on lifting your hips instead of trying to touch your feet to the floor."
  },
  {
    "id": 50,
    "name": "Supine Twist",
    "modification": "If you have neck or lower back discomfort, keep the knees bent or use a cushion under the knees for support. You can also modify the twist by keeping the shoulders on the ground or reducing the depth of the twist. Avoid forcefully twisting if you're pregnant."
  },
  {
    "id": 51,
    "name": "Half Lord of the Fishes",
    "modification": "If the twist is too intense, keep the bottom leg extended instead of bent. You can sit on a cushion or block to make the twist more accessible, and always keep the spine tall to avoid compressing the back. If you're pregnant, avoid deep twisting and opt for a gentler version."
  },
  {
    "id": 52,
    "name": "Side Plank",
    "modification": "If you're building strength, start with the lower knee on the ground for added stability. You can also keep the bottom knee bent to make the pose more accessible. Focus on engaging the core and avoiding any sagging in the hips."
  },
  {
    "id": 53,
    "name": "Wild Thing",
    "modification": "If your back is tight, use a block under your hand for extra support or keep the feet on the floor instead of lifting them. Avoid deep backbends if you have lower back discomfort, and engage the core to protect the spine."
  },
  {
    "id": 54,
    "name": "Tiger Pose",
    "modification": "If your knees or wrists are sensitive, perform this pose with a cushion under the knees or modify by keeping the torso upright. Keep the core engaged and avoid overextending the back. You can also bend the top knee slightly to reduce strain on the lower back."
  },
  {
    "id": 55,
    "name": "Gate Pose",
    "modification": "If you have tight hips or legs, reduce the angle of the bend in the extended leg and focus on reaching for the foot rather than the floor. Use a block under the hand for support, and avoid collapsing into the lower back by keeping the core engaged."
  },
  {
    "id": 56,
    "name": "Frog Pose",
    "modification": "To make the stretch more comfortable, place blankets under the knees for extra cushioning. Keep the feet flexed and avoid over-stretching the groin area. You can also perform this pose with a gentler angle if your hips are very tight."
  },
  {
    "id": 57,
    "name": "Lizard Pose",
    "modification": "If your hips are tight, lower the back knee to the ground and keep a cushion under the knee for support. You can also use a block under the hands for added height or perform the pose with the back knee lifted for a deeper stretch."
  },
  {
    "id": 58,
    "name": "Fallen Triangle",
    "modification": "If you're working on balance, keep the top leg bent instead of straight to reduce strain. You can also place a block under the hand for extra height and support. Keep the chest open and avoid rounding the back to protect the spine."
  },
  {
    "id": 59,
    "name": "Bird of Paradise",
    "modification": "If you're unable to reach your foot or balance, use a strap around the foot to help lift it. Focus on keeping the hips square and avoid over-stretching the hamstrings. Use a wall for balance support if needed."
  },
  {
    "id": 60,
    "name": "Extended Hand-to-Big-Toe Pose",
    "modification": "If you're unable to reach the foot, use a yoga strap around the foot to help lengthen the arms. Keep the core engaged and avoid rounding the back to maintain stability. Bend the supporting leg slightly if you feel tension in the knee or lower back."
  },
  {
    "id": 81,
    "name": "Ganda Bherundasana",
    "modification": "If you're working on this advanced arm balance, practice it near a wall for support or start by holding a chin stand with feet on the floor before lifting the legs. Use a block or cushion under the head to reduce pressure. Keep the elbows bent and the core engaged for more stability."
  },
  {
    "id": 82,
    "name": "Scorpion Pose",
    "modification": "If you're new to this pose, practice a more gentle variation by keeping the feet on the floor or performing a forearm version. You can also use a block under the feet or hands to increase stability and focus on building strength gradually."
  },
  {
    "id": 83,
    "name": "Half Moon Bound Pose",
    "modification": "If you have tight hamstrings or hips, use a block under your hand for added support and modify the bind by using a strap or belt. Keep the pelvis open and engage the core to maintain balance, and avoid forcing the backbend."
  },
  {
    "id": 84,
    "name": "Hummingbird Pose",
    "modification": "This advanced balance pose can be modified by keeping the feet on the ground or using a wall for support. Focus on lifting through the chest and maintaining a strong core to help with the balance before attempting a full version."
  },
  {
    "id": 85,
    "name": "Peacock Pose",
    "modification": "If you're struggling to lift into the pose, try starting with your feet on the floor and focus on strengthening the arms and core. Use blocks under your hands for more height and work on flexibility in the legs and back before progressing to a full expression."
  },
  {
    "id": 86,
    "name": "Compass Pose",
    "modification": "If you're unable to hold the pose with the legs extended, bend the knee of the extended leg and work on lengthening the spine. You can use a strap around the foot to help lengthen the leg. Avoid forcing the stretch in the hip flexors."
  },
  {
    "id": 87,
    "name": "Sleeping Vishnu",
    "modification": "For a gentler version, keep the knees bent and the foot of the extended leg on the ground. Use a cushion or bolster under your head and shoulders for added comfort. Focus on deepening the twist without forcing it, and avoid straining the lower back."
  },
  {
    "id": 88,
    "name": "Dragonfly Pose",
    "modification": "If you're new to this deep stretch, start with a simpler seated forward fold or use props such as blocks to support the chest and reduce the intensity. Keep the spine long and avoid rounding the back while focusing on opening the hips."
  },
  {
    "id": 89,
    "name": "Grasshopper Pose",
    "modification": "For a more accessible version, practice with the knees bent and keep the feet closer to the floor. Use blocks under the hands for extra height if needed, and focus on strengthening the core and arms before attempting a deeper expression."
  },
  {
    "id": 90,
    "name": "Baby Grasshopper",
    "modification": "This arm balance can be practiced by keeping the back knee on the ground or using blocks under the hands for extra support. Focus on strengthening the core and arms and lifting the legs gradually once balance and stability are established."
  },
  {
    "id": 91,
    "name": "Caterpillar Pose",
    "modification": "If your hamstrings are tight, use a prop like a bolster under the chest or knees for added support. Bend the knees slightly to reduce strain, and focus on lengthening the spine as you fold forward rather than forcing the stretch."
  },
  {
    "id": 92,
    "name": "Revolved Chair Pose",
    "modification": "To reduce intensity, keep the knees slightly bent or take a gentler twist. Use a block between the thighs for added stability and avoid collapsing the chest. Keep the core engaged and focus on maintaining balance and alignment in the twist."
  },
  {
    "id": 93,
    "name": "Side Stretch Pose",
    "modification": "If the stretch feels too intense, reduce the range of motion and keep the knees slightly bent. Use a block under the hand for more support, and avoid collapsing the chest as you lengthen through the side body."
  },
  {
    "id": 94,
    "name": "Hero Pose with Recline",
    "modification": "If sitting on the floor is uncomfortable, place a cushion or block under the hips or knees to reduce strain. You can also place a bolster under the back for added support while gently reclining without forcing the lower back."
  },
  {
    "id": 95,
    "name": "Intense Side Stretch",
    "modification": "If your hamstrings are tight, bend the knees slightly and use blocks under the hands for more support. Focus on lengthening the spine and avoiding the collapse of the chest towards the legs. Keep the core engaged for stability."
  },
  {
    "id": 96,
    "name": "Revolved Crescent Lunge",
    "modification": "If balancing is difficult, keep the back knee on the ground or use a block under the hand for more support. Twist gently from the abdomen rather than the lower back, and keep the hips squared for better alignment."
  },
  {
    "id": 97,
    "name": "Tortoise Pose",
    "modification": "If you have tight hamstrings, bend the knees slightly and use a block under the forehead for extra support. Focus on lengthening the spine and relaxing into the forward fold. Keep the feet hip-width apart to prevent strain on the lower back."
  },
  {
    "id": 98,
    "name": "One-Legged Bridge Pose",
    "modification": "To make this pose more accessible, keep both feet on the floor or bend the knee of the lifted leg. Use a block under the lower back for more support if needed, and focus on lifting the hips without over-straining the glutes or hamstrings."
  },
  {
    "id": 99,
    "name": "Wheel Pose Variation",
    "modification": "If lifting into Wheel Pose feels too intense, practice with the feet closer to the hands or use a block under the lower back. Keep the core engaged and avoid over-arching the lower back. You can also practice a bridge pose as a more accessible alternative."
  },
  {
    "id": 100,
    "name": "Standing Bow Pose",
    "modification": "If balancing is challenging, use a wall or chair for support. Keep the lifted leg slightly bent and focus on lengthening through the spine. If you have tight hips, you can reduce the intensity by not reaching as far forward or backward."
  }
]