[
  {
    "id": 1,
    "name": "Downward Dog",
    "precaution": "Downward Dog should be avoided by individuals with wrist, shoulder, or back injuries, as it places a lot of pressure on the wrists and spine. Those with high blood pressure or glaucoma should also be cautious of the inversion, as it can increase pressure in the head and eyes. Keep the knees slightly bent if the hamstrings are tight to prevent overstraining the lower back."
  },
  {
    "id": 2,
    "name": "Tree Pose",
    "precaution": "Tree Pose requires balance and concentration. Those with ankle, knee, or hip injuries should practice caution and avoid forcing the foot to rest on the thigh or knee. If balance is an issue, use a wall or support for extra stability. Pregnant individuals may need to avoid this pose or modify it by keeping the foot lower or resting on the calf instead of the thigh."
  },
  {
    "id": 3,
    "name": "Warrior I",
    "precaution": "Those with knee or hip injuries should modify Warrior I by ensuring the front knee is not pushed beyond the ankle, and the back leg is kept straight to avoid straining the joints. If you have shoulder or neck issues, keep the arms lower or out to the sides instead of raised overhead. Use caution if you have high blood pressure, as the deep lunge can cause blood flow to shift."
  },
  {
    "id": 4,
    "name": "Warrior II",
    "precaution": "Warrior II can be strenuous on the knees, so those with knee or hip problems should ensure that the knee is aligned over the ankle and avoid any twisting. People with shoulder injuries should avoid extending the arms fully or modify the arms to a lower position. Individuals with high blood pressure or heart conditions should also approach the pose with caution due to the intense engagement of the lower body."
  },
  {
    "id": 5,
    "name": "Child's Pose",
    "precaution": "Child's Pose should be avoided by individuals with knee injuries, as the knees may be compressed while sitting on the heels. Those with lower back issues should avoid deep folding and instead keep the torso slightly elevated. Pregnant individuals may need to modify the pose by widening the knees or using a cushion for support under the chest."
  },
  {
    "id": 6,
    "name": "Cobra Pose",
    "precaution": "Cobra Pose should be avoided by those with lower back or spinal issues, as the backbend can exacerbate pain. Individuals with wrist injuries should also be cautious as the pose requires pressure on the wrists. Pregnant individuals and those with neck issues should keep the chest lifted with less arch in the back or avoid the pose altogether."
  },
  {
    "id": 7,
    "name": "Bridge Pose",
    "precaution": "Bridge Pose can strain the lower back or neck if performed incorrectly. Those with neck injuries should avoid turning the head while in the pose and should support the neck with proper alignment. If you have knee issues, avoid squeezing the knees inward. Pregnant individuals should avoid engaging the glutes excessively and keep the hips at a comfortable height."
  },
  {
    "id": 8,
    "name": "Triangle Pose",
    "precaution": "Triangle Pose can be challenging for individuals with tight hamstrings, hips, or lower back, so modifications such as bending the knees or shortening the stance may be necessary. Those with neck or shoulder issues should avoid twisting the neck upward, and instead, keep the head aligned with the torso. Individuals with low blood pressure should be cautious when coming out of the pose, as the deep stretch may cause dizziness."
  },
  {
    "id": 9,
    "name": "Seated Forward Bend",
    "precaution": "Seated Forward Bend should be approached with caution if you have hamstring, knee, or lower back injuries. Bending the spine too deeply can worsen pain in the lower back, so it's important to keep the back straight and avoid overreaching. If you're pregnant, avoid deep forward bending, especially in the second and third trimesters."
  },
  {
    "id": 10,
    "name": "Mountain Pose",
    "precaution": "While Mountain Pose is a standing pose with low impact, those with ankle or foot injuries should be mindful of the weight distribution in the feet. It’s important to avoid overextending the knees, which could strain the leg joints. If you have balance issues, use a wall or support for stability."
  },
  {
    "id": 11,
    "name": "Chair Pose",
    "precaution": "Chair Pose can be strenuous on the knees and lower back, so individuals with knee injuries or lower back pain should avoid deep squatting and keep the knees in alignment with the toes. Pregnant individuals or those with heart conditions should avoid this pose or modify it by reducing the depth of the squat to avoid overstraining the body."
  },
  {
    "id": 12,
    "name": "Camel Pose",
    "precaution": "Camel Pose requires a deep backbend, which may not be suitable for individuals with lower back or neck injuries. Those with knee pain should keep the knees directly under the hips and avoid letting the knees splay outward. Pregnant individuals should avoid the deep arch in the back and may need to skip this pose altogether or modify it for safety."
  },
  {
    "id": 13,
    "name": "Boat Pose",
    "precaution": "Boat Pose can strain the lower back and hip flexors if performed incorrectly, especially if the core is not fully engaged. Those with lower back pain should avoid or modify the pose by keeping the feet on the ground or using props for support. Pregnant individuals should avoid balancing in this position and should choose more gentle core exercises."
  },
  {
    "id": 14,
    "name": "Plank Pose",
    "precaution": "Plank Pose places significant pressure on the wrists, shoulders, and core. Those with wrist or shoulder injuries should modify the pose by lowering the knees to the ground or practicing on the forearms. People with lower back issues should be cautious of sagging in the lower back and focus on maintaining a straight line from head to heels."
  },
  {
    "id": 15,
    "name": "Bow Pose",
    "precaution": "Bow Pose can strain the lower back if not performed with proper alignment. Individuals with back injuries should avoid deep backbends and may need to use props for support. Those with knee or hip issues should modify the pose and avoid forcing the legs into a deep bend. Pregnant individuals should avoid this pose altogether or perform a modified version with the chest supported."
  },
  {
    "id": 16,
    "name": "Crow Pose",
    "precaution": "Crow Pose is an arm balance that requires significant wrist, arm, and core strength. People with wrist, shoulder, or arm injuries should avoid this pose or modify it with less pressure on the hands. Those with neck or back issues should practice caution with the pose as it requires forward folding and balancing the body on the hands. It’s also crucial to build up core strength and focus before attempting this pose."
  },
  {
    "id": 17,
    "name": "Happy Baby",
    "precaution": "Happy Baby should be avoided by individuals with hip or lower back injuries, as the deep stretch may exacerbate pain. Those with knee issues should avoid pulling the knees too far back toward the body, as it could strain the knees. Pregnant individuals should avoid this pose as it may create pressure on the abdomen."
  },
  {
    "id": 18,
    "name": "Butterfly Pose",
    "precaution": "Butterfly Pose should be avoided by those with hip or groin injuries, as the forward fold can strain these areas. Individuals with lower back pain should avoid rounding the spine too much during the fold. Pregnant individuals should avoid deep forward bending and may need to support the torso with cushions or props."
  },
  {
    "id": 19,
    "name": "Headstand",
    "precaution": "Headstand should only be attempted by those with adequate strength in the shoulders, arms, and core. Individuals with neck, back, or shoulder injuries should avoid this inversion, as it places significant pressure on the neck and spine. Pregnant individuals should not attempt headstands due to the increased pressure on the head and upper body. It's crucial to practice proper alignment and use a spotter or wall for support when attempting this pose."
  },
  {
    "id": 20,
    "name": "Reclined Twist",
    "precaution": "Reclined Twist can exacerbate existing back or neck pain if performed too forcefully. Those with spinal injuries or herniated discs should modify the twist or avoid it altogether. Pregnant individuals should avoid deep twisting and should perform the pose gently with a slight twist, avoiding compression in the abdomen."
  }
]
