[
   {
    "id": 1,
    "name": "Mountain Pose",
    "precaution": "If you have any lower back or neck issues, be sure to keep your spine in alignment by gently engaging your core muscles to prevent overarching. Avoid locking your knees, and instead, keep them slightly soft to prevent hyperextension. As with any yoga pose, listen to your body, and if you experience discomfort or pain, ease out of the pose and consult a healthcare provider if needed. "
  },
  {
    "id": 2,
    "name": "Downward-Facing Dog",
    "precaution": " Individuals with wrist issues should avoid excessive weight on the wrists, ensuring the fingers are spread wide and the weight is distributed evenly across the palms. For those with shoulder concerns, the shoulders should be engaged by pressing the shoulder blades down the back to prevent any unnecessary strain. The neck should remain in a neutral position, with the gaze directed between the legs or at the belly button. Avoid dropping or craning the neck, as this can cause tension in the cervical spine. Pregnant individuals should avoid Downward Dog, particularly after the first trimester, as the inversion may place pressure on the abdomen and disrupt circulation. People with pre-existing injuries to the back, neck, or shoulders should modify the pose."
  },
  {
    "id": 3,
    "name": "Plank Pose",
    "precaution": "If you have wrist or shoulder injuries, such as carpal tunnel syndrome, tendonitis, or rotator cuff issues, you should approach Plank Pose with caution, as the weight-bearing nature of the pose can aggravate these conditions. If you experience lower back pain, ensure your core is properly engaged and your alignment is correct to avoid sagging in the lower back, which could worsen discomfort. Pregnant individuals, especially in the later stages, should avoid Plank Pose due to the pressure it places on the abdomen and lower back, and instead consider gentler alternatives like a wall plank."
  },
  {
    "id": 4,
    "name": "Four-Limbed Staff Pose",
    "precaution": "Beginners or those new to yoga should be mindful of their form to avoid straining the shoulders, wrists, and lower back. People with wrist issues, such as carpal tunnel syndrome or wrist pain, should modify the pose or avoid it until strength and flexibility improve. Those with shoulder injuries or limited shoulder mobility should also be cautious, as the pose requires significant shoulder stability and strength to prevent strain. Similarly, individuals with lower back pain or a history of spinal issues should avoid letting the hips sag, as this can lead to discomfort or injury. Pregnant individuals should consult with a healthcare provider before practicing this pose, as the core engagement and pressure on the abdomen may not be suitable."
  },
  {
    "id": 5,
    "name": "Upward-Facing Dog",
    "precaution": "Those with lower back issues should be cautious, as overextending the lower back can lead to strain. It’s important to engage the core muscles and lift the chest rather than collapsing in the lower back. Individuals with wrist sensitivity should be mindful of the pressure on the wrists in this pose. For those with shoulder injuries or limited flexibility, it’s crucial to avoid collapsing the shoulders forward. Keep the shoulders away from the ears, draw the shoulder blades down, and ensure the elbows are not locked. Additionally, maintaining proper neck alignment is essential to prevent strain—avoid craning the neck backward too far and keep it in a neutral position. Pregnant individuals, especially in later stages, should avoid this pose due to the pressure it places on the abdomen and lower back. It is also important for those with spinal conditions, such as herniated discs or scoliosis, to consult a healthcare provider before attempting the pose."
  },
  {
    "id": 6,
    "name": "Child's Pose",
    "precaution": "While Child's Pose (Balasana) is generally a gentle and restorative pose, there are some precautions to keep in mind to ensure a safe and effective practice. If you have knee injuries or discomfort, you may want to place a cushion or blanket under your knees for added support and cushioning. For those with lower back pain, it is important to avoid collapsing the lower back or forcing the torso down too far; instead, focus on gently lengthening the spine while keeping the hips aligned over the knees. If you are pregnant, especially in later stages, it's advised to modify the pose by keeping the knees slightly apart to avoid pressure on the belly or chest."
  },
  {
    "id": 7,
    "name": "Warrior I",
    "precaution": "Individuals with knee issues should be cautious when bending the front knee, ensuring it does not extend beyond the ankle to avoid unnecessary pressure on the joint. Those with hip or lower back pain should avoid forcing the hips to square completely forward, as this can cause discomfort or misalignment; instead, they can allow a slight external rotation of the back hip. For practitioners with shoulder injuries or limited mobility, the arms can be kept parallel to the ground or placed on the hips instead of being raised overhead."
  },
  {
    "id": 8,
    "name": "Warrior II",
    "precaution": " If you have knee injuries, especially in the front knee, be cautious about allowing the knee to extend past the ankle, as this can put unnecessary strain on the joint. Those with tight hips or hamstrings should avoid overextending the legs and may need to reduce the depth of the lunge to prevent discomfort or injury. If you have lower back issues, it’s important to be mindful of your hip alignment, ensuring that your hips are open and facing to the side rather than forward, as improper alignment can strain the lower back. Individuals with shoulder problems should avoid lifting the shoulders up toward the ears and focus on relaxing them down to reduce tension. Pregnant individuals or those with balance concerns should modify the pose by shortening their stance or using props for additional support."
  },
  {
    "id": 9,
    "name": "Warrior III",
    "precaution": " People with lower back injuries, such as herniated discs or sciatica, should approach Warrior III carefully, as it involves significant core and lower back engagement, which can aggravate pain if not performed with proper alignment. Likewise, individuals with knee or hip injuries should be mindful of not overstretching or hyperextending the joints during the pose, especially the standing leg. Pregnant individuals should also be cautious when performing Warrior III, particularly after the first trimester, as the deep forward bending and balancing may strain the core and affect stability. Those with shoulder injuries, such as rotator cuff issues, should avoid overextending the arms or straining the shoulders in the pose. Those with balance issues or dizziness, such as individuals prone to vertigo, should be cautious as this pose challenges coordination and could lead to falls."
  },
  {
    "id": 10,
    "name": "Reverse Warrior",
    "precaution": "Individuals with knee injuries should avoid deeply bending the front knee to prevent strain on the joint. Individuals with lower back issues should also be cautious, as the pose involves deep hip flexion and a backbend, which may aggravate certain back conditions. Those with hip injuries or sacroiliac joint issues should avoid overextending or misaligning the pelvis during the pose. Pregnant individuals should modify the posture to ensure comfort and avoid any pressure on the abdomen, particularly in later stages of pregnancy. Lastly, individuals with shoulder injuries or limited shoulder mobility should be careful when reaching the arms overhead, as this movement can strain the shoulders if not performed with proper alignment."
  },
  {
    "id": 11,
    "name": "Extended Side Angle",
    "precaution": "Those with knee, hip, or ankle injuries should modify the pose to avoid overstraining these areas, particularly by keeping the front knee aligned with the toes and not pushing it past the ankle. People with lower back issues should be cautious not to overextend or collapse into the lower back, as this can exacerbate discomfort; engaging the core and maintaining proper alignment is essential. Pregnant individuals should avoid deep twists and may need to adjust the stance for comfort, particularly in the later stages of pregnancy. Those with shoulder injuries should also be careful when extending the arms overhead or placing the hand on the floor, as this could strain the shoulder joints."
  },
  {
    "id": 12,
    "name": "Triangle Pose",
    "precaution": "People with neck, back, or spinal issues, including herniated discs or scoliosis, should avoid overextending in the pose or twisting the neck too far, as this can exacerbate strain. Pregnant women should also be cautious, particularly in the later stages, as the wide leg stance may put pressure on the abdomen, and deep twisting could be uncomfortable. Individuals with hip injuries or tight hips may find the deep stretch in the groin and hip area challenging, and they may need to limit the depth of their stretch or use props to support their alignment. Those with knee injuries should ensure that their front knee is aligned properly and not pushing beyond the ankle to avoid added strain on the joint."
  },
  {
    "id": 13,
    "name": "Half Moon Pose",
    "precaution": "Certain individuals should approach Half Moon Pose with caution or modify the pose to avoid strain or injury. Those with balance issues or recent ankle, knee, or hip injuries may find it challenging to stabilize the body in this pose and should take extra care, possibly using props like blocks for support. People with lower back problems should be cautious, as the pose requires a significant amount of core engagement and spinal alignment, which could exacerbate discomfort if not done properly. Additionally, individuals with neck issues should avoid looking up to the raised hand, as this can strain the neck—focusing on a fixed point on the floor or keeping the head neutral may be a better option. Pregnant individuals should also avoid the pose or modify it significantly to avoid strain on the abdomen and lower back."
  },
  {
    "id": 14,
    "name": "Chair Pose",
    "precaution": "Those with knee issues or recent knee injuries should be careful when bending the knees deeply, as the pose places significant pressure on the knee joints. To protect the knees, it’s important to ensure that the knees are aligned with the toes and do not extend past the toes. Individuals with lower back pain should also be cautious, as the deep bend and engagement of the core muscles can place strain on the lumbar spine if proper alignment isn’t maintained. It’s important to keep the spine long and the chest lifted to avoid collapsing into the lower back. Those with hip issues or tight hips may find it difficult to maintain the deep squat position, and should focus on keeping the pelvis aligned and avoid any excessive arching of the lower back.  Additionally, individuals with shoulder or wrist injuries should avoid extending the arms overhead for prolonged periods, opting instead to keep the hands in a prayer position at the chest or on the hips."
  },
  {
    "id": 15,
    "name": "Goddess Pose",
    "precaution": "People with knee issues, such as patellar tracking problems, knee arthritis, or injuries, should be mindful of the alignment of the knees in this pose. It’s important that the knees stay directly over the ankles and do not extend past the toes to avoid unnecessary strain on the joint. Those with lower back issues, particularly individuals with a history of herniated discs or sciatica, should be cautious about over-bending the knees or sinking too deeply into the squat, as this can cause strain on the lower back.  Additionally, those with hip or groin injuries should ensure that the external rotation of the hips is not too intense and that the pose is performed with care to avoid further injury."
  },
  {
    "id": 16,
    "name": "Crescent High Lunge Pose",
    "precaution": "Those with knee issues, particularly in the front knee, should be mindful of their alignment, ensuring that the knee does not extend beyond the toes, which could strain the joint. People with lower back pain or a history of spinal injuries should avoid excessive arching of the lower back and focus on engaging the core to support the spine. Those with hip injuries or limited hip flexibility may find it difficult to sink deeply into the lunge without discomfort, so using props like blocks or modifying the depth of the pose can be beneficial. Pregnant individuals should avoid deep lunges and ensure that the hips are aligned properly to avoid strain on the pelvis."
  },
  {
    "id": 17,
    "name": "Low Lunge",
    "precaution": "Those with knee issues, particularly in the back knee, should be mindful of the pressure placed on the joint. It is important to avoid any discomfort by placing a cushion or blanket under the back knee for support. People with tight hips or limited flexibility in the hip flexors may find it challenging to fully lower the hips without straining, so they may need to use props or modify the pose by keeping the back knee slightly lifted or working on gentle hip-opening stretches beforehand. Additionally, individuals with lower back problems should engage their core and avoid overarching the lower back, as this can exacerbate pain or discomfort. Pregnant individuals should avoid placing too much pressure on the belly, and modify the pose."
  },
  {
    "id": 18,
    "name": "Pyramid Pose",
    "precaution": "Individuals with tight hamstrings, lower back concerns, or a history of knee or hip injuries may want to approach Pyramid Pose with a bit more attention. If you have tight hamstrings, you might find it helpful to keep a slight bend in your front knee to avoid overstretching. For those with lower back discomfort, it’s important to maintain proper alignment by engaging your core and avoiding rounding your back during the forward fold. If you have knee issues, make sure your front knee stays aligned with your ankle, not extending too far forward. Similarly, if you have hip concerns, you may want to adjust the depth of the forward fold to ensure comfort."
  },
  {
    "id": 19,
    "name": "Wide-Legged Forward Fold",
    "precaution": "Those with lower back issues, such as herniated discs, sciatica, or chronic back pain, should be mindful of their spine's alignment and avoid overstraining the back in the forward bend. Similarly, individuals with tight hamstrings or hip flexors may experience discomfort if they force the stretch, so it's important to maintain a gentle approach and use props like blocks to support the torso. Pregnant individuals should avoid deep forward folds, particularly in the later stages of pregnancy, to protect the lower back and abdomen. Additionally, those with knee issues should be cautious and may need to slightly bend their knees to protect the joints and avoid strain."
  },
  {
    "id": 20,
    "name": "Standing Split",
    "precaution": "Standing Split Pose (Urdhva Prasarita Eka Padasana) can be an intense stretch, particularly for those with tight hamstrings, hips, or lower back. Individuals with existing lower back or hamstring injuries should approach this pose with caution and may need to modify it by keeping the standing leg slightly bent or using props for support. Those with balance issues, knee problems, or hip instability should also practice this pose carefully, as the posture requires significant balance and alignment of the legs and hips. Pregnant practitioners or individuals with hip, knee, or ankle injuries should avoid deep folding in this pose, and instead, opt for gentler variations with less intensity."
  },
  {
    "id": 21,
    "name": "Tree Pose",
    "precaution": "Those with ankle, knee, or hip injuries should be careful, as placing weight on one leg and balancing can put strain on these areas. People with balance issues or a history of vertigo may find it difficult to hold the pose, and they may need to modify or avoid it to prevent falls. Additionally, individuals with lower back problems should be cautious when trying to keep the spine straight and avoid overextending or arching the back. Pregnant individuals or those in their second or third trimesters may find it challenging to maintain the pose due to changes in balance and body alignment, so modifications may be helpful."
  },
  {
    "id": 22,
    "name": "Dancer Pose",
    "precaution": "Those with a history of ankle, knee, or hip injuries should be especially careful, as the posture requires significant balance and engagement of the lower body. People with back issues, particularly in the lower back or spine, should avoid deep backbends or seek modifications to prevent strain. Additionally, those with shoulder injuries may find the arm extension in Dancer Pose challenging, as it requires opening the chest and reaching the arm forward while stabilizing the back. Pregnant individuals, especially in the later stages, may want to avoid the intense backbend or deep stretch in this pose, opting for a gentler variation. It’s also important for beginners to approach Dancer Pose gradually, ensuring proper alignment and avoiding overstretching, as falling or straining in the pose can lead to injury."
  },
  {
    "id": 23,
    "name": "Eagle Pose",
    "precaution": "Those with knee, ankle, or hip injuries should be careful, as the pose requires deep bending and twisting of the lower body, which can put strain on these areas. People with shoulder injuries may also need to modify the arm position, as the pose demands significant shoulder flexibility and strength when crossing the arms in front of the body. Those with lower back issues should avoid forcing the pose too deeply, especially the twist, and focus on engaging the core to support the spine. Pregnant individuals should avoid the deep twist and opt for a gentler variation, focusing on balance and stability without crossing the arms or legs too tightly."
  },
  {
    "id": 24,
    "name": "Crow Pose",
    "precaution": "Those with wrist, elbow, or shoulder injuries should be cautious, as the pose places significant weight on the hands and requires stability in the upper body. It’s important to engage the arms and shoulders properly to avoid strain. Individuals with neck or back issues should avoid overextending or straining during the pose, as improper alignment can exacerbate discomfort. Those with knee or hip injuries should also be mindful when attempting Crow Pose, as the deep squat and positioning of the legs can put stress on these joints. Pregnant individuals should avoid attempting the pose due to the balance and core engagement required. Beginners or those working on balance may want to practice near a wall or use props for additional support as they build strength and confidence."
  },
  {
    "id": 25,
    "name": "Side Crow Pose",
    "precaution": "Individuals with wrist, elbow, or shoulder injuries should be mindful, as this pose places significant weight on the arms and requires upper body strength and stability. Those with lower back issues or spinal injuries should be cautious, as the deep twist can place strain on the back if performed without proper alignment. People with weak or tight core muscles may struggle to maintain balance, increasing the risk of falls or improper form. Additionally, those with knee or hip injuries should avoid forcing the twist, as it can exacerbate discomfort in these areas. Pregnant individuals or those with conditions affecting balance should skip this pose entirely, as the twisting and balancing elements can be challenging and potentially unsafe. Beginners or anyone unfamiliar with arm balances may want to use props, practice under the guidance of an experienced teacher, or focus on preparatory poses to build the necessary strength and flexibility before attempting Side Crow Pose."
  },
  {
    "id": 26,
    "name": "Garland Pose",
    "precaution": "Those with knee injuries or chronic knee pain should avoid deep squatting or use props, such as a block under the hips, to reduce strain on the joints. People with hip or lower back issues, such as sciatica, should ease into the pose gently, ensuring that they maintain proper alignment to avoid exacerbating discomfort. Pregnant individuals may benefit from practicing a modified version with added support, like using a wall or yoga props, to avoid excessive pressure on the abdomen. Additionally, anyone with limited ankle mobility may find it challenging to keep their heels grounded and can use a rolled blanket under the heels for support."
  }, 
  {
    "id": 27,
    "name": "Feathered Peacock Pose",
    "precaution": "Those with shoulder injuries or instability should avoid or modify the pose, as it places substantial pressure on the shoulders and upper back. It’s also important for individuals with wrist issues to be mindful of the strain on the forearms and wrists while maintaining the pose. People with neck problems or a history of spinal issues should practice with extra care, ensuring the neck remains aligned and protected to avoid strain. Inversions like Feathered Peacock Pose may also not be suitable for those with high blood pressure, heart conditions, or glaucoma, as the position of the head below the heart can increase pressure in the eyes or affect circulation. Pregnant individuals should avoid this pose, particularly in the later stages of pregnancy, due to the inversion and the pressure it places on the abdomen. Beginners or those new to inversions may need to practice preparatory poses to build strength and confidence before attempting Feathered Peacock Pose."
  },
  {
    "id": 28,
    "name": "Handstand Pose",
    "precaution": "Individuals who are new to yoga or have not developed sufficient upper body strength or balance should approach this pose with caution. People with wrist, shoulder, neck, or back injuries should avoid attempting this pose, as it places significant pressure on these areas. Additionally, those with conditions such as glaucoma, high blood pressure, heart problems, or eye issues should be cautious when practicing inversions, as being upside down can increase pressure in the head and eyes. Pregnant individuals are also advised to avoid inversions as it can disrupt the body's balance and put unnecessary strain on the abdomen."
  },
  {
    "id": 29,
    "name": "Shoulderstand Pose",
    "precaution": "Individuals with neck, shoulder, or back issues should exercise caution or avoid this pose altogether, as it requires significant weight to be supported on the neck and shoulders. Those with herniated discs, spinal misalignments, or any history of neck or back injuries should consult a healthcare professional before attempting this pose. Additionally, individuals with high blood pressure, heart conditions, or glaucoma should be cautious, as the inversion can increase pressure in the eyes and head. Pregnant women should also avoid shoulderstand due to the strain it places on the body and the potential risk for the developing baby."
  },
  {
    "id": 30,
    "name": "Fish Pose",
    "precaution": "Practitioners with neck, back, or spine issues, such as herniated discs or spinal injuries, should be particularly careful as the pose involves a deep arch of the spine and a position that places strain on the neck. Those with neck problems, including arthritis or stiffness, may find this pose uncomfortable and should avoid the deep backward bend or modify the pose to reduce strain on the cervical spine. Individuals with high blood pressure, heart conditions, or glaucoma should also approach Fish Pose with caution, as the pressure it places on the chest and head may exacerbate these conditions. Pregnant individuals should avoid practicing this pose, especially in the later stages of pregnancy, due to the deep backbend, which can compress the abdomen and potentially cause discomfort."
  },
  {
    "id": 31,
    "name": "Camel Pose",
    "precaution": "Camel Pose should be practiced with caution by individuals who have specific back or neck issues, including herniated discs, scoliosis, or hyperextension of the spine. Those with a history of shoulder, knee, or hip injuries should also approach this pose carefully, as it requires significant flexibility and strength in these areas. Individuals with high blood pressure or heart conditions may need to avoid deep backbends or modify the pose to avoid strain. Pregnant individuals should refrain from performing Camel Pose, as it may compress the abdomen. Additionally, people with vertigo or balance issues should take extra care, as the pose involves tilting the head back. Always focus on maintaining a safe and aligned posture and avoid overextending the back to reduce the risk of injury. "
  },
  {
    "id": 32,
    "name": "Bridge Pose",
    "precaution": "Those with neck, back, or shoulder injuries should avoid the pose or perform it with modifications to prevent strain on the spine and upper body. People with sacral or lumbar spine issues should be mindful of how they engage their back during the lift, ensuring they don't overextend. Pregnant individuals, particularly in the second and third trimesters, should avoid the pose or consult with a healthcare provider before practicing it, as the position may put unnecessary pressure on the abdomen. Additionally, individuals with knee injuries should be careful when pressing the feet into the floor, as the angle of the knees can exacerbate discomfort. It’s important to maintain proper alignment to avoid strain, especially on the lower back, and to avoid forcing the hips too high or overly arching the spine."
  },
  {
    "id": 33,
    "name": "Wheel Pose",
    "precaution": "Those with back or spinal issues, such as herniated discs, scoliosis, or sacral instability, should be particularly cautious, as the deep backbend can exacerbate these conditions. Individuals with neck or shoulder injuries may also be at risk due to the significant strain placed on these areas during the pose. Those with limited flexibility in the shoulders, hips, or wrists should take care, as these areas are heavily engaged in maintaining the posture. People with high blood pressure or heart conditions should also be mindful, as the inversion and lifting of the chest can increase circulation to the upper body. Additionally, pregnant individuals, especially in later stages, should avoid Wheel Pose due to the pressure it places on the abdomen. As a physically demanding pose, Wheel Pose requires proper alignment and strength, so individuals new to yoga or those with limited flexibility should be cautious when attempting it."
  },
  {
    "id": 34,
    "name": "Reclining Bound Angle Pose",
    "precaution": "Those with hip, knee, or groin injuries may find the external rotation of the legs uncomfortable or exacerbating and should use props, such as bolsters or blocks, to support the knees and reduce strain. Pregnant individuals, particularly in later stages, should ensure proper support under the back or practice the pose in a more elevated position to avoid discomfort or reduced circulation. People with lower back issues or sacroiliac joint instability should also be mindful, as the pose’s openness can sometimes aggravate these areas."
  },
  {
    "id": 35,
    "name": "Legs Up the Wall Pose",
    "precaution": "Pregnant practitioners should use extra support, such as a bolster under the hips, or avoid the pose if it feels uncomfortable. Additionally, those with neck or back injuries should ensure proper alignment and use props to avoid exacerbating discomfort. Finally, individuals experiencing dizziness or vertigo should move into and out of the pose slowly to avoid triggering symptoms."
  },
  {
    "id": 36,
    "name": "Boat Pose",
    "precaution": "Those with lower back issues, such as herniated discs or chronic pain, should be careful, as the pose requires a strong engagement of the core and spine, which could exacerbate discomfort if not performed with proper alignment. Pregnant individuals should avoid the pose in later stages of pregnancy due to the strain it may place on the abdomen and lower back, but can opt for modified versions, such as keeping the legs bent. People with neck problems should also avoid straining the neck by keeping the spine neutral and avoiding excessive chin tucking during the pose."
  },
  {
    "id": 37,
    "name": "Seated Forward Fold",
    "precaution": "Those with lower back issues, such as herniated discs or sciatica, should avoid rounding the spine excessively and consider using props like a bolster or sitting on a folded blanket to support the pelvis. People with tight hamstrings may experience strain in the lower back if they force the stretch, so it’s important to bend the knees slightly to maintain alignment. Additionally, anyone with hip or knee injuries should modify the pose to avoid discomfort or further injury. Pregnant individuals should avoid compressing the abdomen and instead practice a wider-legged version of the pose for more space and comfort."
  },
  {
    "id": 38,
    "name": "Bound Angle Pose",
    "precaution": "Those with knee injuries or knee pain should be careful, as the position of the knees pressing towards the floor can exacerbate discomfort or strain. People with hip injuries or limited hip flexibility may also find this pose challenging, as it requires significant hip opening. Pregnant individuals should avoid deep forward folds and may opt for a more supportive variation of the pose, focusing on opening the hips without going too deep into the stretch."
  },
  {
    "id": 39,
    "name": "Happy Baby Pose",
    "precaution": "Those with knee or hip injuries should be mindful, as the deep opening of the hips and the pressure placed on the knees can exacerbate discomfort. People with sensitive knees may consider using props, such as placing a cushion or blanket beneath the knees for support to alleviate strain. Similarly, individuals with lower back issues, particularly those with herniated discs or sciatica, should avoid pulling too forcefully on the feet, as this could place additional pressure on the spine. Pregnant individuals or those in their second or third trimester should also be cautious, as deep stretches of the hips and lower back may place unnecessary pressure on the abdomen."
  },
  {
    "id": 40,
    "name": "Corpse Pose",
    "precaution": "People with back injuries or chronic back pain may find it uncomfortable to lie flat on their back, as it can exacerbate spinal discomfort. Individuals with severe neck issues should also be mindful, ensuring that their head is properly supported on the mat, or using a rolled towel or cushion under the neck for added support."
  },
  {
    "id": 41,
    "name": "Cobra Pose",
    "precaution": "Those with recent or chronic back injuries, particularly in the lower back or spine, should modify the pose or avoid it entirely to prevent aggravating pain. Practitioners with herniated discs or spinal stenosis should consult with a healthcare provider before attempting Cobra Pose, as the backbend may exacerbate their condition. People with neck issues, including cervical spine problems, should avoid overextending the neck and keep the head in line with the spine to prevent strain. Pregnant individuals, particularly in the later stages of pregnancy, should also be cautious and avoid deep backbends that may place pressure on the abdomen."
  },
  {
    "id": 42,
    "name": "Locust Pose",
    "precaution": "Those with back or spine issues, such as herniated discs, sciatica, or chronic lower back pain, should avoid or modify the pose to prevent strain on the spine and surrounding muscles. Pregnant individuals should also avoid this pose, as the pressure it places on the abdomen and lower back may be uncomfortable or unsafe. People with neck problems should be mindful of their neck alignment during the pose, as lifting the chest and legs off the floor can put strain on the cervical spine if not properly supported. Additionally, individuals with shoulder injuries or instability should be cautious when lifting the arms and chest, as the pose requires strength and mobility in the shoulders."
  },
  {
    "id": 43,
    "name": "Bow Pose",
    "precaution": "Those with existing back injuries, chronic lower back pain, or spinal conditions such as herniated discs should avoid this pose or practice it under the guidance of a qualified instructor. Similarly, individuals with recent abdominal surgeries or conditions like ulcers, hernias, or severe digestive issues should refrain from practicing Bow Pose, as the intense abdominal stretch may exacerbate these conditions. Pregnant individuals should also avoid this posture, as it compresses the abdomen. Additionally, those with shoulder or neck injuries, high blood pressure, or migraines should exercise care or modify the pose to suit their needs."
  },
  {
    "id": 44,
    "name": "Puppy Pose",
    "precaution": "Those with shoulder injuries or discomfort should avoid overextending the arms or putting excessive strain on the shoulders. Similarly, individuals with lower back issues should ensure their spine remains supported and avoid collapsing into the pose, as this could exacerbate tension or pain. People with sensitive knees may benefit from using a blanket or cushion for added padding under the knees to prevent discomfort. Pregnant practitioners, especially in the later stages, should modify the pose to avoid compressing the belly."
  },
  {
    "id": 45,
    "name": "Cat-Cow Pose",
    "precaution": "If you have neck or back issues, keep the movements slow and controlled. Avoid over-arching the back and dropping the head too far. Keep the core engaged to protect the spine."
  },
  {
    "id": 46,
    "name": "Thread the Needle",
    "precaution": "If you have shoulder issues, perform this pose with caution and keep the shoulder joint stable. Avoid dropping too deep into the twist if you have lower back pain."
  },
  {
    "id": 47,
    "name": "Upward Plank Pose",
    "precaution": "Those with wrist, shoulder, or neck injuries should be mindful of the pressure this pose places on these areas and may need to modify the pose or skip it entirely to avoid exacerbating the injury. Practitioners with lower back pain or tightness in the hamstrings and hip flexors may find this pose challenging and should move into it gradually, focusing on proper alignment and listening to their bodies. Pregnant individuals, especially in later stages, should avoid this pose due to the intense abdominal engagement and backbend."
  },
  {
    "id": 48,
    "name": "Half Pigeon Pose",
    "precaution": "Practitioners with knee, hip, or lower back issues should avoid or modify the pose to prevent strain. For those with knee pain, it’s essential to keep the knee in alignment and avoid overstretching, as excessive pressure can exacerbate discomfort. People with tight hips or limited flexibility should take care not to force the pose, as pushing too deeply into the stretch can lead to strain in the hip joint or lower back. It’s also important to maintain proper alignment throughout the pose, ensuring the pelvis stays square and the back leg is extended fully, as improper alignment can cause unnecessary stress on the lower back or knees. Individuals with sciatica or herniated discs should consult a healthcare provider before practicing this pose to ensure it is safe for their specific condition."
  },
  {
    "id": 49,
    "name": "Plow Pose",
    "precaution": "If you have neck or spine issues, avoid letting your head drop back too far and ensure your neck is supported. Keep a slight bend in your knees if you feel discomfort in the hamstrings or lower back. If you're new to this pose, use a blanket or cushion under your back for additional support. Always move into and out of the pose with control to avoid straining the neck or shoulders."
  },
  {
    "id": 50,
    "name": "Supine Twist",
    "precaution": "If you have a back injury, perform this twist gently and avoid forcing the body deeper into the stretch. Use a cushion under the knees if you feel strain in the lower back."
  },
  {
    "id": 51,
    "name": "Half Lord of the Fishes",
    "precaution": "Avoid twisting too deeply if you have lower back or neck pain. Keep the spine long and engage the core for support. Use props like a block to support the hip if needed."
  },
  {
    "id": 52,
    "name": "Side Plank",
    "precaution": "Avoid collapsing the shoulder joint and ensure the wrist is directly beneath the shoulder. If you have wrist, shoulder, or core issues, practice this pose with caution or use modifications like knee support."
  },
  {
    "id": 53,
    "name": "Wild Thing",
    "precaution": "Keep the shoulder joints stable and avoid overextending the back. If you have neck or back issues, practice with caution and use a block under the foot for support."
  },
  {
    "id": 54,
    "name": "Tiger Pose",
    "precaution": "Avoid over-arching the back and keep the core engaged. If you have knee or back issues, perform this pose gently and with proper alignment."
  },
  {
    "id": 55,
    "name": "Gate Pose",
    "precaution": "Avoid over-stretching the inner thigh and keep the hips squared. If you have knee or hip issues, perform this pose gently and avoid pushing too far into the stretch."
  },
  {
    "id": 56,
    "name": "Frog Pose",
    "precaution": "If you have knee or hip issues, practice with caution and avoid forcing the knees to the floor. Use props like blankets or cushions under the knees for support."
  },
  {
    "id": 57,
    "name": "Lizard Pose",
    "precaution": "If you have tight hips or knees, use props under the hips for support. Keep the back leg active to protect the knee and avoid letting the knee collapse inward."
  },
  {
    "id": 58,
    "name": "Fallen Triangle",
    "precaution": "If you have neck, shoulder, or back issues, perform this pose gently and avoid going too deep into the stretch. Keep the legs strong and the hips lifted for support."
  },
  {
    "id": 59,
    "name": "Bird of Paradise",
    "precaution": "If you have balance issues, practice near a wall or use a block for support. Avoid forcing the leg into a bind, and only go as far as feels comfortable in the twist."
  },
  {
    "id": 60,
    "name": "Extended Hand-to-Big-Toe Pose",
    "precaution": "If you have hamstring or lower back tightness, bend the standing leg slightly. Keep the spine long and avoid rounding the back to protect the lower back."
  },
  {
    "id": 61,
    "name": "Standing Forward Fold",
    "precaution": "If you have tight hamstrings or lower back pain, bend the knees slightly to avoid straining the lower back. Keep the core engaged and avoid rounding the back."
  },
  {
    "id": 62,
    "name": "Halfway Lift",
    "precaution": "Keep the spine long and avoid rounding the back. If you have lower back or neck issues, perform the lift gently, and avoid overextending the chest."
  },
  {
    "id": 63,
    "name": "Ragdoll Pose",
    "precaution": "If you have neck issues, keep the head relaxed and avoid pulling on the neck. Bend the knees slightly if you have tight hamstrings or back pain."
  },
  {
    "id": 64,
    "name": "Eight-Angle Pose",
    "precaution": "This pose requires balance and core strength. If you have wrist or shoulder issues, practice with caution or skip this pose."
  },
  {
    "id": 65,
    "name": "Bound Side Angle",
    "precaution": "Avoid over-extending the lower back or neck. Keep the knee above the ankle and ensure the hips are squared to protect the joints."
  },
  {
    "id": 66,
    "name": "Bound Forward Fold",
    "precaution": "Avoid forcing the body into the fold. Keep the knees slightly bent if you have tight hamstrings or back pain."
  },
  {
    "id": 67,
    "name": "Half Splits",
    "precaution": "Keep the hips squared and avoid forcing the fold. If you have knee or hamstring issues, use props for support and don’t over-extend."
  },
  {
    "id": 68,
    "name": "Full Splits",
    "precaution": "If you have tight hips or hamstrings, practice with caution. Use props like blocks under the hips for support and avoid forcing the legs into a full split."
  },
  {
    "id": 69,
    "name": "King Pigeon Pose",
    "precaution": "If you have knee, hip, or back injuries, avoid deepening the stretch. Use props to support the hips or head, and maintain a long spine."
  },
  {
    "id": 70,
    "name": "Lotus Pose",
    "precaution": "If you have knee, hip, or ankle issues, avoid this pose. Sit on a cushion to lift the hips and keep the spine straight. Do not force the legs into position."
  },
  {
    "id": 71,
    "name": "Elevated Lotus Pose",
    "precaution": "Avoid practicing this pose if you have wrist, shoulder, or knee injuries. Ensure the wrists are properly aligned and do not overstrain. Engage the core to prevent collapsing into the shoulders, and use a prop or modify the pose if lifting the body feels too intense."
  },
  {
    "id": 72,
    "name": "Cow Face Pose",
    "precaution": "If you have shoulder or knee issues, avoid forcing the legs into position. Keep the spine long and use props if needed to support the knees."
  },
  {
    "id": 73,
    "name": "Seated Spinal Twist",
    "precaution": "Twist gently to avoid straining the lower back. Keep the spine long and avoid over-rotating if you have neck or back issues."
  },
  {
    "id": 74,
    "name": "Hero Pose",
    "precaution": "If you have knee or ankle issues, use a cushion or block under the hips for support. Keep the spine long and avoid collapsing the chest."
  },
  {
    "id": 75,
    "name": "Revolved Triangle",
    "precaution": "Keep the hips squared and avoid over-twisting. If you have neck or back injuries, practice with caution and keep the twist gentle."
  },
  {
    "id": 76,
    "name": "Revolved Side Angle",
    "precaution": "If you have knee, back, or neck injuries, avoid over-rotating. Use a block under the hand if you feel any strain in the lower back."
  },
  {
    "id": 77,
    "name": "Shoulder Pressing Pose",
    "precaution": "Avoid straining the wrists or shoulders. If you have wrist or shoulder injuries, practice this pose with caution and keep the core engaged for stability."
  },
  {
    "id": 78,
    "name": "Flying Pigeon Pose",
    "precaution": "This pose requires balance and flexibility. If you have wrist, shoulder, or hip issues, practice with caution and use props for stability."
  },
  {
    "id": 79,
    "name": "Firefly Pose",
    "precaution": "Keep the wrists strong and avoid collapsing the shoulders. If you have lower back or hip injuries, practice with caution and use blocks for support."
  },
  {
    "id": 80,
    "name": "Monkey Pose",
    "precaution": "If you have tight hamstrings or lower back pain, bend the knee slightly and avoid over-extending the spine. Use props to support the fold if needed."
  }
]