[
  {
    "id": 1,
    "name": "Mountain Pose",
    "sanskrit_name": "ताड़ासन",
    "other_names": ["Equal Standing Pose"],
    "sanskrit_translation": "Tadasana",
    "sanskrit_pronunciation": "[ tah-DAH-suh-nuh ]",
    "context": "The etymology of Tāḍāsana comes from two Sanskrit words: Tāḍa (ताड), meaning 'mountain,' and Āsana (आसन), meaning 'posture' or 'seat.' The term Tāḍa symbolizes the solid, stable, and grounded nature of a mountain, which reflects the strength and steadiness that the pose embodies. Āsana is a common Sanskrit word used in yoga to refer to any posture. Together, Tāḍāsana translates to 'Mountain Pose,' a standing posture that emphasizes physical strength, stability, and alignment, akin to the solid foundation of a mountain. It's alternate name, Samasthitiḥ, refers to 'equal standing' or 'balanced position,' further emphasizing the balance and centeredness that the pose cultivates. Historically, Tāḍāsana did not appear in traditional Hatha Yoga texts but is mentioned in the 1896 Vyayama Dipika, a manual of gymnastics. The pose became a foundational element in modern yoga through the teachings of Krishnamacharya, who incorporated it into the practice of Vinyasa Yoga. His students, Pattabhi Jois and B.K.S. Iyengar, further popularized Tāḍāsana in their respective yoga styles, Ashtanga Vinyasa Yoga and Iyengar Yoga, where it remains a key posture. As B.K.S. Iyengar wrote in Light on Yoga, 'Tadasana is the starting point for all the standing asanas. Although it is the simplest of all asanas, it is the most difficult to master, for one has to achieve perfect body balance and the ideal alignment of the body parts.'",
    "source": "Iyengar, B.K.S. Light on Yoga. Revised edition, Schocken Books, 1979, p. 72."
  },
  {
    "id": 2,
    "name": "Tree Pose",
    "sanskrit_name": "वृक्षासन",
    "other_names": [],
    "sanskrit_translation": "Vrksasana",
    "sanskrit_pronunciation": "[ vrik-SHAH-suh-nuh ]",
    "context": "The term Vrksasana is derived from the Sanskrit word Vṛkṣa (वृक्ष), meaning 'tree,' and Asana (आसन), meaning 'pose' or 'posture.' Together, the name translates to 'Tree Pose,' symbolizing the strength, stability, and rootedness of a tree while embodying the graceful, balanced nature of its form. This posture evokes the image of a tree with deep roots and a tall, steady trunk, reflecting the sense of grounding and growth that the pose nurtures. Historically, Vrksasana has been practiced in various forms within traditional yoga, with its roots deeply embedded in ancient texts that emphasize balance and stillness. In modern yoga, Tree Pose became an essential part of standing sequences and is often used in practices like Vinyasa and Hatha yoga, where it aids in building strength, improving focus, and enhancing coordination. Today, it serves as both a physical posture for improving balance and flexibility and a mental practice for cultivating mindfulness and calm."
  },
  {
    "id": 3,
    "name": "Cat Pose",
    "sanskrit_name": "मार्जरासन",
    "other_names": [],
    "sanskrit_translation": "Marjaryasana",
    "sanskrit_pronunciation": "[ mar-JAH-ree-AH-suh-nuh ]",
    "context": "The name Marjaryasana, or Cat Pose, is derived from the Sanskrit words Marjara (मार्जर) meaning 'cat' and Asana (आसन) meaning 'pose' or 'posture.' This pose mimics the natural movement of a cat stretching its spine, offering a rejuvenating stretch that targets both the upper and lower body. Cat Pose has long been an essential part of yoga, incorporated into sequences to promote spinal flexibility and engage the core. Often paired with Cow Pose, this dynamic movement helps to increase mobility in the spine while also providing relief from tension in the back, neck, and shoulders. Practitioners use Cat Pose to connect with their breath, aiding in mental clarity and calming the mind. It has become a fundamental pose in yoga practices such as Hatha, Vinyasa, and Restorative Yoga, valued for both its physical and mental benefits."
  },
  {
    "id": 4,
    "name": "Cow Pose",
    "sanskrit_name": "बिटिलासन",
    "other_names": [],
    "sanskrit_translation": "Bitilasana",
    "sanskrit_pronunciation": "[ bee-TEE-lah-suh-nuh ]",
    "context": "The name Bitilasana, or Cow Pose, is derived from the Sanskrit words Bitila (बिटिल) meaning 'cow' and Asana (आसन) meaning 'pose' or 'posture.' This pose is often associated with the graceful, expansive stretch of a cow’s chest and neck, helping to open up the body and encourage a deep, full breath. Cow Pose is a key part of yoga practice, particularly when paired with Cat Pose, forming a fluid motion that stimulates the spine and enhances spinal mobility. Traditionally, Cow Pose is used in sequences to improve posture, stretch the front body, and activate the core. It is recognized for its ability to release tension in the back, chest, and shoulders, while also encouraging an open heart. Frequently incorporated into Vinyasa, Hatha, and other styles of yoga, Cow Pose not only improves physical flexibility but also promotes mental clarity and emotional release."
  },
  {
    "id": 5,
    "name": "Child's Pose",
    "sanskrit_name": "बालासन",
    "other_names": [""],
    "sanskrit_translation": "Balasana",
    "sanskrit_pronunciation": "[ bah-LAH-suh-nuh ]",
    "context": "The name Balasana, or Child’s Pose, is derived from the Sanskrit words Bala (बाल) meaning 'child' and Asana (आसन) meaning 'pose' or 'posture.' This pose is often likened to the way a child naturally curls up into a restful, protective position. It embodies qualities of relaxation, surrender, and grounding. Child’s Pose has been an integral part of yoga for centuries, used in various traditional practices as a restorative posture to calm the body and mind. It is commonly employed as a resting pose in sequences, allowing practitioners to re-center and restore energy. Over time, it has become a fundamental pose in many yoga styles, including Vinyasa and Hatha Yoga, providing a moment of respite and deep stretching. Today, Child’s Pose is widely recognized not only for its physical benefits, such as easing tension in the back, hips, and thighs, but also for its ability to promote emotional calm and mental clarity."
  }
]