[
  {
    "id": 1,
    "name": "Mountain Pose",
    "sanskrit_name": "ताड़ासन",
    "other_names": ["Equal Standing Pose"],
    "sanskrit_translation": "Tadasana",
    "sanskrit_pronunciation": "[ tah-DAH-suh-nuh ]",
    "context": "The etymology of Tāḍāsana comes from two Sanskrit words: Tāḍa (ताड), meaning 'mountain,' and Āsana (आसन), meaning 'posture' or 'seat.' The term Tāḍa symbolizes the solid, stable, and grounded nature of a mountain, which reflects the strength and steadiness that the pose embodies. Āsana is a common Sanskrit word used in yoga to refer to any posture. Together, Tāḍāsana translates to 'Mountain Pose,' a standing posture that emphasizes physical strength, stability, and alignment, akin to the solid foundation of a mountain. It's alternate name, Samasthitiḥ, refers to 'equal standing' or 'balanced position,' further emphasizing the balance and centeredness that the pose cultivates. Historically, Tāḍāsana did not appear in traditional Hatha Yoga texts but is mentioned in the 1896 Vyayama Dipika, a manual of gymnastics. The pose became a foundational element in modern yoga through the teachings of Krishnamacharya, who incorporated it into the practice of Vinyasa Yoga. His students, Pattabhi Jois and B.K.S. Iyengar, further popularized Tāḍāsana in their respective yoga styles, Ashtanga Vinyasa Yoga and Iyengar Yoga, where it remains a key posture. As B.K.S. Iyengar wrote in Light on Yoga, 'Tadasana is the starting point for all the standing asanas. Although it is the simplest of all asanas, it is the most difficult to master, for one has to achieve perfect body balance and the ideal alignment of the body parts.'",
    "source": "Iyengar, B.K.S. Light on Yoga. Revised edition, Schocken Books, 1979, p. 72."
  },
  {
    "id": 2,
    "name": "Hero Pose",
    "sanskrit_name": "वीरासन",
    "other_names": [],
    "sanskrit_translation": "Virasana",
    "sanskrit_pronunciation": "[ veer-AH-suh-nuh ]",
    "context": "The etymology of Vīrāsana comes from two Sanskrit words: Vīra (वीर), meaning 'hero' or 'warrior,' and Āsana (आसन), meaning 'posture' or 'seat.' Vīra represents strength, courage, and nobility, qualities associated with a hero, which the pose aims to embody. Āsana, a term commonly used in yoga, refers to any posture, so Vīrāsana translates to 'Hero Pose,' a seated posture that encourages openness, balance, and grounding. In this pose, the practitioner sits on their legs, with their knees bent and thighs grounded, creating a feeling of rootedness and stability. Vīrāsana can also open the chest and stretch the thighs, ankles, and knees. Historically, this posture is mentioned in the classical texts of Hatha Yoga, and it is often practiced as a meditative pose or a preparatory posture for other seated postures. Its practice emphasizes physical endurance, focus, and a sense of strength, embodying the spirit of a hero."
  },
  {
    "id": 3,
    "name": "Lotus Pose",
    "sanskrit_name": "पद्मासन",
    "other_names": [],
    "sanskrit_translation": "Padmasana",
    "sanskrit_pronunciation": "[ pahd-MAH-suh-nuh ]",
    "context": "The name Padmāsana is derived from Sanskrit, with Padma (पद्म) meaning 'lotus' and Āsana (आसन) meaning 'posture' or 'pose.' Thus, the name translates to 'Lotus Pose,' evoking the image of a lotus flower, which symbolizes purity, beauty, and spiritual growth. In this pose, the practitioner sits with crossed legs, placing each foot on the opposite thigh, which creates an open, stable base for meditation and deep contemplation. The posture reflects qualities of balance, inner peace, and groundedness, offering a sense of stillness and connection to the present moment. Historically, Padmāsana has been a vital pose in spiritual and meditative practices, particularly in Hinduism and Buddhism, symbolizing the union of body, mind, and spirit. It became widely practiced in modern yoga through the teachings of ancient masters and continues to be a central posture in meditation and pranayama. Today, Lotus Pose is embraced for its ability to improve flexibility in the hips, knees, and ankles, as well as its profound effect on calming the mind and enhancing concentration."
  },
  {
    "id": 4,
    "name": "Staff Pose",
    "sanskrit_name": "दण्डासन",
    "other_names": [],
    "sanskrit_translation": "Dandasana",
    "sanskrit_pronunciation": "[ dan-DAH-suh-nuh ]",
    "context": "The name Dandasana is derived from Sanskrit, with Danda (दण्ड) meaning 'staff' or 'rod' and Asana (आसन) meaning 'pose' or 'posture.' Therefore, Dandasana translates to 'Staff Pose,' symbolizing a straight and stable staff. This pose reflects strength, alignment, and mindfulness, as it requires practitioners to sit tall with the spine elongated and the legs extended forward. Dandasana serves as a foundation for many seated poses and forward bends, helping to build core strength, stability, and awareness of posture. It also promotes mental focus, encouraging practitioners to stay grounded and centered."
  },
  {
    "id": 5,
    "name": "Table Top Pose",
    "sanskrit_name": "भार्मणासन",
    "other_names": [],
    "sanskrit_translation": "Bharmanasana",
    "sanskrit_pronunciation": "[ bhahr-mah-NAH-suh-nuh ]",
    "context": "The name Bharmanasana comes from Sanskrit, with Bharmana (भार्मण) meaning 'stable or balanced,' and Asana (आसन) meaning 'pose' or 'posture.' Thus, Bharmanasana translates to 'Stable Pose,' reflecting the grounded and stable position of the body on all fours, resembling a flat, steady surface like a tabletop. This pose forms the foundation for many yoga movements, providing balance and alignment as it strengthens the wrists, arms, and core. Historically, Bharmanasana is an integral part of yoga, used to develop strength, flexibility, and stability. It has become a cornerstone of modern yoga practice, often used as a preparatory posture for more advanced poses or as a transition within a flowing sequence. Today, Tabletop Pose is a fundamental part of many styles of yoga, such as Vinyasa and Hatha, offering a solid base for improving posture and body awareness."
  },
  {
    "id": 6,
    "name": "Cat Pose",
    "sanskrit_name": "मार्जरासन",
    "other_names": [],
    "sanskrit_translation": "Marjaryasana",
    "sanskrit_pronunciation": "[ mar-JAH-ree-AH-suh-nuh ]",
    "context": "The name Marjaryasana, or Cat Pose, is derived from the Sanskrit words Marjara (मार्जर) meaning 'cat' and Asana (आसन) meaning 'pose' or 'posture.' This pose mimics the natural movement of a cat stretching its spine, offering a rejuvenating stretch that targets both the upper and lower body. Cat Pose has long been an essential part of yoga, incorporated into sequences to promote spinal flexibility and engage the core. Often paired with Cow Pose, this dynamic movement helps to increase mobility in the spine while also providing relief from tension in the back, neck, and shoulders. Practitioners use Cat Pose to connect with their breath, aiding in mental clarity and calming the mind. It has become a fundamental pose in yoga practices such as Hatha, Vinyasa, and Restorative Yoga, valued for both its physical and mental benefits."
  },
  {
    "id": 7,
    "name": "Cow Pose",
    "sanskrit_name": "बिटिलासन",
    "other_names": [],
    "sanskrit_translation": "Bitilasana",
    "sanskrit_pronunciation": "[ bee-TEE-lah-suh-nuh ]",
    "context": "The name Bitilasana, or Cow Pose, is derived from the Sanskrit words Bitila (बिटिल) meaning 'cow' and Asana (आसन) meaning 'pose' or 'posture.' This pose is often associated with the graceful, expansive stretch of a cow’s chest and neck, helping to open up the body and encourage a deep, full breath. Cow Pose is a key part of yoga practice, particularly when paired with Cat Pose, forming a fluid motion that stimulates the spine and enhances spinal mobility. Traditionally, Cow Pose is used in sequences to improve posture, stretch the front body, and activate the core. It is recognized for its ability to release tension in the back, chest, and shoulders, while also encouraging an open heart. Frequently incorporated into Vinyasa, Hatha, and other styles of yoga, Cow Pose not only improves physical flexibility but also promotes mental clarity and emotional release."
  },
  {
    "id": 8,
    "name": "Child's Pose",
    "sanskrit_name": "बालासन",
    "other_names": [""],
    "sanskrit_translation": "Balasana",
    "sanskrit_pronunciation": "[ bah-LAH-suh-nuh ]",
    "context": "The name Balasana, or Child’s Pose, is derived from the Sanskrit words Bala (बाल) meaning 'child' and Asana (आसन) meaning 'pose' or 'posture.' This pose is often likened to the way a child naturally curls up into a restful, protective position. It embodies qualities of relaxation, surrender, and grounding. Child’s Pose has been an integral part of yoga for centuries, used in various traditional practices as a restorative posture to calm the body and mind. It is commonly employed as a resting pose in sequences, allowing practitioners to re-center and restore energy. Over time, it has become a fundamental pose in many yoga styles, including Vinyasa and Hatha Yoga, providing a moment of respite and deep stretching. Today, Child’s Pose is widely recognized not only for its physical benefits, such as easing tension in the back, hips, and thighs, but also for its ability to promote emotional calm and mental clarity."
  },
  {
    "id": 9,
    "name": "Puppy Pose",
    "sanskrit_name": "उत्तान शिशोसन",
    "other_names": [],
    "sanskrit_translation": "Uttana Shishosana",
    "sanskrit_pronunciation": "[ ooh-TAH-nuh shih-SHOH-suh-nuh ]",
    "context": "The name Puppy Pose, or Uttana Shishosana (उत्तान शिशोसन), is derived from Sanskrit, where Uttana (उत्तान) means 'intense stretch,' Shisho (शिशु) means 'puppy' or 'child,' and Asana (आसन) refers to a 'pose' or 'posture.' Together, the name translates to 'Extended Puppy Pose,' evoking the playful and instinctive stretch of a young dog. This name reflects the posture's heart-opening and grounding nature, as well as its connection to innocence and trust. While the pose does not have a direct mention in ancient yoga texts, its alignment and benefits align with traditional practices of creating openness and ease in the body. Today, it is embraced in modern yoga for its restorative qualities and its ability to bridge playful movement with mindful stillness."
  },
  {
    "id": 10,
    "name": "Tree Pose",
    "sanskrit_name": "वृक्षासन",
    "other_names": [],
    "sanskrit_translation": "Vrksasana",
    "sanskrit_pronunciation": "[ vrik-SHAH-suh-nuh ]",
    "context": "The term Vrksasana is derived from the Sanskrit word Vṛkṣa (वृक्ष), meaning 'tree,' and Asana (आसन), meaning 'pose' or 'posture.' Together, the name translates to 'Tree Pose,' symbolizing the strength, stability, and rootedness of a tree while embodying the graceful, balanced nature of its form. This posture evokes the image of a tree with deep roots and a tall, steady trunk, reflecting the sense of grounding and growth that the pose nurtures. Historically, Vrksasana has been practiced in various forms within traditional yoga, with its roots deeply embedded in ancient texts that emphasize balance and stillness. In modern yoga, Tree Pose became an essential part of standing sequences and is often used in practices like Vinyasa and Hatha yoga, where it aids in building strength, improving focus, and enhancing coordination. Today, it serves as both a physical posture for improving balance and flexibility and a mental practice for cultivating mindfulness and calm."
  },
  {
    "id": 11,
    "name": "Bound Angle Pose",
    "sanskrit_name": "बद्धकोणासन",
    "other_names": ["Butterfly Pose"],
    "sanskrit_translation": "Baddha Konasana",
    "sanskrit_pronunciation": "[ BAH-ddhah KOH-nah-suh-nuh ]",
    "context": "The etymology of Bound Angle Pose, or Baddha Konasana, comes from the Sanskrit words Baddha (बद्ध), meaning 'bound' or 'tied,' and Konasana (कोणासन), which is derived from kona (कोण), meaning 'angle,' and asana (आसन), meaning 'pose' or 'posture.' Together, Baddha Konasana translates to 'Bound Angle Pose,' referring to the position where the soles of the feet are pressed together, and the knees are drawn out to the sides, forming a 'bound' or closed angle between the legs. The pose is known for its deep stretch of the inner thighs, groin, and hips, creating a sensation of openness and flexibility in the lower body. Historically, Baddha Konasana has been practiced for centuries, especially in Hatha Yoga, and is considered a fundamental pose in many yoga traditions for its benefits in hip flexibility and grounding."
  },
  {
    "id": 12,
    "name": "Supine Spinal Twist Pose",
    "sanskrit_name": "सुप्त मत्स्येन्द्रासन",
    "other_names": [],
    "sanskrit_translation": "Supta Matsyendrasana",
    "sanskrit_pronunciation": "[ soop-TAH maht-syen-DRAH-suh-nuh ]",
    "context": "The name 'Supta Matsyendrasana' comes from Sanskrit, with 'Supta' meaning 'reclining' and 'Matsyendra' referring to the sage Matsyendra, a revered figure in yoga tradition. 'Asana' means 'pose' or 'posture,' making Supta Matsyendrasana the 'Reclining Spinal Twist Pose.' This posture is a gentle twist that stretches and lengthens the spine, hips, and shoulders while offering a deep release of tension in the lower back. Rooted in traditional yoga practices, this pose is recognized for its therapeutic benefits, promoting spinal health, digestion, and relaxation. In modern yoga, it is widely practiced in various styles, often included in cool-down sequences or used as a restorative pose to calm the mind and body, aiding in stress relief and mental clarity."
  },
  {
    "id": 13,
    "name": "Happy Baby Pose",
    "sanskrit_name": "आनन्द बालासन",
    "other_names": [],
    "sanskrit_translation": "Ananda Balasana",
    "sanskrit_pronunciation": "[ AH-nahn-dah BAH-lah-suh-nuh ]",
    "context": "The name Happy Baby Pose, or Ananda Balasana, is derived from two Sanskrit words: Ananda (आनन्द), meaning 'bliss' or 'happiness,' and Balasana (बालासन), which translates to 'child's pose.' The name reflects the playful and joyful nature of the pose, which is said to evoke the carefree and happy disposition of a baby. The pose mimics the natural position babies often take when lying on their backs, bringing a sense of innocence, relaxation, and contentment to the practitioner. Historically, the pose has roots in traditional yoga practices, where it was used to release tension in the lower back and hips while promoting a sense of ease and relaxation. In modern yoga, Happy Baby Pose is often included in restorative and prenatal sequences, as well as in more active flows, due to its ability to gently open the hips and lower body. It serves not only as a physical stretch but also as a tool for grounding and calming the mind, offering a moment of playfulness and joy amidst the intensity of practice. Today, Happy Baby Pose remains a favorite for its combination of physical benefits and emotional relief, allowing practitioners to embrace a sense of lightness and joy."
  },
  {
    "id": 14,
    "name": "Corpse Pose",
    "sanskrit_name": "शवासन",
    "other_names": [],
    "sanskrit_translation": "Savasana",
    "sanskrit_pronunciation": "[ shah-VAH-suh-nuh ]",
    "context": "The term 'Corpse Pose' is derived from the Sanskrit word 'Savasana' (शवासन), where 'Shava' (शव) means 'corpse' and 'Asana' (आसन) means 'pose' or 'posture.' Thus, 'Savasana' translates to 'Corpse Pose,' symbolizing the act of surrender and letting go, much like a lifeless body. The posture invites the practitioner to lie in a state of complete stillness, allowing the body to relax and the mind to enter a meditative state. Traditionally, Savasana is practiced at the end of a yoga session to absorb the benefits of the preceding poses, promote deep relaxation, and foster mindfulness. While it may seem simple, the pose requires the practitioner to release all effort and achieve a state of conscious relaxation. The origins of Savasana are rooted in ancient yoga texts, where it was used not only for physical restoration but also for spiritual and mental rejuvenation. Today, it is considered an essential part of yoga practice, providing a moment of peace and integration that enhances the overall benefits of the practice."
  },
  {
    "id": 15,
    "name": "Plank Pose",
    "sanskrit_name": "फलाकासन",
    "other_names": ["High Plank Pose"],
    "sanskrit_translation": "Phalakasana",
    "sanskrit_pronunciation": "[ fuh-LAHK-ah-suh-nuh ]",
    "context": "The name Plank Pose is often referred to as Phalakasana in Sanskrit, with Phalaka (फलक) meaning 'plank' or 'board,' and Asana (आसन) meaning 'pose' or 'posture.' This name directly reflects the shape the body takes while in the pose, which resembles a straight, firm plank or board. The pose is rooted in traditional yoga practices and has been used for centuries to build core strength, stability, and endurance. While it may not appear in the earliest texts like the Hatha Yoga Pradipika, variations of the pose have long been included in strength-building sequences and as part of dynamic physical practices. Plank Pose has gained popularity in modern yoga, particularly in Vinyasa and Power Yoga, where it is often integrated into sun salutations or used as a transition between postures. It became more widely recognized as yoga evolved in the 20th century, especially through the teachings of influential yoga masters like T. Krishnamacharya, Pattabhi Jois, and B.K.S. Iyengar, who emphasized the importance of building strength and stability in the body. Today, Plank Pose is considered a foundational posture in many yoga practices, valued for its ability to engage the entire body and enhance both physical and mental endurance."
  },
  {
    "id": 16,
    "name": "Four-Limbed Staff Pose",
    "sanskrit_name": "चतुरङ्ग दण्डासन",
    "other_names": ["Chaturanga"],
    "sanskrit_translation": "Chaturanga Dandasana",
    "sanskrit_pronunciation": "[ chuh-too-RAHN-gah dahn-DAH-suh-nuh ]",
    "context": "The name Chaturanga Dandasana is derived from Sanskrit, where Chatur (चतुर) means 'four,' Anga (अङ्ग) means 'limbs,' Danda (दण्ड) means 'staff,' and Asana (आसन) refers to 'pose' or 'posture.' Together, the name translates to 'Four-Limbed Staff Pose,' symbolizing the body held straight and firm like a staff, supported by four points: the hands and feet. This pose reflects strength, stability, and precision, embodying the disciplined and mindful aspects of yoga practice. Historically, Chaturanga Dandasana has its roots in traditional yoga texts and has been a key component of Surya Namaskara (Sun Salutations), a practice originating in ancient India. It gained prominence in modern yoga through the Vinyasa and Ashtanga styles, as taught by T. Krishnamacharya and his students, including Pattabhi Jois, who used it as a transitional pose to build strength and stamina. Today, it serves as a fundamental element in dynamic yoga sequences, laying the groundwork for arm balances and advanced postures while reinforcing the connection between breath, movement, and core stability."
  },
  {
    "id": 17,
    "name": "Upward-Facing Dog",
    "sanskrit_name": "उर्ध्व मुख श्वानासन",
    "other_names": ["Up Dog"],
    "sanskrit_translation": "Urdhva Mukha Svanasana",
    "sanskrit_pronunciation": "[ OORD-vah MOO-kah shvah-NAH-suh-nuh ]",
    "context": "The name Urdhva Mukha Svanasana is derived from Sanskrit, with Urdhva (उर्ध्व) meaning 'upward,' Mukha (मुख) meaning 'face,' and Svana (श्वान) meaning 'dog,' while Asana (आसन) refers to 'pose' or 'posture.' Thus, the name translates to 'Upward-Facing Dog Pose,' evoking the image of a dog stretching its chest and lifting its head and body toward the sky. This pose mimics the natural stance of a dog stretching after rest, embodying qualities of strength, openness, and vitality. Historically, Urdhva Mukha Svanasana has been a key component of yoga practice, appearing in classical texts such as the Hatha Yoga Pradipika. It gained significant prominence in modern yoga, especially through the teachings of T. Krishnamacharya and his students, including Pattabhi Jois and B.K.S. Iyengar, who integrated it into their respective styles. Today, Upward-Facing Dog is an essential posture in Vinyasa and Hatha Yoga practices, widely practiced to improve spinal flexibility, chest expansion, and overall body strength."
  },
  {
    "id": 18,
    "name": "Downward-Facing Dog",
    "sanskrit_name": "अधोमुखश्वानासन",
    "other_names": ["Down Dog"],
    "sanskrit_translation": "Adho Mukha Svanasana",
    "sanskrit_pronunciation": "[ AH-doh MOO-kah shvah-NAH-suh-nuh ]",
    "context": "The name Adho Mukha Svanasana is derived from Sanskrit, with Adho (अधो) meaning 'downward,' Mukha (मुख) meaning 'face,' and Svana (श्वान) meaning 'dog,' while Asana (आसन) refers to 'pose' or 'posture.' Thus, the name translates to 'Downward-Facing Dog Pose,' evoking the image of a dog stretching its body with its front legs extended and hips raised. This pose mimics the natural stance of a dog stretching after waking, embodying qualities of flexibility, strength, and openness. Historically, Adho Mukha Svanasana has been a core part of yoga practice, appearing in various forms in traditional texts such as the Hatha Yoga Pradipika. It gained further prominence in modern yoga through the teachings of T. Krishnamacharya and his students, including Pattabhi Jois and B.K.S. Iyengar, who incorporated it into their respective yoga styles. Today, it is considered one of the most essential poses in Vinyasa and Hatha Yoga practices, serving as a key foundation for strength, flexibility, and alignment."
  },
  {
    "id": 19,
    "name": "Garland Pose",
    "sanskrit_name": "मालासन",
    "other_names": [],
    "sanskrit_translation": "Malasana",
    "sanskrit_pronunciation": "[ mah-LAH-suh-nuh ]",
    "context": "The name Malasana is derived from the Sanskrit words 'Mala' (माल) meaning 'garland' and 'Asana' (आसन) meaning 'pose' or 'seat.' The term 'garland' reflects the imagery of the body’s shape in the pose, with the arms wrapped around the legs resembling a garland or wreath. This name also evokes the spiritual symbolism of malas, or prayer beads, which are often used in meditation to focus the mind. Malasana, with its grounding squat posture, represents a connection to the earth and roots, reflecting its use in traditional practices that emphasize humility, grounding, and inner focus. While the pose has its origins in ancient yogic traditions, it has been adapted and popularized in modern yoga as an essential posture for hip flexibility, digestion, and grounding energy. Its simplicity and depth make it a staple in many yoga sequences, embodying both the physical and spiritual aspects of yoga practice."
  },
  {
    "id": 20,
    "name": "Frog Pose",
    "sanskrit_name": "मंडूकासन",
    "other_names": [],
    "sanskrit_translation": "Mandukasana",
    "sanskrit_pronunciation": "[ mahn-DOO-kahs-uh-nuh ]",
    "context": "The etymology of Mandukasana, or Frog Pose, comes from the Sanskrit word Manduka (मंडूक), meaning 'frog,' and Asana (आसन), meaning 'pose' or 'posture.' Thus, Mandukasana translates to 'Frog Pose.' The posture mimics the squat position of a frog, with the knees bent wide apart and the hands placed between the legs. In this pose, the body takes on a compact, grounded shape, symbolizing the stability and flexibility of the frog. The name reflects the deep opening of the hips and the extension of the spine, as well as the ability to stay rooted while cultivating strength and flexibility. Frog Pose is a beneficial posture in yoga that targets the hips, groin, and thighs, promoting flexibility while stimulating the digestive system. It is particularly used in Hatha and restorative yoga practices for its calming and grounding effects."
  },
  {
    "id": 21,
    "name": "Goddess Pose",
    "sanskrit_name": "उत्कटकोणासन",
    "other_names": [],
    "sanskrit_translation": "Utkata Konasana",
    "sanskrit_pronunciation": "[ oot-KAH-tah koh-NAH-suh-nuh ]",
    "context": "The name Utkata Konasana is derived from Sanskrit, with Utkata (उत्कट) meaning 'fierce' or 'powerful,' and Konasana (कोणासन) meaning 'angle pose' or 'corner pose.' The term 'Utkata' conveys the intensity and strength required in the posture, while 'Konasana' refers to the external angle of the legs as they are spread wide apart, forming a powerful stance. Together, Utkata Konasana translates to 'Fierce Angle Pose,' symbolizing strength, empowerment, and stability. The pose is often associated with the image of a warrior or goddess, grounded and poised, exuding confidence and power. Although the pose itself has ancient roots in yoga, its modern popularity has grown due to its ability to engage multiple muscle groups while simultaneously opening the hips and chest. It is widely practiced in contemporary yoga sequences to enhance lower body strength, flexibility, and emotional balance. Today, Goddess Pose is a key part of many styles of yoga, including Vinyasa and Hatha, and is often used to encourage self-assurance, focus, and resilience."
  },
  {
    "id": 22,
    "name": "Pyramid Pose",
    "sanskrit_name": "पार्श्वोत्तानासन",
    "other_names": [],
    "sanskrit_translation": "Parsvottanasana",
    "sanskrit_pronunciation": "[ pah-resh-woh-TAH-nah-suh-nuh ]",
    "context": "The etymology of Parsvottanasana comes from two Sanskrit words: Parsvah (पार्श्व), meaning 'side' or 'flank,' and Uttana (उत्तान), meaning 'intense stretch' or 'stretching.' Asana (आसन), a common term in yoga, means 'pose' or 'posture.' Together, Parsvottanasana translates to 'Intense Side Stretch Pose,' referring to the deep forward fold and side stretch of the body in this posture. The name evokes the sensation of lengthening and stretching through the sides of the torso, while the alignment of the feet in the shape of a triangle resembles the form of a pyramid. Historically, Pyramid Pose was not a prominent feature in ancient texts but has evolved into a key pose within modern Vinyasa and Hatha Yoga traditions. The pose became widely incorporated into contemporary practice through the teachings of Krishnamacharya, with his students Pattabhi Jois and B.K.S. Iyengar, who helped make it a fundamental part of yoga practice, emphasizing its benefits for flexibility, strength, and mental focus."
  },
  {
    "id": 23,
    "name": "Lizard Pose",
    "sanskrit_name": "उत्थानपृष्ठासन",
    "other_names": [],
    "sanskrit_translation": "Utthan Pristhasana",
    "sanskrit_pronunciation": "[ ooth-THAHN pree-STA-suh-nuh ]",  
    "context": "The name Utthan Pristhasana is derived from Sanskrit, where Utthan (उत्थान) means 'to rise' or 'to extend,' Pristha (पृष्ठ) means 'back' or 'spine,' and Asana (आसन) means 'pose' or 'posture.' This name reflects the expansive and grounding nature of the pose, where the practitioner lowers their hips deeply and extends the back leg behind, mimicking the stretch of a lizard. Rooted in traditional yoga practices, Lizard Pose has long been used as a deep hip opener and a way to build flexibility and strength in the lower body. While it may not have appeared in early classical yoga texts, variations of the pose have been part of strength-building sequences and flexibility practices throughout history. Utthan Pristhasana has gained popularity in modern yoga, especially in dynamic styles like Vinyasa, where it is often integrated into flows to stretch and strengthen the hips, thighs, and groin. The pose became more widely embraced as yoga evolved in the 20th century, with influential masters like T. Krishnamacharya, Pattabhi Jois, and B.K.S. Iyengar emphasizing the importance of hip mobility and flexibility. Today, Lizard Pose is considered a valuable posture in many yoga practices, known for its ability to release tension, improve flexibility, and promote mental focus."
  },
  {
    "id": 24,
    "name": "Low Lunge",
    "sanskrit_name": "अञ्जनेयासन",
    "other_names": [],
    "sanskrit_translation": "Anjaneyasana",
    "sanskrit_pronunciation": "[ un-jah-NAY-ah-suh-nuh ]",
    "context": "The etymology of Anjaneyasana is derived from Sanskrit, with Anjaneya (अञ्जनेय) referring to the name of the Hindu deity Hanuman, the monkey god, who is known for his strength, devotion, and agility. Asana (आसन) means 'pose' or 'posture,' thus Anjaneyasana translates to 'Pose of Hanuman' or 'Hanuman’s Pose.' The pose is said to symbolize Hanuman’s strength and his ability to move swiftly and with power, as well as his devotion and flexibility. In the posture, the deep lunge mirrors the qualities of Hanuman's dynamic nature, with a focus on opening the hips, strengthening the legs, and lengthening the spine. Anjaneyasana has its roots in traditional yoga practices and is frequently incorporated into modern yoga sequences for its ability to build flexibility, strength, and stability. Todayt is often used to prepare the body for deeper stretches and more advanced poses, while also serving as a grounding and energizing posture."
  },
  {
    "id": 25,
    "name": "Crescent High Lunge Pose",
    "sanskrit_name": "उत्तिता अश्व संचलनासन",
    "other_names": [],
    "sanskrit_translation": "Utthita Ashwa Sanchalanasana",
    "sanskrit_pronunciation": "[ oot-TEE-tah AH-shwah sun-chah-lah-NAH-suh-nuh ]",
    "context": "The name Ashta Chandrasana is derived from Sanskrit, with Ashta (अष्ट) meaning 'eight,' Chandra (चन्द्र) meaning 'moon,' and Asana (आसन) meaning 'pose' or 'posture.' Therefore, Ashta Chandrasana translates to 'Eight-Limbed Moon Pose,' and is often referred to as Crescent Pose (as in a crescent moon). There are eight phases of the moon, with the waning crescent being the last, eighth phase, symbolizing closure, reflection, and calm. The pose evokes the imagery of the moon's gentle, curved shape, representing balance, harmony, and tranquility. Over time, the shape and flow of the pose evolved, particularly through the integration of breath and movement, which led to the more dynamic High Lunge in modern yoga. High Lunge (Utthita Ashwa Sanchalanasana) shares similarities with Ashta Chandrasana, especially in the way it engages the legs and hips, but with a more pronounced deep lunge and a focus on strength and stability. In this evolution, the alignment of the body became more focused on lengthening the spine and building core strength, leading to the pose we recognize today. Ashta Chandrasana and its evolution into High Lunge both serve to enhance flexibility and strength in the legs, hips, and core, while fostering a sense of grace and focus."
  }
]